[{"category": "hotel", "review_count": "877", "title": "Grand Waikikian by Hilton Grand Vacations Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "1811 Ala Moana Blvd, Honolulu, Oahu, HI 96815", "review_list": ["\nIf you can, you need to stay here. If you can't stay, it's worth visiting. Walk around the Hawaiian village and shops. Our room wasn't ocean front... But ocean view. Loved the lobby area. Plenty of restaurants nearby, walking distance. If you need any last minute items, I recommend the ABC stores. Great alternative with gift items, food, drinks, toiletries...\n\n\nMore  \n\n\n", "\nAloha spirit lives here. Staff always helpful, not always knowledgeable but willing to find out. Parking is a little high $30/night valet only but public transportation of various types are available and most are just a slight walk away.\n", "\nGreat stay at the Hilton Hawaiian Village. Beautiful resort with many pools, lagoon and beaches. Room was comfortable and good size but disappointed with the view. Beach umbrellas very pricey at $60 for umbrella and to chairs so take your own. Good restaurant selection with a live band in the evening.\n", "\nWe always stay at the Grand Waikikian. We love visiting this resort. It has many wonderful amenities and it is very beautiful. The rooms are very nice and roomy unless you stay on the end. The 2 bedroom end units either have a beautiful ocean front view or a view of the city. The downside to these units is they...\n\n\nMore  \n\n\n", "\nhad an amazing week at the Hilton Grand Vacations resort in Honolulu Hawaii. Wonderful room and amenities, great location on the beach and only 2 miles from Diamond Head. the resort pools close early, many food and shopping options on site- although they need more \"local inspired\" food option in the Hilton Hawaiian village. overall 10/10!\n", "\n2 BR condo was nice but had a few maintenance issues, which they did fix pretty quickly. There were a few spots that could have used more cleaning but it wasn't terribly bad. Beds were OK but a little firm for my taste. Kitchen is small but did have almost everything we needed, except salt & pepper. Pools were nice,...\n\n\nMore  \n\n\n", "\nSecond time my family has stayed at the Waikikian. Had a two bedroom corner with two balcony's on the 12th floor. Great view. As an elite premier owner I have two complaints and they are the same two complaints I had 5 yrs ago when I stayed there. 1st, elite members should have a guaranteed checkout later than 10:00am. I...\n\n\nMore  \n\n\n", "\nThis property is of the same great standards of a HGVC developed property. The room was clean and very up to date. The staff was helpful and friendly. Even though the Hilton Hawaiian Village is a large complex, everything is accessible. My only wish is that they had a quiet bar for an evening drink. The bar by the beach...\n\n\nMore  \n\n\n", "\nWe stayed in a one bedroom plus suite room on the 19th floor. Fantastic city views and a partial view of the ocean. The suite was wonderful, nice wood floors, full kitchen, water/dryer, big tub, bedroom, etc. The lobby and area around the hotel is top notch, clean, and beautiful artwork. But the best part is the actual Hilton Hawaiian...\n\n\nMore  \n\n\n", "\nWe stayed at The Grand Waikian at Hilton and had a wonderful time. We came with our two small kids under 3 and loved everything about the stay here. The resort and the amenities and staff were just so wonderful. Highly recommend as a great place to relax.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/0c/97/a8/paradise-pool.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "11250", "title": "Hilton Hawaiian Village Waikiki Beach Resort, Hawaii/Honolulu", "rating_string": "4.0", "address": "2005 Kalia Road, Honolulu, Oahu, HI 96815", "review_list": ["\nIf you are looking for a resort experience where you can pretty much park it for the duration of your visit, the Hilton Hawaiian Village is a good choice. There are a number of shops and restaurants on site, and transportation available by bus to most places you'd want to visit - if you are trying to avoid having a...\n\n\nMore  \n\n\n", "\nWe love coming to Waikiki and have always walked through the Hilton Hawaiian Village during our stays, and this time, decided to stay here. It was great! Our room was only 4 floors from the top in the rainbow tower facing the ocean (diamond head direction). It was literally an amazing view. The ocean right in front on the village...\n\n\nMore  \n\n\n", "\nMy trip was purely business but it was quite relaxing staying here. I got upgraded to a beach front view in the rainbow tower it was spectacular! I had two balconies and one of the best views for a sunset. You can also park yourself and save a few dollars. Not as many restaurants in walking distance compared to other...\n\n\nMore  \n\n\n", "\nHad an awesome time at this spot. It has everything. The beach, the sun, the beverages and great food. Lots of choices for dining. Great room with two balconies. Go back there in a heart beat. Being right on the beach, we were within walking distance of several bars and beach side restaurants and a couple marinas. Got to go...\n\n\nMore  \n\n\n", "\nThe check in was easy. With Hilton Honors membership you can check in the day before. They have people roaming the lobby to help and I was directed immediately to a very friendly clerk to get my keys. We got an ocean front room on the 27th floor in the Rainbow Tower. It had one of the best views I...\n\n\nMore  \n\n\n", "\nStay at HHV for 2 week in late January/early February 2016. As a Hilton Honors Gold member, I called a day ahead of time and got upgraded to an ocean front room in the Rainbow Tower. The higher up, the better your view is. We stayed near the top floor, the 29th. The view was better than expected. The beach,...\n\n\nMore  \n\n\n", "\nFirst I better tell people that travel to places like Cancun, this is nothing like that. Hawaii is a lot more laid back and there seems to be a lot more families and an older crowd. This is not a good hotel if you are looking to party.\nI stayed at this hotel in November of 2015 and found it...\n\n\nMore  \n\n\n", "\nSecond time saying here but we didn't enjoy it that much this time around. We booked an ocean view room in the Rainbow Tower and ended up with a view of the lagoon/car parks/crane. We couldn't really see the ocean at all. Was very disappointed as it was my 50th birthday and all we got from front desk was \"...\n\n\nMore  \n\n\n", "\nThe place was amazing it had everything you could want. A lagoon for relaxing in a nice size pool and best of all the beach was right there. The rooms where very nice. The staff and the service was very good. It also is in walking distance for shopping and restaurants. Also they have buses & trolley you can take....\n\n\nMore  \n\n\n", "\nHotel staff were great, location was great. The reason for the 2 stars is the state of the room. There were holes in the walls, the outlets on both lamps in the room were faulty, water damage in the shower on the roof, and double beds ... doubles. Wth.\nI will not be staying at this hotel on our return...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/a0/36/ff/fireworks.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "4782", "title": "Outrigger Reef Waikiki Beach Resort Hotel, Hawaii/Honolulu", "rating_string": "4.5", "address": "2169 Kalia Rd., Honolulu, Oahu, HI 96815", "review_list": ["\nMy wife and I were invited to a destination wedding for a friend's daughter in Waikiki. We booked a room at the Reef where we had stayed on our first trip to Hawaii in the late 70's. The location was excellent. Partial ocean view was compact but we'll laid out. Hotel amenities and location was ideal. The room included a...\n\n\nMore  \n\n\n", "\nOne of my favorite hotels - I would definitely come back. There are plenty of shops, restaurants, and amenities on site that would allow you to stay at the hotel and not have to leave the property if you didn't want to.\n*Resort Fee - although I read quite a few reviews that said there wasn't one, we were charged...\n\n\nMore  \n\n\n", "\nI stayed at this hotel with a friend in a double room for 10 nights. It was a first time in Waikiki so the convenience of the location really suited us. We found that staff to be really accommodating. Patrick at the activities desk was really helpful and provided us with some really cost effective and fun options for first...\n\n\nMore  \n\n\n", "\nI stayed one night at the end of January, I originally booked Hyatt, but we extended our stay in Honolulu and there was no more rooms in Hyatt therefore we booked this hotel.\nI work in the hotel industry, I do this for living and I am a Manager in a hotel in Sydney, Australia, hence I am very particular...\n\n\nMore  \n\n\n", "\nWe were only able to stay two nights in such a great hotel due to our departure to the Big Island, but the hotel, the beach, and our Ocean View room were immaculate. The hotel staff were gracious, courteous, and helpful for our first time on the beach. The sunset was terrific from the bar.\n", "\nWe had a balcony room with partial sea view which gave us a great view of the sunsets. The room was large and comfortable, with walk in wardrobe, safe and tea/coffee making facilities. Breakfast buffet at Duke's was fantastic, and the bar itself is great - although it is very popular, which meant that some nights we struggled to get...\n\n\nMore  \n\n\n", "\nNeedless to say it stands at great location -just in front of the beach. It has nice swimming pool surrounded by nice restaurants and bars. My daughter seven years old really enjoyed both pool having good access to the beach. She also enjoyed baking the meat for burger or stake at one of the restaurants ground floor. It's really a...\n\n\nMore  \n\n\n", "\nWe stayed here twice on our recent holiday - first when we arrived for three days before we moved to the other side of the island to a house with friends and for one night after our stay in Maui. On our first visit we were apparently upgraded from a city room. Although the room was spotless and well supplied...\n\n\nMore  \n\n\n", "\nAs the title suggests this was our third stay at this hotel. We keep returning for many reasons such as it's great location, reasonable price and wonderful staff. Our partial ocean view room which overlooked the pool area was clean and comfortable. At the end of the day we enjoyed sitting on the lanai listening to the soothing Hawaiian music...\n\n\nMore  \n\n\n", "\nThe place was clean fantastic location, great views. It was perfect, the people that manage it were very friendly, and accommodating, the rooms are spacious .I want to go back with my family and stay there.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/49/a4/83/outrigger-reef-waikiki.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "3272", "title": "Waikiki Beach Marriott Resort & Spa, Hawaii/Honolulu", "rating_string": "4.0", "address": "2552 Kalakaua Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nWe stayed at Marriott Waikiki beach in December for a few days. Tara from the concierge service was extrememly helpful and knowledgable.\nWe are very impressed with her multitasking and attention to detail skills. With her help, we were able to identify and book the right activities for the family quickly.\nTara definitely made our family trip extra special!\n", "\nFor an almost $400 room, the room was bland and uninspiring, the hotel equally bland, but really it was the service that disappointed! From the front desk, to the bell service, to the room service, no one seemed to really see us, anticipate our needs or try to make our stay magical. The result was clinical. If you make the...\n\n\nMore  \n\n\n", "\nThis hotel is great!! The only reason I didn't score it a 5, is because this is the last stop on all the tours to be picked up and dropped off. With all the things to do here on the island, the concierge desk is always busy, so when you call them on the phone, it goes to voice mail...\n\n\nMore  \n\n\n", "\nFirst, this was one of the best Marriott properties I've visited in a long time!!\nPros\n-Top 3 Marriott gym in the world (that good)\n-Two minute walk to beach\n-You're in the middle of everything on Waikiki\n-Cleanliness of the facility\n-Jr Suite was amazing with beach and mountain views\n-You can see the daily sunset from the balcony...\n\n\nMore  \n\n\n", "\nOur room was enormous, super clean. The staff, front desk, and food options were way above the norm. The hotel is situated in a mall with a variety of stores. We had the opportunity to eat at the grill buffet virtually every am, we also dined at the steakhouse. Absolutely will book there again when we go back to Hawaii\n", "\nBeing Marriott Gold Elite Members, we stay in a lot of Marriott Hotels. It is a given that they will have better than average accommodations, even at the smaller chains, so on this trip we opted to try a Courtyard we had stayed in a few years ago as part of a layover from Oahu to Kauai. Upon getting to...\n\n\nMore  \n\n\n", "\nThis was a first class hotel with excellent rooms,good restaurants, and great staff. We enjoyed the location near the beach and shops, as well as a variety of restaurants. The workout facility and heated swimming pools were an added bonus.\n", "\nNice room, with plenty of space, and the view from our small private balcony was gorgeous. There was a small safe in the closet, and a mini fridge to keep a bottle of wine chilled. We had their buffet breakfast, and while it wass quite pricey, it did have a wonderful array of delicious foods, including fresh fruit and pastries,...\n\n\nMore  \n\n\n", "\nYes, my husband is cheap. Since he was going to Oahu for business he suggested we combine it with our 25th anniversary trip since his company was paying for his RT air fare and a few nights of hotel and rental car. It also meant that we needed a reasonably priced hotel, and the Marriott was reasonably priced.\nThe front...\n\n\nMore  \n\n\n", "\nI love this hotel for how close it is to the beach. It is as if the beach is in your backyard.\nThe rooms and the service are amazing as well. I look forward to my next stay in Hawaii.\nI hope you have just as great of a time there as I did.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/02/21/23/98/waikiki-beach-marriott.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "3208", "title": "Hilton Waikiki Beach Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2500 Kuhio Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nThe Waikiki Hilton is about one block from the beachfront, and is a treasure. The entire staff was courteous and friendly making us feel like Ohana (family). Ms Frills at the front desk made it her business to personally ensure our stay was memorable to include knowing us by name as we approached and seeing that we had everything we...\n\n\nMore  \n\n\n", "\nOur stay here was absolutely amazing\nEvery dream of Hawaii can true at this location\nWhat you dream you first experience will be is what this hotel offers\nStaff is amazing\nRoom are above and beyond excellent\nYou will never have a need or epwant at this hotel\n", "\nroom is not big but enough stay. Location is good near to the Waikiki beach Concierge is nice to help you to book any trip. Parking guys is so nice to people. Food is good and the restaurant is open for 24/7\n", "\nThe hotel was very nice, everyone was friendly. The valet parking was perfect.\nI ate at the Mac bar and grill and few\nTimes. Food was decent, nothing to write home about but I was impressed with their selection of beer!\nThe room was great. Very clean and accommodating with a nice view of the city.\n", "\nThe staff at the Hilton were great they even upgraded us. But it really is just a transit Hotel there is no extra mile because it really is just too big for its own good. We had to pay extra for a kids fold out and it was hard as rocks. The pool was too crowded and we couldn't get...\n\n\nMore  \n\n\n", "\nWe last visited Honolulu 4 years ago. When we were looking at options for our Jan/Feb 2016 trip, we checked out this property again. It's located in a great quiet area of Kuhio just minutes away from the beach. The rooms are well-appointed and modern. The staff is overwhelmingly friendly and helpful and willing to go the extra distance for...\n\n\nMore  \n\n\n", "\nWe spent a wonderful 7 days at this Hilton. The service from the start to the end of our trip was outstanding. The hotel is a short walk to the beach and shopping. We rented a car and never had to wait more than 5 minutes for the valet to bring it down to us.\n", "\nBA booked this hotel for us as part of a trip to Hawaii and Los Angeles.Our room on the 18th floor looked away from the sea ,but had excellent facilities and a small balcony ,just big enough for two chairs .There is a pool and spa bath on the 10th floor with plenty of sun loungers and a bar. The...\n\n\nMore  \n\n\n", "\nI made reservation by calling Hilton directly, which got somebody on the phone in India. All set, I arrived on January 28th, tried to check in and was told that my reservation was cancelled (not by me for sure!!). Of course, there were no rooms available this being Pro Bowl weekend and USA Cheerleaders had a large number of the...\n\n\nMore  \n\n\n", "\nWe had a sea view room. It was lovely to sit on the small balcony and just watch life going on at Waikiki Beach. The hotel is literally a block away from the sea front. Our room was quite large and very comfortable- very light and airy. Staff were friendly and helpful. We would most definitely stay here again when...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/07/88/d2/83/hilton-waikiki-beach.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2128", "title": "Trump International Hotel Waikiki, Hawaii/Honolulu", "rating_string": "4.5", "address": "223 Saratoga Road, Honolulu, Oahu, HI 96815", "review_list": ["\nHad a wonderful stay at the Trump in Waikiki. Location is prime though not directly on the beach...but walking distance to most of Waikiki main streets and the beach itself. The service was excellent throughout our 7 night stay. I loved that there was an endless supply of fresh towels in our bathroom throughout the day. The room was spotless...\n\n\nMore  \n\n\n", "\nBest place to stay!!!!! Perfect location!!!!walking distance to everything in wikikiii.\nThe staff treats you like royalty!!!!! If you need something they will find or do it for you.\nI could not be happier with my stay here.\n", "\nOur very first time in Honolulu and booked the best hotel here. Flight was early so we arrived to do the checkin, paid extra money to get an ocean view room which was REALLY worth trying!\nRoom is spacious and equipped with kitchen stuff, feel like home. We could see the breath-taking view of the ocean direct from the balcony,...\n\n\nMore  \n\n\n", "\nExcellent very modern and well equipped rooms with spacious bathrooms. Not on the beach (but not many are and frankly it's not much of a beach to be on!) but only a block away and towels etc are provided. Jut walk across the road and when at the beach turn right and walk 200 yards where the beach opens out....\n\n\nMore  \n\n\n", "\nTrump International is friendly & generous in servicing people.\nI like their smile.\nsome hotels like ihilani JW marriott treat asian stayer in bad ways. they frown, look down & even cheat by overcharging the bill.\n", "\nThe location was perfect, steps away from famous waikiki beach but located on one end of the strip away from all the hustle and bustle that is waikiki. We were there celebrating my sons 12th birthday. We had an early check in which was nice. We pulled into the valet where we were greeted by the doorman Marleto. He offered...\n\n\nMore  \n\n\n", "\nMy husband and I stayed at the Trump International Waikiki for a week in January. It was a perfect vacation. The hotel is beautiful, immaculate, convenient to everything Waikiki has to offer and the staff was attentive, professional, polite, friendly and incredibly helpful.\n", "\nStayed in the luxurious Trump international for 5 days in February. The hotel is nicely located just off the main strip and very close to all the good restaurants in Waikiki. The hotel would be a fantastic property for a business trip however does not have the beach holiday feel to it that other properties like the Outrigger or Moana...\n\n\nMore  \n\n\n", "\nWe know the Trump Las Vegas and the one in Waikiki is at the same level when it comes to customer service and great amenities. To our surprise we were upgraded from superior city view to deluxe partial ocean view which got us a bigger room with lanai. It is all very sophisticated. It really felt like home and we...\n\n\nMore  \n\n\n", "\nAll staff was professional, friendly, and the room was beautiful! Next time I stay in Waikiki I will definetly pick this hotel again!\nI was always pleasantly greeted first which made me feel welcomed and not hesitant to ask questions. Everyone was very professional and knowledgable about the property!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/cf/36/ff/trump-international-hotel.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2930", "title": "The Modern Honolulu Hotel, Hawaii", "rating_string": "4.5", "address": "1775 Ala Moana Boulevard, Honolulu, Oahu, HI 96815", "review_list": ["\nStayed in this hotel for 8 nights in September last year. The Hotel was everything you would want from this hotel, which overlooks the marina on the edge of wahiki beach.\nUpon arrival to the hotel, my luggage was taken from myself, to be delivered to my room after check in. Check in was smooth and efficient, and a nice...\n\n\nMore  \n\n\n", "\nAt the start I didn't think the hotel was anything extraordinary as i have stayed at many excellent hotels throughout Asia where everything has been outstanding, however after our flights were cancelled and then we relocated to another highly rated hotel in Waikiki i realised how excellent this hotel actually was. The hotel was very clean and very modern. The...\n\n\nMore  \n\n\n", "\nThis past winter, I decided to celebrate my college graduation at my favorite hotel on Oahu, The Modern Hotel!\nThe Study Bar: This is where we hosted nearly 50 of my closest friends and family. I really enjoy the cool, relaxed vibe of the venue, as well as intimacy the space provides. We ordered bottle service which came with our...\n\n\nMore  \n\n\n", "\nWe loved our first visit to The Modern Honolulu. It was an outstanding experience in every way. The service, the facilities, the atmosphere and our overall stay was simply the best. The bar staff at the Grove will make you feel comfortable and glad you sat down. All the bar tenders are welcoming but you'll find Bryant, Virginia and David...\n\n\nMore  \n\n\n", "\nThe room size is generous with quality bathroom utensils . Their spa service is enjoyable . The food provided in the lounge / café / restaurant are delicious too !\nThere is a walkway connecting to the beginning of Waikiki Beach from the poolside lounge . Always have the staff standing at the front door ready for help !\n", "\nEverything from early morning coffee, to night caps were so great and the staff was right on it!!!!!.. The pool bar was a very enjoyable experience, thanks to Dave , Bryant, Derek, and Virginia. They made sure our cocktails were made with quality and a smile!!!\n", "\nHubby and I decided on a much needed last minute get a way from LA and book the Modern upon arrival in Honolulu. Upon arrival Bae and I were warmly greatly and offered an upgrade to a suite for a minimal charge; which we ended up doing. Initially, we had an issue with individuals on our floor who were a...\n\n\nMore  \n\n\n", "\nService at this hotel was nothing but sensational. Check in and out was a breeze. The car arrived by valet quickly every time we called for it. Everyone we spoke to was happy to accommodate us. The room was spotless and the city view actually had a view of the harbor from the balcony. Loved the lighted magnified makeup mirror!...\n\n\nMore  \n\n\n", "\nComfortable rooms. Clean. All staff is accommodating and always friendly. Good food. Bar & pool area is a blast. Thank you bartenders - Derek, Dave, Bryant for now being Purdue fans! Vanessa at the Spa, thank you for the very relaxing massage.\n", "\nThis hotel looks very cool. The finishings are very sleek and fresh. Service was outstanding - They helped us rent a vehicle at an excellent rate and they recommended lots for us to do around oahu! It's about a 15-20minute walk to waikiki beach and very close to Ala Moana shopping centre. The night club did keep us up Friday...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/04/5f/39/56/sunrise-pool-at-the-modern.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "4676", "title": "Sheraton Waikiki Resort, Hawaii/Honolulu", "rating_string": "4.0", "address": "2255 Kalakaua Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nWe love the Sheraton Waikiki. The location by the ocean is fabulous. Our favorite part of the hotel and our stay is the infinity pool. It is fabulous. Our view from our room is Diamond Head, the ocean and the pink hotel. We have eaten at the Edge resturant. Service and quality our great. This is not a cheap hotel...\n\n\nMore  \n\n\n", "\nPros\nBeautiful view (We were on the 16th floor with a ocean front view. Fabulous!)\nComfortable bed.\nDecent water pressure.\nFridge in the room was a plus.\nChecking in and out was a breeze.\nCons\nParking is crazy. Many SUVs park in the spots marked \"compact.\" The garage is chaos!\nThe pool plays loud music at night. If you are...\n\n\nMore  \n\n\n", "\nStayed here 8 times due to Starwood Gold since 2005.\nPros\n+ location\n+ nice infinity pool for adults.\n+ nice outside cabana couples massage.\nCons\n- breakfast buffet used to be good. Now bad and overpriced.\n- their elevator system is chaos. Get ready for a game of musical chairs action :)\n- lots of squatters/crashers that take up...\n\n\nMore  \n\n\n", "\nRoom excellent, facilities great, and the infinity pool is somethings to be hold, bed so comfy.\nI loved the service and the beach sometime big is ugly not in this instance, if ever visiting Hawaii do yourself a favor and book at the Sheraton Waikiki.\n", "\nNo complaints at all!!! Was a great room and got upgraded to a ocean view that was amazing!!! Wouldn't hesitate for a second to stay there again!! I would highly recommend getting incentive view.... It's worth it!\n", "\nWe recently stayed at the Sheraton Waikiki for an extended family vacation (my family with 2 boys, my brother's family and my mom). Our stays there were from 9-14 nights, depending on the person. It was a family reunion.\nThe positives:\n- Of course location, arguably a prime area on Waikiki.\n- Found the concierge service excellent. Used it multiple...\n\n\nMore  \n\n\n", "\nOur family of four stayed here for a two night stay in two interconnecting ocean view rooms.\nOn the plus side - the rooms were clean and the view lovely and the location is excellent if you want to be in the middle of downtown Waikiki.\nOn the negative side - this is an extremely busy hotel; check-in involved standing...\n\n\nMore  \n\n\n", "\nThe Sheraton has arguably the best location, best pool, best views, best layout best facilities of any of the hotels in waikiki. Here are the parts that aren't mentioned in the bio and ultimately why the trip advisor rating probably isn't so great.\nThere is a night club directly underneath the hotel. We were on the 4th floor which is...\n\n\nMore  \n\n\n", "\nOverpriced we felt. Great location though. Good Amenities, bars, restaurants, shops etc.\nHOWEVER, you had to pay a HUGE amount of money to sit on certain lounges around the pool ...some of them were like $200 (or more) for they day. There are other lounges around the pool, but for the amount of people that the hotel houses, the amount...\n\n\nMore  \n\n\n", "\nBeautiful location, near a lot of activities and shopping. Great rooms and value for the price . So beautiful, and the atmosphere was wonderful. Staff are very friendly and accommodating. The ocean his at your footsteps. Very close to a lot of attractions.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/38/47/60/infinity-pool.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2484", "title": "Embassy Suites by Hilton Waikiki Beach Walk Hotel, Hawaii/Honolulu", "rating_string": "4.5", "address": "201 Beachwalk St, Honolulu, Oahu, HI 96815", "review_list": ["\nStaff and property was great. Very friendly. Tried to address all our needs. Hotel was close to restaurants, shopping. Breakfast was awesome. Could use a little more variety of food for the happy hour, but it was still great. The entertainment for the happy hour was excellent. Great band and dancer. Rooms were clean. Would visit this hotel again.\n", "\nI stayed here with my family and we were all very happy with our stay here. We absolutely loved the convenience of having breakfast right in the hotel (included), and our meals were always very good. I eat gluten and dairy-free and it was always easy for me to eat since eggs and bacon were always available! The cooks were...\n\n\nMore  \n\n\n", "\nUpon check in, you receive a wondering mango drink, the rooms are beautiful and clean. The staff was engaging and gracious. Breakfast and evening reception are amazing. Close to the beach, shopping and restaurants.\n", "\nWe are frequent visitors to Waikiki and for several years now have stayed at the Embassy Suites on each visit. Easy access to the beach, backing on to Lewers St with its many restaurants and TheBus only steps away the location is hard to beat.\nAs the name implies it is an all suite hotel with breakfast included, complimentary business...\n\n\nMore  \n\n\n", "\nWe have just come back from 8 nights there and loved every minute of it. The breakfast each morning was awesome and the omelettes really made it for us!\nThe managers reception each evening was also a great extra at no additional cost.\nThe location was great and the pool was perfect.\nOverall we loved it and will stay again!\n", "\nYou really can't find a better deal in Waikiki than this location. You aren't on the beach, but you are within a 1-minute walk. The breakfast has many gf options, and the chef was able to point out what was safe. I have many food allergies, so I used their gf bread and bought some less processed jam at the...\n\n\nMore  \n\n\n", "\nStayed for 2 nights the first week of February 2016 before heading to Maui. I read the previous reviews on this Embassy Suites hotel. It helped making my choice. I am happy I did. The location was great. Walking distance to shopping, restaurants, and the beach. I booked an ocean view room. Yes, there are other hotels blocking the full...\n\n\nMore  \n\n\n", "\nWe stayed here after staying at 2 other hotels in Hawaii, one in Oahu just a few minutes down the beach and another in Kona on the Big Island. We liked the Embassy Suites a lot, but it may have been a little too much for us. It was just my husband and me traveling, and the first hotel was...\n\n\nMore  \n\n\n", "\nHad a ball, the staff were the most friendly and welcoming staff ever encountered at any resort. The buffet breakfast with chef's cooking fresh eggs, omelettes was a bonus.\nThe happy hour should change its name to heavenly hour\n", "\nHotel is right in the middle of great shopping, wonderful restaurants and the beach is right across the street. We had two oceanview rooms and though the property is not oceanfront, the ocean view is up front and center. The beds were super comfortable and the rooms modern and clean! The daily breakfast was great. They change the menu daily...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/08/42/63/5e/embassy-suites-waikiki.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "3893", "title": "Moana Surfrider, A Westin Resort & Spa, Hawaii/Honolulu", "rating_string": "4.0", "address": "2365 Kalakaua Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nHow could this grand destination get any better? World-class customer service to perfectly accent an already amazing resort. Often times we forgo one for the other, not in this case, thankfully. One only needs to approach or view this property to appreciate its magnificent splendor of old-world charm, class and elegance. Make no mistake, this is THE destination of choice...\n\n\nMore  \n\n\n", "\nThe staff were pleasant and helpful, but I had to call the front desk 3 times before the all-out scream fest on the balcony below my room was controlled. And three calls were between 11 PM & 2 AM! Disappointing that it took as long as it did to address the issue.\n", "\nThis is a hotel I've stayed at twice before and both times have been great experiences. Unfortunately I can't say the same this time. The check in itself was fast and easy, but when I asked a staff member where our room was after showing him my room number he sent me to the wrong wing. After walking the whole...\n\n\nMore  \n\n\n", "\nOne of the two original Waikiki Beach hotels, this classic has kept pace with the times by means of periodic renovations. Our room was rather small but we had a beautiful view of the beach. The cost reflected both the location and the grandeur. The shower was outstanding and the bathroom reasonably spacious. The room was quiet except for some...\n\n\nMore  \n\n\n", "\nI always write my reviews to the point, of pro's and con's.\nPro\n-Location around everything. In the (hub)\n-our room spacious, with a day bed!! (Hello)\n-I believe the name was Chris? Front desk. Amazing!!! So helpful, and sweet. Check in was quick and officiant.\n- we celebrated our Honeymoon and my husbands birthday! Up grade was not granted...\n\n\nMore  \n\n\n", "\nThe rockers, the open air lobby, the hardwood floors, music under the banyan tree, hula lessons, and the beachfront bar are my favorites. It truly let me \"pretend\" I lived in Hawaii for an indefinite time.\nDinner on the patio was satisfactory; we found the waiter to be quite pretentious and insincere as he played to the tourist population. Would...\n\n\nMore  \n\n\n", "\nThe lobby, the rocking chairs, the piano player in the the evenings, the pool and outdoor dining are all elements that make this a wonderful place to stay. The room we had overlooked the ocean and Diamond Head. It would have been hard to leave it if the service for breakfast wasn't so appetizing. Everything in the hotel is done...\n\n\nMore  \n\n\n", "\nWe stayed a couple of places in Waikiki in Jan 2016. The Moana was the pick of the bunch by far. It has a great position on Waikiki and has a slower pace than some of the other larger hotels. The views are postcard perfect. The bar at night is pretty easy for a drink and some simple bar food...\n\n\nMore  \n\n\n", "\nhave stayed in a few hotels in honolulu but this would have to have been one of the finest and best by far. staff were very obliging so helpful service is great. would thoroughly recommend the moana to any on going to hawaii. very central great position beautiful premises\n", "\nWe stayed to celebrate my mother's 60th Birthday. She could choose any hotel in the island and she chose the historical Moana Surfrider. The Ocean View Room was breathtaking with a clear view of Diamond Head. The Sunrise and sunsets views were spectacular. We started her birthday with Tea Time at the Veranda which was exquisite. They made her feel...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/01/cd/86/64/moana-surfrider-a-westin.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "3848", "title": "Outrigger Waikiki Beach Resort Hotel, Hawaii/Honolulu", "rating_string": "4.5", "address": "2335 Kalakaua Avenue, Honolulu, Oahu, HI 96815-2941", "review_list": ["\nWe r currently staying. Paying $385 per night. Pool says no saving chairs BUT NOT THE CASE!!!!!!! People get up at the crack of dawn. Save chairs hours at a time. We come to the pool when ready get towel, find chairs, leave when it's time to leave. When we want to come back we look for open chairs. Pool...\n\n\nMore  \n\n\n", "\nWe stayed at the Outrigger in Jan 2016 and it's a great place to stay, first class hotel, great location, but the stand out for me was the service, every member of staff went out of their way to help you every time. Particular thanks to Heather on the activities desk for organizer our first ever babysitter for our 14week...\n\n\nMore  \n\n\n", "\nMy Girlfriend and I stayed here and had a wonderful time! We stayed for 14 days and I have no complaints except that everything in Oahu is expensive. I loved the two restaurants in the hotel. Dukes at dinner time is a must! The pool was small but didn't seem to be used that often. If you would like prime...\n\n\nMore  \n\n\n", "\nundoubtedly this hotel is in the middle of all the action & with Dukes bar on the grd floor beach side this makes a great spot for afternoon drinks and food but gets really crowded. Be wary of the guest services counter as they seem to be on commission as their information is directed only to tour operators , they...\n\n\nMore  \n\n\n", "\nThis was our second stay here & was for our honeymoon. Absolutely love this hotel and its in a great location.\nOnly thing that would have made our honeymoon was a room upgrade being it was such a special occasion & we were repeat customers\nOverall great time\n", "\nI am super upset about the $30 charge for wi-fi access. So what it allows you on the trolley. Never have used it. We've stayed here probably 10-12 times over the years. So sad to see they will not allow you to stay in a room an extra hour or two either. They always did in the past... I assumed...\n\n\nMore  \n\n\n", "\nWe arrived at this lovely hotel right on the shore of Waikiki beach. All the staff are excellent. Lively buzz in Dukes bar for sunset cocktails, amazing breakfast overlooking the beach (next to chucks grill) and perfect steak and scallops in chucks grill. We had a side sea view which was perfect as we were out all day with friends...\n\n\nMore  \n\n\n", "\nWent out to our balcony....to drink coffee. Listen to the gentle waves on Waikiki ......could not hear above all the hotel air conditioners.went to sit on Waikiki beach,went in the water(nice) but my hubby and I could not go in together for fear our 'stuff' would be stolen off the beach 😓...Booooooooooo! Kauai is WAY better!........\n", "\nEnjoyed a wonderful family (adult kids) trip to this hotel. The rooms are spacious and the beds are comfortable. It is right on the main road and on the beach side. It is great not to have to cross the road to enjoy the beach. There is a fair bit of street noise with entertainment, traffic and garbage trucks, but...\n\n\nMore  \n\n\n", "\nWe have been lucky enough to stay here 4 times and will be back again in December 2016. The staff are ALWAYS so friendly and helpful. The rooms are a great size and very clean (my daughter and I love the coconut moisturiser in the bathroom) we stay in the Ocean Front room and love sitting on the balcony watching...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/09/c8/33/20/outrigger-waikiki-beach.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2674", "title": "The Royal Hawaiian, a Luxury Collection Resort, Hawaii/Honolulu", "rating_string": "4.0", "address": "2259 Kalakaua Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nThe Royal Hawaiian is a lovely hotel in the perfect location on Waikiki beach. It is ideally located with beachfront access and locality for the restaurants and shops of Waikiki. It feels quite peaceful and tranquil as soon as you enter the grounds of the hotel - which is great after the hustle and bustle. The historic building really sticks...\n\n\nMore  \n\n\n", "\nMy wife and I recently stayed here 4 nights as part of a vacation. We had a wonderful experience. I had booked a basic historic wing room. We were upgraded at check-in to a historic wing grove view. I suspect the only difference here is a view facing the inner courtyard, which is quiet and quite nice, as opposed to...\n\n\nMore  \n\n\n", "\nI recently celebrated my wife's birthday by taking her to Hawaii for a week. The Royal Hawaiian was everything that we could have hoped for. Built in 1927, it is now restored to the original form of old world charm. It serves as a relaxed oasis and a great escape as it sits on Waikiki beach in the midst of...\n\n\nMore  \n\n\n", "\nThe only thing that wasn't 100% perfect was the age of the guest rooms. They were still nice and the beds were very comfortable. The roll away bed was the most comfortable I've ever seen. The grounds are beautiful and the staff is excellent. We would definitely come back again. This is one of the only hotels I've ever visited...\n\n\nMore  \n\n\n", "\nI used to live in Waikiki so couldn't resist the chance to stay at this old classic hotel. It was beautiful and the staff was very nice but everything cost $ and there were very few amenities that came with the high price. ~ even 2 beach chairs and an umbrella cost $40, and were only good 'til 5PM. Parking...\n\n\nMore  \n\n\n", "\nDidn't book here but traveled from the North Shore to watch the sunset.\nHad Mai Tai's and amazing apps at the Mai Tai bar.\nOne thing that made me wonder if it has lost some of its grandeur is the peeling wallpaper in the ladies room.\n", "\nWe researched many places in Waikiki and decided the Royal Hawaiian offered the best in all areas - beach location, room comfort and peaceful. The hotel is tucked behind the bustling Main road so it is quiet. The breakfasts were excellent and the beach staff made it easy to try activities like canoe surfing, body surfing and surfing (extra $...\n\n\nMore  \n\n\n", "\nI have never been to Honolulu, and had to come here there for a business trip. I figured that I couldn't pass up the chance to pretend to be 'on the beach,' so I booked a room at The Royal Hawaiian. I AM SO GLAD I DID. I love the charm, the ambience, the service, the beach-front location, the terrace...\n\n\nMore  \n\n\n", "\nDidn't stay here but walked around inside a few times as we had to see the infamous Pink Hotel....gorgeous!!! Hopefully I can afford to stay there one night! Beautiful flowers everywhere too!\nThe bech chairs out front and their pool area were amazing!\n", "\nThe Royal Hawaiian has lost its touch. It used to be this magical experience like none other from the moment you drove up - receiving a lei, a cold towel, guava juice, exceptional customer service with a smile, everything clean and spotless!\nNow you drive up, the valet greets you (they were the only nicest people there the whole time!),...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/2e/8e/57/beachfront-location-on.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2142", "title": "The Kahala Hotel & Resort, Hawaii/Honolulu", "rating_string": "4.5", "address": "5000 Kahala Avenue, Honolulu, Oahu, HI 96816", "review_list": ["\nWell, it took me 13 years to return to the Kahala, and not for lack of desire. When I was there 13 years ago, it was the Mandarin Oriental. I was surprised the hotel has not changed much at all in terms of appearance and renovations. I love the traditional Hawaiian theme and there is something very Don Draper/Mad Men...\n\n\nMore  \n\n\n", "\nThe Kahala is like no other resort on Oahu. Private beach, manicured grounds, Dolphins swimming under hotel, turtles being hand fed along with sting rays in separate pools. Food is excellent. Private golf course. Free shuttle to town. Friendly employees. Excellent security. Not inexpensive, but worth the price.\nLorna in reservations is a long time employee and did her best...\n\n\nMore  \n\n\n", "\nThe Kahala is one of the most luxurious hotels we've ever stayed in. The rooms are very well appointed, the grounds are beautiful and the 6 dolphins that live on site are delightful. We were treated like royalty while staying, which is the ultimate treat while on vacation. We loved reading the wall of fame showing all the famous people...\n\n\nMore  \n\n\n", "\nWe loved this hotel! It sits on a beautiful, serene location, far from the madness of Waikiki but close enough to visit the great restaurants and sights of the island. The service is impeccable, friendly and warm, all the employees were eager to help at any time. There are plenty of ways to relax: pool, beautiful beach, bar, several oceanfront...\n\n\nMore  \n\n\n", "\nYou should come visit this delightful hotel. You can park for up to four hours if you get validation. Get some food or drinks out near the pool.\nThe Dolphins, Manta Rays and Sea Turtles are worth the visit alone.\n", "\nFirst the bad:\nThey don't have firm pillows, I would kind of expect that this caliber hotel would have firm pillows.\nThat's all the bad.\nNow the good:\nGreat shower, i'd be fined here in California for that kind of water pressure, quite a luxury!\nRooms were very big and clean.\nBed was about perfect.\nThe gym has the best...\n\n\nMore  \n\n\n", "\nWe had such a lovely holiday at this beautiful, majestic, landmark hotel.\nThe feel of \" the good ol' days\" lingers there, transporting you back to bygone a era, the 60's. The service is excellent and the atmosphere relaxed. We chose this hotel for the Dolphin Encounter for my daughter, the staff were terrific and we learned a great deal...\n\n\nMore  \n\n\n", "\nThis old grand dame is not what she once was. In a state of disrepair all around the property. Towels and chair covers at pool should be tossed. Pool tiles in sad shape. Place mats in Plumeria were also in bad shape. The only plus was a very helpful valet staff. They seemed to be the only ones on staff...\n\n\nMore  \n\n\n", "\nUpon arrival, we were placed into a large corner suite on the third floor. The variety of views were special. Out of our bedroom, we could see mountains and the Waialae golf course.\nOut on the substantial sized balcony we overlooked the lagoon with the dolphins and a great ocean view. Oddly, the living room which had one wall facing...\n\n\nMore  \n\n\n", "\nThe rooms are big and comfortable, we had views of the golf course and had a balcony which was great, the beds are very comfy and we always have the best nights sleep at the Kahala. The breakfast is very good with lots of choice and the service as always is great, there is a free shuttle that runs you...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/7f/0f/e0/the-kahala-hotel-resort.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "3864", "title": "Hyatt Regency Waikiki Resort & Spa, Hawaii/Honolulu", "rating_string": "4.0", "address": "2424 Kalakaua Avenue, HI, Honolulu, Oahu, HI 96815", "review_list": ["\nThis hotel did not disappoint me at all. Right in the heart of Waikiki, a minute walk from the famous Waikiki Beach! Great service, comfortable room, spacious, clean, nice swimming pool, facilities, restaurants, and the list goes on and on and on. What can I say? I would certainly stay here again! One thing to keep in mind when you...\n\n\nMore  \n\n\n", "\nCommitting to 14 nights for our honeymoon, I expected the usual excellent Hyatt facility and service I've experienced over the years. Not. Unfriendly Front Desk clerk assigned us to small room adjacent to elevator lobby. Upon request to move to a quieter room, we got a larger room with its dirty glass balcony doors locked due to construction. Because of...\n\n\nMore  \n\n\n", "\nI decided to take my two sons on a quick vacation and booked 4 nights at the Hyatt. When we arrived I left the car with the valet staff and headed for check in. There was a small issue with our room (they had us in a king room with 3 people) but Uheina was wonderful and located a double...\n\n\nMore  \n\n\n", "\nMy husband and I are rounding out our Hawaii vacation at the Hyatt Regency.\nWhen we arrived the lobby was incredibly crowded. It took a very long time to check in. Once we did check in we were very abruptly told verbal directions to our tower. when we were waiting to check in I was bumped in numerous times. When...\n\n\nMore  \n\n\n", "\nThis is an excellent hotel located in an exciting area of Honolulu. There are several great restaurants within walking distance to the hotel. There is also a shopping mall along with a local farmer's market held in the street level of the hotel.\n", "\nThe Hyatt has an indoor-outdoor atmosphere, and when we arrived we went up the escalator to the reception area and looked out to see the beautiful palm trees and the ocean view. There was self-serve complimentary water and a pineapple beverage in the lobby which was a perfect \"welcome to Hawaii\" drink, (non-alcoholic). Check in was very quick and we...\n\n\nMore  \n\n\n", "\nHyatt Regency in not on beach front, beach is right across the main street. But the location is good, across the street is the bus stop where local and tour buses stop which is very convenient. Swimming pool and restaurant on 3rd floor have great view of the beach and the actions.\nIt's an old hotel, rooms are all renovated,...\n\n\nMore  \n\n\n", "\nThe hotel may look old but I actually like it. It is great to find many different kind of plants around the hotel ground, which is kept clean and neat all the time. I was lucky to get an ocean view room and a family suite for my stay. Both rooms were very big with comfy queen/king beds and very...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/4a/95/67/hyatt-regency-waikiki.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2083", "title": "Halekulani Hotel, Hawaii/Honolulu", "rating_string": "4.5", "address": "2199 Kalia Road, Honolulu, Oahu, HI 96815", "review_list": ["\nAfter going back and forth between hotels in Waikiki i finally decided on Halekulani, and its was everything i wanted, the moment we arrived i knew i had picked the best, The staff went out of there way too cater too any needs. I ate at all restaurants except La Mer, they were great, the breakfast at House without a...\n\n\nMore  \n\n\n", "\nWe stayed here a few days before going to Maui. The oceanfront (not the Diamond Head category Ocean Front) room was light and felt fairly roomy, but not elegant or unbearably stylish as we had hoped from the reviews. We had not been that impressed by the pictures of the grounds, but figured from the reviews, we would be \"transported...\n\n\nMore  \n\n\n", "\nThe property is absolutely stunning. From the views, pools and genuine friendliness you feel like royalty and family at the american time. Most of the people we met stay for months at a time and I can understand why. When you think it just cannot get any better, you will meet Melba and love h. She is truly the heart...\n\n\nMore  \n\n\n", "\nWe stayed at the Halekulani for 5 nights. Wonderful location just on Waikiki beach but at the nicer quieter part. Close to shops and restaurants. The hotels own restaurants are all excellent with great choice and sea views. Service was very good and the quality of the rooms was first class. Would definitely stay there again.\n", "\nWhile i realize that we had one of the less expensive rooms, about $500, the halls and room that we had has seen better days and needs to be overhauled. the room was a bit dingy and could use some new furnishings.\n", "\nHalekulani does not live up to its price point or its accolades in many respects. The first of many disappointments is that fact that, although the resort bills itself as \"on the beach,\" it is actually on a seawall. There is no beach associated with this property unless you count the 20-foot strip of coarse sand that also serves as...\n\n\nMore  \n\n\n", "\nThe Halekulani is arguably the best hotel in Waikiki. It's location provides it a measure of protection from the high energy, crowded Waikiki scene. Fantastic views of the beach, Diamond Head and sunsets. Happy hour at the pool with excellent Hawaiian entertainment should not be missed. Special occasion dinners in Orchids or Le Mer will be unforgettable. This is where...\n\n\nMore  \n\n\n", "\nWe go twice a year....every October and April. Best hotel staff and management ever! The pool area is beautiful and the staff is very attentive. House Without A Key...breakfast, lunch or poolside all day service, wonderful and lots to choose from....always fresh food and the patio at sunset is amazing. We love Orchids...LaMer...the General Manager's Reception....always a great experience....most of...\n\n\nMore  \n\n\n", "\nWhile we enjoyed the location and the views from our room we did have some service issues at this hotel. They had no record that we had booked using Fine Hotels and Resorts and I had to locate the confirmation before they would honour the benefits. On checkout they also made a mistake with the bill.\nWe had a wonderful...\n\n\nMore  \n\n\n", "\nThis is a first class hotel. From arrival to departure the service is first rate.The hotel is beautifully appointed with an excellent swimming pool area set in lawned gardens. The quietest A/C I have ever experienced. We ate twice in Orchids,one of the hotels two restaurants. Very good.\nIf I was being really picky, the breakfast buffet is not quite...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/98/23/c5/halekulani-hotel.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1184", "title": "Vive Hotel Waikiki, Hawaii/Honolulu", "rating_string": "4.5", "address": "2426 Kuhio Avenue, Waikiki, Honolulu, Oahu, HI 96815", "review_list": ["\nThe hotel is located just 2 short blocks from the heart of Waikiki beach. The staff is very friendly and helpful. They provided us with several good food recommendations. They valet was fast with the car and he was always available.\nThe continental breakfast was a nice assortment of breads and fruit, plus beverages. We have certainly seen more choices...\n\n\nMore  \n\n\n", "\nthe room is not large, no place to hang swim suits or any to dry, but it's tidy. And I'm glad to have coffee in 24 hours. And location is great, it's really convenient to go anywhere. Next time when I visit Hawaii, I will stay again.\n", "\nStaffs are nice and efficinet. Close to the most popular coast in Waikiki. Shopping stores and restaurants are all around. Car parking charge $25 per night. Bar is available 24hours for drinks.But breakfast hasn't many choices.\n", "\nMy mom and I were in Honolulu for a mother/daughter winter break at the end of Jan. Since we were scheduled to arrive 9pm at night, didn't feel like paying premium price plus resort fee for our first night in town. So, I decided to book a cheap and cheerful hotel in the Waikiki area. We arrived at the hotel...\n\n\nMore  \n\n\n", "\nA great place to stay and close to everything i.e. the beach, different eateries, with the shopping centre and cinema just a bus ride away. The complimentary breakfast was more than enough to kick start your day (esp. the blueberry bread) and the staff were friendly & accommodating. The rooms are not big but then you only need it for...\n\n\nMore  \n\n\n", "\nStaff was superb and helped us out whenever we had any questions. Especially Chris at the front desk was helpful. Tablet in the room was great if you are not that comfortable using the phone, and it really worked as fast as a phone call too. We had a broken safe and after 10 minutes it was fixed when we...\n\n\nMore  \n\n\n", "\nIt's really nice to stay with VIVE hotel. The place is just about 3 mintes walk from the beach. Staff are very firendly and helpful. Ice cold water and coffee are offer 24 hours a day at the lobby. I'm willing to stay with VIVE next time when I visit Hawaii!\n", "\nGood amenities, great staff, short walk to the beach and food. Staff were so helpful with borrowing items, local knowledges and willingness to help. Will definitely be coming back. Thank you for a great trip!\n", "\nTwo blocks away from the beach. There is a bus station right outside of the hotel. Many good restaurants within walking distance! The stuff are nice and helpful. We really enjoyed our stay. The room is clean!\n", "\nMany hotels around, but their prices are far more expensive. I was very happy about the location and price. Staff was excellent. It's not your typical large hotel, it's boutique style, but this was fine by us, seeing how we were only there to sleep, and eat their free breakfast.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/05/97/58/20/vive-hotel-waikiki.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1694", "title": "Hyatt Place Waikiki Beach Resort, Hawaii/Honolulu", "rating_string": "4.0", "address": "175 Paoakalani Avenue, Honolulu, Oahu, HI HI 96815", "review_list": ["\nProbably the best hotel I have ever stayed in. Excellent room, great staff, terrific buffet breakfast, served outdoors. Very close to the beach and shopping. Strongly recommend. Price seems high, but is in line with Waikiki hotels.\n", "\nI've been to Oahu now 5 times since 2010 and have stayed in 6 different upscale properties in Waikiki because of promotions each was running. I've gravitated towards the Hyatt Place Waikiki Beach because of:\n1. Great Staff\n2. Great Rooms\n3. Location, Location, Location\n4. Awesome Valet and Concierge Services\n5. Aloha Friday Happy Hour on the 1st floor...\n\n\nMore  \n\n\n", "\nClean, up to date, friendly staff and fantastic location. Lots to do within walking distance and close to the Bus stop. The complementary breakfast was nice, however, not a whole lot of variety. The business center is handy and the excursions were easy to book.\n", "\nThe hotel looks like it is new. The staff are friendly and helpful. Their breakfast is great. The hotel is only about three minutes from Waikiki Beach. It is a great place to stay in the Waikiki area.\n", "\nWe were looking for a good place to stay but did not need the Resort-styled places since we planned on being out most of the time. The hotel was clean, reasonably quiet, good location close to the beach and close to frequent bus routes. The room was spacious, had fairly new carpet, and was well maintained, except for the AC....\n\n\nMore  \n\n\n", "\nWe have just left the Hyatt Place which we stayed in for 2 nights while we waited to get a room at the Hawaian Hilton village. Our check in person ( Lynn) was very sweet. But our surprise came with the room at the Hyatt. It is smaller then a New York hotel. Wow was it small. I would guess...\n\n\nMore  \n\n\n", "\nThe location of this hotel was perfect! Easy walking distance to the beach and lots of shopping and restaurants. The rooms were very quiet and beds were actually comfortable! The complimentary breakfasts were amazing and full of good choices! The only negative we hade was the size of the rooms themselves. They were a bit smaller than what we are...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/02/50/ac/57/hyatt-place-waikiki-beach.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "831", "title": "Aston Waikiki Circle Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2464 Kalakaua Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nis so not worth going here there's nothing nice about this hotel it is tiny view is terrible and it smells awful party zone and everybody around here are big-time partiers loud it's obnoxious and it is not in anyway romantic\n", "\nTook the family on a short trip to Waikiki. Booked an ocean front room and requested the 12th floor. Upon arrival, we got the 14th floor. The room was small, but enough for me my wife and our 8 month old. The view of the beach was amazing. Even better was Naomi at the front desk, who made our stay...\n\n\nMore  \n\n\n", "\nIf you're looking for an amazing ocean view and on a budget, this is the hotel for you. I Recommend getting either an ocean front or ocean view room(where we stayed). The hotel is also located right off the beach, perfect if you have no transportation and want to be at the beach for the rest of your stay. However,...\n\n\nMore  \n\n\n", "\nI just laughed when I first saw it against its neighbors; tiny and dated. built in 1962 an anomaly on the beach. The reception desk is behind bulletproof glass. They offered me an upgrade from a partial ocean view to an ocean view for $10/night that while not full on was perfectly fine. The woman behind the \"activities\" desk was...\n\n\nMore  \n\n\n", "\nWe stayed at the Aston for 10 nights and loved it we didn't spend much time in the hotel but when we did the staff and room staff were lovely and very helpful. Definately would go back and stay again. The view was amazing definately centre ocean view it almost looked fake!\n", "\nIf you're looking for a hotel in a great location, then this hotel is for you. We had an ocean front room with million dollar views. Rooms are small, but clean and comfortable. Location is fantastic, across the road from Waikiki beach and close to all the restaurants. Staff were friendly and accomodating.\n", "\nWe have stayed here 3 times so far and am looking at a 4th, great location, staff, view and comfy rooms. We pay the xtra for oceanview because the sunsets are great. Can't wait to return to the best part of Waikiki beach\n", "\nThe rooms were very small and needed updating. Having said that, we choose this hotel for the view and position.and that's exactly what we got. It was right across from the beach in the heart of Waikiki. Great for our teens. The staff were so friendly and helpful. The view was breathtaking and we were so happy we chose to...\n\n\nMore  \n\n\n", "\nWe had a pleasant stay in this hotel. The rooms are very unique. Small but very comfortable with everything you really need. The most amazing feature is the view over Waikiki beach. The sunrise and sunset views are simply amazing. The room service is spot on and the personnel very friendly and forthcoming. We really enjoyed our days in the...\n\n\nMore  \n\n\n", "\nIf you get the ocean view then for the price, this is fab. Slightly quirky and a little old-fashioned but clean and comfortable with very very helpful staff. A good place to stay to be in the hubbub of Waikiki.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/fd/f6/ba/hotel-room-oceanfront.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "922", "title": "Park Shore Waikiki Hotel, Hawaii/Honolulu", "rating_string": "4.5", "address": "2586 Kalakaua Ave., Honolulu, Oahu, HI 96815", "review_list": ["\nPretty much on the beach like all major Waikiki hotels, and the beach was not congested at that location. $25 per day for round the clock access valet parking is fair and convenient, although the tiny sidewalk-driveway can be restricting when more than 2 cars need access. Renovated bathrooms and showers were great and modern. Internet access was fast and...\n\n\nMore  \n\n\n", "\nIf you decide to stay in Waikiki then this hotel is not a bad choice. It's not special but for the price (compared to other Waikiki hotels) we thought it was okay. We liked the location- at the very end of Waikiki Beach main drag. So with our rental car, I assume we avoided some congestion leaving the hotel to...\n\n\nMore  \n\n\n", "\nRight at the end of the strip away from all the traffic noise and the usual late night party goers. Many local places to eat and drink the usual franchises. Starbucks next door. Walk across the road for boogie board and paddle board hire. Stayed in an ocean front room, not huge but comfortable enough, no complaints, friendly staff. If...\n\n\nMore  \n\n\n", "\nIf the beach is your main activity then this hotel is for you! Directly across the street from the beach. Walking distance to everything Waikiki. Surf school in the hotel. The room was an average size with a fridge & a safe. Too bad we weren't upgraded to a partial/ocean view but we didn't need the extra cost.\nABC Store...\n\n\nMore  \n\n\n", "\nWe picked a room with a partial ocean view and it was awesome. The room was not too big but it certainly was spacious enough if you know how to store your stuff. There were enough outlets in the room for charging your electronics, and strong enough free wifi.\nThe bathroom had no tub but has a small walk-in shower....\n\n\nMore  \n\n\n", "\nJust returned from a stay at this super hotel. Excellent location. Good sized room. Modern clean bathroom. Super friendly & helpful staff at reception - who even called the manager at home to help sort out my husband's wifi problem. Took advantage of the free yoga class on offer. Can only assume it a 3* star & not higher as...\n\n\nMore  \n\n\n", "\nLoved this place. definetly go for the gettogether with manager and staff. situated right across road from the beach. great ABC shop next door for supplies. beautiful views from our room. Loved watching the Flamigos at the zoo. terrific to get a room to chill before out flight home. we are still talking about this place and it was last...\n\n\nMore  \n\n\n", "\nThis is a pretty good hotel for Waikiki. That means it is pretty good value for a pretty expensive area. It is located at the east end of Kalakua Ave next to the Zoo. So you are a walk from the main area of the shopping areas and nicer hotels of the street. The beach is right across the street...\n\n\nMore  \n\n\n", "\nWe stay in Honolulu once or twice a year over the past two decades and we found this hotel a little tried but a good location across the street from the zoo and the beach.\nWe received good service but only after fighting for it. We checked in only to be told there were only two doubles instead of a...\n\n\nMore  \n\n\n", "\nI got lucky and got the Park Shore hotel when I booked through Hotwire at a great deal. We were greeted with cold fruit juice and hot towels. Staff were friendly, it was clean, and he location was perfect. It is right across the street from the beach. They offer beach towels, chairs and umbrellas included under the resort fee...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/04/22/48/bf/park-shore-waikiki.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1341", "title": "Luana Waikiki Hotel & Suites, Hawaii/Honolulu", "rating_string": "4.5", "address": "2045 Kalakaua Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nAbsolutely a hidden gem - no better place to stay if you want to be close (walking) distance to everything but far enough away for quiet. Spent two weeks exploring the island and loved coming back to my room with its kitchenette and then relaxing by the pool.\n", "\nStayed in a one bedroom apartment with my family of 4. We had the 1114 apartment with the massive balcony that hangs off the side. I think there are only a couple of apartments that have this. The kitchen was very good. Had everything we needed. The closet was huge and great to store our suitcases. The wine and cheese...\n\n\nMore  \n\n\n", "\nBefore arrival I know Luana is a great hotel from their prompt, respected, and detailed email reply. I have 5 nights stayed at Luana. I feel it is safe, clean, friendly hotel. The bed is very comfortable, and staffs are very friendly. I can feel real relax at Luana.\n", "\nInitially booked into this hotel months in advance. 4 months to be exact. I called this property every month, approx every 4 weeks from initial booking until arrival to ensure that nothing happened to our room as we have several A.D.A. people in our party. We are all seasoned travellers and have stayed all over the world in a variety...\n\n\nMore  \n\n\n", "\nWe stayed for 18 nights in a one bedroom apartment as a family of four. Staff were super friendly and helpful, including our amazing housekeeper, Elsie. Our apartment was spacious with great views of Friday night fireworks. A quiet mezzanine level enabled me to work and we appreciated the thrice weekly wine and cheese receptions which helped us make some...\n\n\nMore  \n\n\n", "\nThe best part is the location (adjacent to a very nice park and close to the sea (5 min walk); however, rooms facing Kalakaua Av are NOT GOOD, terribly noisy, if you keep the lanai door open you cannot have a conversation nor sleep!!!\nWe booked 2 rooms (1 with a kitchenette) and stayed from Dec 22-Jan 12 (needless to...\n\n\nMore  \n\n\n", "\nAfter a mixup with our hotel (we arrived a day early! My bad!) the Luani Waikiki took us in last minute & even gave us a military discount! The staff was friendly and the room was clean & comfy. It's a bit of a hike to the beach but other than that it's a great location. Happy hour 5-6pm with...\n\n\nMore  \n\n\n", "\nBooked direct, friendly efficient staff on front desk but nor really interested beyond their own responsibility. Concierge was a fail, we got better advice from adjacent shop keepers. Porter / Doorman has the cruisiest job ever. During our 4 day stay never saw him assist anyone with a bag and his directions suggest he had never ventured off his stand....\n\n\nMore  \n\n\n", "\nI realize it's near (not on) Waikiki Beach, but for over $200/night (and up) I expect, at a minimum, a clean room in which everything works. The lanai outside our room was so dirty I didn't even want to go out there, not to mention condensate from the a/c units in the rooms above dripping onto it. Both times I...\n\n\nMore  \n\n\n", "\nThis resort is fantastic. It's clean and well maintained and the staff are extremely friendly and anxious to see you have a pleasant stay. Restaurants are close by and the beach is a short walk away. A problem with my room wifi was fixed within minutes by a cheerful and helpful repairman...I can't say enough good things about the Luana....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/73/a3/2c/outluana-waikiki-exterior.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1179", "title": "The Equus Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "1696 Ala Moana Blvd, Honolulu, Oahu, HI 96815", "review_list": ["\nI have stayed 3 nights with my family and the room condition was very nice.\nlocated in downtown, the hotel is very useful both shopping and getting to the beach.\nMost of all, the staffs are very kind especially Leela(sorry I do not know the exact spelling^^) is wonderful.\nIn front of the Hotel, I left my car and locked...\n\n\nMore  \n\n\n", "\nJust returned from a wonderful week. I would recommend The Equus to anyone wishing to holiday on Oahu. It was affordable and the staff were very helpful and friendly. The room easily accommodated our family of 4, it was clean and quiet and the beds were comfortable. The daily change of towels and sheets was greatly appreciated even though the...\n\n\nMore  \n\n\n", "\nI stayed at this hotel for two nights, and right on the first night money disappeared from my bag. They don't have cameras and security is definitely an issue. I would not recommend this hotel to anyone.\n", "\nwe spent 14 nights at this boutique hotel, check in was smooth and the room was nice and clean, the beds were very comfy. great price, awesome location only 5 minute walk to the ala moana mall and so many restaurants and shops within very close walking distance. the service and staff were great and they are always happy to...\n\n\nMore  \n\n\n", "\nI stayed at the Equus hotel Saturday night and could not be more pleased, the beds are super comfy, the comforters on the bed are the best, I wanted to steal one actually, and the best part is it's prime location! Next time I need a room in town I'll be staying at the Equus!\n", "\nNice little hotel near Waikiki. No bells and whistle just a nice cheaper place to stay that is clean and good employees. You are able to walk to most spots in Waikiki. Be aware that you have to take stairs to get to the lobby and there is a 25.00 a night parking charge.\n", "\nWe stayed at the Equus whilst attending a friend's wedding in Honolulu recently. Very pleased that we did. The room was spacious and comfortable. The location was good, although not at the heart of the fashionable 'high end' of Waikiki beach [for those for whom such things are important]. It was also given the expensive nature of accommodation in Honolulu...\n\n\nMore  \n\n\n", "\nTravelling with my 17 year old daughter to celebrate her recent high school graduation we opted for the Equus initially based purely on price. But I must say, I was very impressed with the whole establishment! The staff could not have been more helpful or delightful. The room was clean and comfortable with loads of cupboards (sideboards) that we were...\n\n\nMore  \n\n\n", "\nVery nice hidden gem hotel. Very much a boutique hotel. Our room had a full refrigerator, desk, king bed and a bow-tie view of the ocean. Very well furnished. Friendly staff. Would definitely stay here again. You get free continental breakfast and free Beach towels. 5 min walk to the beach.\n", "\nLoved my one night stay in the 2 room suite. I always book at this hotel, this was the first time I stayed in the suite. Clean, cool, and comfortable! Easy access to nearby bars and restaurants. Super sweet and helpful staff. Perfect fit for a girls night out :)\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/04/55/a0/45/the-equus-hotel.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1169", "title": "Queen Kapiolani Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "150 Kapahulu Avenue, Waikiki, Honolulu, Oahu, HI 96815", "review_list": ["\nGreat place to stay in Honolulu, opposite the Zoo at the quieter end of Honolulu just yards from the beach with great views of Diamond Head. Staff were very helpful and friendly and couldn't do enough to help in making your stay there as great as possible. I would recommend this hotel to anyone that wants to stay in Honolulu.\n", "\nSuper hotel. I recommend you get a Diamond Head view looking out over the green canopy of the Honolulu zoo and botanical gardens. If you hear a loud roaring noise in the night, it is the lion! The staff is super nice at Queen Kap, super fast Internet is free, and the rooms are really well laid out. Good value...\n\n\nMore  \n\n\n", "\nFirst I will say that the hotel is in a fantastic location. Right across the street from Waikiki Beach. Walk to a lot of the conveniences. ABC, Starbucks and every restaurant you can think of.\nHotel staff at check in was very very nice and allowed us to check in early as we arrived on the island early morning.\nCons:...\n\n\nMore  \n\n\n", "\nOur stay here was perfect. Our room was roomy and the view breathtaking.\nKevin and Kawaii were the best employees there, so friendly helpful and full of personality !\nWe would come back just for their service ! Thank you so much !\n", "\nIt was a last minute decision form me and my family to go to Hawaii within three weeks. Being this was the same weekend as the Pro Bowl, there were limited lodging options. With combined airfare the QK came up as one of the lower cost options through Travelocity.\nReading some of the other reviews, most were fairly accurate regarding...\n\n\nMore  \n\n\n", "\nI just got back from a 3 night stay. I was told the hotel was just purchased and would undergo a major renovation towards the end of the year. The front desk attendant who told me this, said it was suppose to be a floor by floor complete remodel.\nThis was my second visit. This time I had a city...\n\n\nMore  \n\n\n", "\nme and my husband recently stayed here for two weeks as we were celebrating our silver wedding anniversary. the first room we were given was tiny so we paid for an upgrade to a suite which was beautiful. the reception staff were lovely and very helpful, the restaurant was nice and the food was lovely.we decided to opt for a...\n\n\nMore  \n\n\n", "\nStayed for one week in \"Jr Suite Diamond Head Lanai\" which looked exactly like the pic on the hotel's website. Very spacious, with an unimpeded view of Diamond Head (over the Zoo) and a decent, if not direct view of the ocean. The room had some minor stains on the wallpaper. It appeared the bathroom and kitchenette might have been...\n\n\nMore  \n\n\n", "\nYes the hotel is dated, needs a refurbish, but we got a room on the 15th floor with a awesome veiw ( uninterrupted ) of the greenery of the Honolulu Zoo & Diamond Head. Yes away from the city scape view of Waikiki. Room size a plus, plenty of windows, comfortable King size bed. Bathroom adequate size, clean.\nFront desk...\n\n\nMore  \n\n\n", "\nWe really enjoyed our stay at the Queen Kapiolani. It may not be the most modern hotel in Waikiki, and our room was on the small side (virtually filled by the king-size bed) but there were plenty of other things to like about the place. Its location is good, on the southern edge of Waikiki, it was away from the...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/a2/0f/a9/pool-deck.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1663", "title": "Ilikai Hotel & Luxury Suites, Hawaii/Honolulu", "rating_string": "4.5", "address": "1777 Ala Moana Boulevard, Honolulu, Oahu, HI 96815", "review_list": ["\nCheck in was nice and easy and we had arrived 3-4 hours before we were asked to, but still got the room we had asked for.\nThe room was nice and large, well laid out, great kitchen facilities, clean and tidy.\nThe room has a view of the sea in the distance, but it's not on the beach. However this...\n\n\nMore  \n\n\n", "\nSpectacular view of the ocean. A lot of construction going on which made it hard to enjoy the balcony. Suite could use a few more things in it to make it better. ie can opener, dish clothes, oven mitts, buggy to pick up groceries in. Other than that, it was lovely and comfortable with air conditioning. We had 2 double...\n\n\nMore  \n\n\n", "\nIn April 2011, my family (about 20 of us) stayed at the Ilikai Hotel & Luxury Suites. It was a beautiful location to spend 10 days relaxing in paradise. The room was amazing and the staff were helpful with advice on tours.\n", "\nWhat a GREAT trip Unit 1718 was a perfect location for our trip ! Relaxing Great ocean views and convienant to beach and shops . The building it self could use some renovation but all in all Great Value for the location. Unit 1718 is setup for you to go to the market and get your food to cook when...\n\n\nMore  \n\n\n", "\nPros: 1) The location is at the very tip of Waikiki--- it is out of the hustle and bustle (which could be a con) but from the beach/lagoon side, you can walk miles of sandy Waikiki Beach. It is a great location for avoiding the major downtown Waikiki traffic.. Yet, it is also a short walk or bus/car ride to...\n\n\nMore  \n\n\n", "\nwell, best to say brilliant all round! spent a month in a 12th floor apartment privately rented.\nlocation - right at the beginning of wakiki tourist area which meant you have the option to walk 10 mins into the really busy areas or 10 mins in the other direction to the worlds largest outdoor shopping centre.\nimmediately outside are bus...\n\n\nMore  \n\n\n", "\nI love this hotel and I know that though out the years it has undergone a lot of changes both physically and internally. I still find this a perfect place to stay for a weekend getaway. Good valets parking, customer service, and big clean rooms. Love the location as it is near Ala Moana and the beginning of Waikiki. Parking...\n\n\nMore  \n\n\n", "\nPros: They are really upgrading the hotel & doing a beautiful job. We stayed on the 25th floor with city views and were very pleased with the room. It has a small kitchen so you can cook & eat in, the only slight problem was that there's no dish rack to put dishes in after you wash them. All the...\n\n\nMore  \n\n\n", "\nI have been traveling to Oahu since 1972. I have seen a multitude of transformations and changes take place in Waikiki. And the Ilikai has been at the height of popularity in the 60s and 70s and then went thru some years of losing its appeal. But now there is definitely a resurgence and transformation taking place at the Ilikai....\n\n\nMore  \n\n\n", "\nMy wife and I stayed at the Ilikai from November 20-28 of last year, while spending Thanksgiving week with her mother who lives in the neighborhood.\nFor the past fourteen years, while visiting her parents once or twice a year, we have invariably stayed at the Waikiki Prince Hotel located a little more than a block away from the Ilikai....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/32/0e/92/ilikai-hotel-luxury-suites.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1687", "title": "Ala Moana Hotel, Hawaii/Honolulu", "rating_string": "3.5", "address": "410 Atkinson Drive, Honolulu, Oahu, HI 96814", "review_list": ["\nThe wife and I stayed here before joining our cruise on the Pride of America. Very handy to the Ala Moana Center and there is even an access ramp between the two buildings. There is also a Walmart and a Walgreens a short walk away.This was handy for some precruise shopping. The room that we stayed in was on the...\n\n\nMore  \n\n\n", "\nWe arrived by cab from the airport around 1230pm on Christmas day and since our room wasn't ready yet, we went looking for a restaurant. The adjoining restaurant was closed, leaving only a choice of Starbucks on the main floor or a Chinese Food restaurant on the fourth floor. We opted for the Chinese menu and were very surprised to...\n\n\nMore  \n\n\n", "\nWe had the most wonderful time at the Ala Moana Hotel. The room, staff and location were perfect for us. Everything was closeby and convenient. We would definitely recommend the Ala Moana Hotel. It was heaven!\n", "\nOkay, this place could use a facelift in some areas, but it's a great place to stay in Honolulu, right on the edge of Waikiki, next to the Ala Moana Mall and pretty central to places in the city. The value is in the location and the price, the nice service and the little amenities that make a stay there...\n\n\nMore  \n\n\n", "\nWhile tourists don't visit Hawaii for its shopping, you'll find the fabulous Ala Moana Shopping Center a short walk from this hotel. One of the best food courts I've ever seen with every variety available amid the hustle bustle, especially during the lunch hours! For the fine shopper there are high end stores and for the value-conscious shopper there are...\n\n\nMore  \n\n\n", "\nThe place is old school 70's style never going to change type hotels. I felt so disconected but it could have been the long flight. I can say my room faced the park across the street and that was nice.\n", "\nNice restaurants, helpful workers BUT annoying when keys don't work. Constant trips to the desk when workers always blamed you for what was going wrong. Close to a great shopping center with easy access to museums whale watching.\n", "\nWe have stayed here in the past and my (now) husband and I stayed here with some of our other family member's for our wedding. They upgraded one in our party but not us the bride and groom, they said we could upgrade for a fee. The room had a lot of wear, when we got there the bathroom door...\n\n\nMore  \n\n\n", "\nExtremely disappointing hotel. Rooms have not been refurbished for a long time. Bad news since this is a very busy hotel with lots of wear and tear on the rooms. Great proximity to the shopping mall. Would not recommend staying there. Long check in and check out lines. Would never stay there again.\n", "\nMy wife and I stayed at the hotel before,when our trip was delayed and were stranded in Honolulu for a day. ( Not that I don't dislike it..it's Honolulu for crying out loud!) The airline booked us in this hotel for the night. Obviously, airlines use this hotel for their staff.\nAnyway, our first stay was not extraordinary. It was...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/06/10/fc/d7/pool--v2354486.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "3233", "title": "Aston Waikiki Beach Hotel Resort, Hawaii/Honolulu", "rating_string": "4.0", "address": "2570 Kalakaua Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nThe hotel is perfect for friends, family or couples who are not on a honeymoon vacation. The hotel is at the beginning or end of Waikiki, closest to Kapiolani park.\nThe hotel is not directly on the ocean, but is across the street. It's nice because you can walk the park and escape some of the touristy parts of Waikiki....\n\n\nMore  \n\n\n", "\nI stayed at the Aston Waikiki Beach Hotel on 2570 Kalakaua Avenue, January 1 to 7, 2016. It took me a while to write a review but it's amazing how time flies.\nPros: Proximity to beach -- you cross the street and you're there as well as shops, places to eat and drink, and ABC Stores (which is actually everywhere)....\n\n\nMore  \n\n\n", "\nRoom was good refrig. flat screen TV, shower powerful. View was great, 5th floor east side, could see hotel pool ,bar resterant, & WAIKKI Beach right across the street! .\nNice break water< great swimming & wadding sunbathing. tour guides are great in the hotel George, got us all the info & times to get moving, beat the crowds! (he...\n\n\nMore  \n\n\n", "\nHad the pleasure of staying here for a week. The staff were exceptional and friendly. Tiki's bar off to the side offered great place to catch up and have a drink. Bathrooms were a little dated, however not enough to worry about.\nVery relaxing location, great for families as the beach across the road has a breakwater protecting it. It...\n\n\nMore  \n\n\n", "\nWe paid to stay in this hotel for 2 weeks to have a nice New Year vacations but what we got was a nightmare! The 31 of December after the fireworks finished we sat in the chairs in front of the Puck's Restaurant which was already closed and what we found was 2 very unprofessional security guys from our Aston...\n\n\nMore  \n\n\n", "\nFor a four star hotel, it was a bit out dated and average service. The only benefit that has a big plus is its location within Waikiki. The Tikki club was also good for a relaxing drink and a great place to socialise, friendly bar staff. The morning breakfast was a bit pathetic and you lined up like a group...\n\n\nMore  \n\n\n", "\nWe spent 6 days here in late January. Really loved the location toward the east end of Waikiki Beach where the traffic and beachgoers were lighter.The beach was less than 100 feet away and the hotel provided towels and beach chairs for guests. Also enjoyed the free movie kiosks in the lobby, watched a movie almost everyday. The room was...\n\n\nMore  \n\n\n", "\nAston is in a great lcoation and right opposite the beach, so full marks for that. The hotel looks like it was built in the 60's or 70's and is very dated.\nThe rooms were cumfortable and the service was good. probably a bit spoilt !! Not very good value for money i'm afraid.\nThe bar at the pool level...\n\n\nMore  \n\n\n", "\nright on the beach,nice room, they have smart elevators,\nbut you pay for parking $30.00 per day plus resort fee.\nno breakfast incl.easy walk to the shopping center and\nto the red line.is good to take it for $20.00, it goes around\ninteresting places and is hop on/off\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/ed/ab/35/aston-waikiki-beach-hotel.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2020", "title": "Hotel Renew, Hawaii/Honolulu", "rating_string": "4.5", "address": "129 Paoakalani Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nPicked Hotel Renew from TripAdvisor. 1/2 block from the beach and a very reasonable rate sounded good to me and the reviews sealed the deal. The staff at the hotel made us feel at home immediately. We stayed for 3 nights and enjoyed the boutique feel of this little hotel and all of the amenities including complimentary breakfast, free DVDs...\n\n\nMore  \n\n\n", "\nIt took ages for me to research all the various hotels in Honolulu / Wakiki to find one that would be suitable for me for my first trip to Hawaii. I finally settled on Hotel Renew and I was really pleased with my choice! The staff were friendly and very helpful from a quick checkin and welcome after arriving there...\n\n\nMore  \n\n\n", "\nThe attention you get when you first walk in was fantastic. A fresh juice and a cold lemongrass scented towel were welcomed while filling in the registration details.\nThe front desk and staff were always friendly and happy to help with any questions we wanted to ask.\nThe room cleaning lady was also very happy and pleasant in the morning....\n\n\nMore  \n\n\n", "\nThe hotel was in a great location only a half block from the beach. It was very clean and comfortable. The hotel had beach chairs and mats available upon request. Our view was outstanding.\nThe staff was awesome. Within 5 minutes of our arrival we received a bottle of champagne and a box of chocolates with a note wishing us...\n\n\nMore  \n\n\n", "\nWe stayed here for 2 nights before heading off to Maui.\nThe hotel is one block back from Waikiki beach but that really isn't an issue.\nThe rooms are very comfortable and very nicely decorated. Boutique style hotel.\nBathrooms are very well stocked with good quality toiletries and with towels and dressing gowns. All very modern and new looking.\nFront...\n\n\nMore  \n\n\n", "\nSuper happy with our stay here. It's nice, comfortable and clean. It was a little worn down but nothing that was a turn off. The staff was amazing and helpful. Would stay again for the short business trip we were on. Would pay more and stay somewhere a little more upscale if it was a longer vacation. If it's in...\n\n\nMore  \n\n\n", "\nLocated at the quiet end of Waikiki, half block to the beach. Bus stop is a block away,moped rental around the corner and car rental can be gotten across the street at the Marriott, including pick up and drop off. Enough restaurants in the immediate area and shopping of all kinds is a stroll down Waikiki's beachside road. I echo...\n\n\nMore  \n\n\n", "\nWe stayed at hotel Renew for 2 nights with my mom and daughter for a little girls trip. The location is amazing and right off Waikiki Beach. From the moment you check in, it felt like we were being pampered. As soon as we walked in, we were greeted with pineapple juice and a cold lemongrass towel. Definitely felt amazing...\n\n\nMore  \n\n\n", "\nHave stayed in almost every kind of hotel in Waikiki, big, small, cheap, expensive. This place is a great deal for price and service. If you don't care about pool or spa amenities, which you shouldn't this close to the beach, it's a great little find sandwiched between the Marriott and Aston hotels.\nSmall at only 9 floors, the rooms...\n\n\nMore  \n\n\n", "\nMy Husband and I stayed at Hotel Renew on our vacation. Everyone there was extremely kind and polite. We were greeted as Mr. And Mrs. at all times, doors were held open for us and spark of conversation by valet each time asking what we were going to be doing for the day and to have a great time. This...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/aa/ce/c0/hotel-renew-by-aston.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1087", "title": "Waikiki Resort Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2460 Koa Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nThe concierge was amazing nothing short of perfect. Kenneth Mendenhall was the only highlight of my trip. Our trip started off with having to pay 25 dollars per night for parking and the check in agent was not very nice on last Monday. When we prepaid for our reservation the outside website said we are only going to be charged...\n\n\nMore  \n\n\n", "\nWe really enjoyed this hotel- excellent housekeeping, friendly front desk and very helpful concierge especially when it came to storing luggage before a late night flight... As others have said, very short walk to e beach, restaurants and shopping.\n", "\nThe room was great, but the outside noise was loud and started at 5:30am. Would suggest replacing the lanai Windows and doors with soundproof ones. The bellboy Leo was awesome, as was George at the desk!\n", "\nGood middle of the range hotel. Stayed for 2 nights. Arrived at 3am check in was easy. Nice friendly staff. Stayed on 7th floor. Little bit dated but nice tidy room with balcony. One block from the beach which was awesome. Restaurant in hotel but didn't try it. Close to a number of good restaurants.\n", "\nJust one block from the beach. Lots of eating places within one or two blocks, plus a couple in the hotel. Everything was clean. Staff was friendly. We enjoyed our stay. Be prepared for the high cost of food in Hawaii. That was the only downside to our trip, but we expected it so we still had a great time!\n", "\nActually my family stayed Waikiki Resort Hotel on Feb 5 - 8 2016 and it was a wonderful time for my family.\nWe loved the staying in Waikiki resort hotel and would like to come again very soon.\nAnd our family deeply appreciate all staff in Waikiki Resort Hotel.\nThanks a lot\n", "\nFriendly staff awesome place to stay cleanrooms awesome view easy access for restaurants and beach easy check in and easy checkout friendly hostess they were even helpful on other stuff to do on the island.\n", "\nGreat Location! Very good breakfast. We Wolf definitely come back. Bus stops dir excursions are near. The waikiki Beach is a dream. Around the hotel there loads of shopping center. The hotel employed are all very helpful.\n", "\nThe staff was helpful and friendly. The rooms are small, but I didn't go to Hawaii to spend all my time in a motel room. The location was convenient walking distance to many places including the famed Waikiki Beach. The lobby was very nice and roomy. I would stay there again.\n", "\nMy family and I had about 6 rooms booked whilst our stay in Hawaii. I highly recommend this place, it was very clean, so close to Waikiki beach and all that Hawaii has to offer.\nWe were staying with our kids and needed laundry room service as well, and they had one in the basement which we found very handy...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/05/a9/30/56/waikiki-resort-exterior.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2565", "title": "Pacific Beach Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2490 Kalakakua Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nMy wife and I stayed several nights prior to our cruise, The room was very clean and the service was great. The concierge was very helpful in organizing several tours and saved us some money. Very close to the beach actually across the street.\n", "\nWe were pleasantly surprised that our room had been upgraded to a partial ocean view especially since we arrived at 10:30 at night. The rooms were a little dated but the million dollar view of Diamond Head and the ocean outweighed that. The aquarium in the restaurant was so awesome to watch while enjoying fabulous food. The housekeeping staff was...\n\n\nMore  \n\n\n", "\nGreat Hotel and location, try to get ocean front tower the views are amazing will defiantly stay here again soon i hope, walking distance to great restaurants and shopping. Amy at the Expedia desk was awesome to work with.\n", "\nThis is a wonderful hotel, located just across the street from the beach, walking distance to everything and priced just right for the area. It's clean, quiet and the staff are very friendly and helpful. I would definitely staff here again.\nN.\nCarrollton, Texas\n", "\nWe loved our experience staying at the Pacific Beach Hotel. Our accommodations were pretty good. From our room (1623) we could see the amazing sunsets.the view is breathless. the bed and pillows were very comfortable. the microwave, fridge and coffee machine very convenient (drinking my morning coffee in the balcony looking at the pacific ocean was priceless) . we loved...\n\n\nMore  \n\n\n", "\nThis property is not the 5 star property and its little dated however, the location can't be beat! Its right in front of Waikiki Beach and short distance to Dukes restaurant. I took the redeye and got in around 7:30 AM. The hotel check in policy is usually 3 PM but they got me in by 9 AM and upgraded...\n\n\nMore  \n\n\n", "\nVery accommodating staff at the desk . Warm and freindly\nGave us a beach front room with great view\nComfortable room\nCleaned well each day\nGreat position in Waikiki\nLoved sitting in the cafe downstairs each morning for coffee\nLoved the baba cue shrimps on sale each evening\nGreat beach across the road\nWould stay again as location great\n", "\nI found this on booking.com after a mess up with my reservation at the Hilton Waikiki Beach. It was close and reasonably priced. As I walked in, the beauty store employee called out to me, offering a free sample. Of course I took it and thats how I was hooked and reeled in. He wanted to show me that very...\n\n\nMore  \n\n\n", "\ni love the location, you are literally steps away from the beach. the room was very clean, a good selection of stuff you might not have packed and the bed was very comfortable. beds are a thing with me, because i so rarely find ones that let me sleep well. wifi is reliable and easy to logon. now for the...\n\n\nMore  \n\n\n", "\nMy niece stayed at the Pacific Beach Hotel for her honeymoon and told me how great it was. I stayed here for just over a week and it was fantastic. The position just across the road from the beach, near restaurants, shops and bus stops was perfect! I paid for partial beach view but as it was at the front...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/05/f5/98/49/beach--v2208214.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1968", "title": "Coconut Waikiki Hotel, Hawaii/Honolulu", "rating_string": "4.5", "address": "450 Lewers Street, Honolulu, Oahu, HI 96815", "review_list": ["\nReasonable rates, First room was on the seventh floor, facing Ala Wai Blvd. Great views of the ranges BUT....All the rooms have louvers from floor to ceiling, may as well be sleeping right next to the traffic.Very Noisy Ala Wai Blvd is a main thoroughfare, First counter assistant was not interested in helping. Second Manager on Duty was brilliant, Got...\n\n\nMore  \n\n\n", "\nOur room was terribly outdated, not well cleaned, and not very secure. The slider had a cheap hook lock, that appeared to have been forced from the wall a few times, the door would not close all the way. The main door did not have any secondary lock or chain lock. In the morning when we were leaving the elevators...\n\n\nMore  \n\n\n", "\nMy family stayed here one night in mid-February. The hotel is old and about as far from Waikiki as you could possibly be. Hotel is within walking distance to nearby shops and restaurants at the beach. It is apparent that the hotel was updated within the past few years by applying new paint and furniture. However, the structure and hardware...\n\n\nMore  \n\n\n", "\nWe stayed there for our honeymoon and it was such a great experience. The front desk gave us the mountain view room on 9th floor, which has an awesome view of the Ala Wai canal and the mountain range. They also gave us a complimentary bottle of red wine. The included breakfast has a good array of food.\nThe location...\n\n\nMore  \n\n\n", "\nSince there is so much renovation going on in this area of hotels and motels its quite noisy during the day. We arrived 2 hours before check in and since our room wasn't ready they stored our luggage for us, then we walked around town for awhile. I think since we didn't make a fuss over not getting a room...\n\n\nMore  \n\n\n", "\nWe stayed here in January of 2016- The property is mid rise and right beside the Ala Wai Canal. Our room faced Lewers street but we could see the canal from our room which is probably the best choice as we spoke with a guest who had a room facing the canal and he said you could hear the street...\n\n\nMore  \n\n\n", "\nWe stayed in the coconut for 10 days in September as part of our honeymoon trip.\nIt was our first time in Hawaii & we found this hotel suited our needs perfectly. Sure it's small but I believe that makes it more intimate. When we arrived they gave my husband a can of Hawaiian beer and sent a bottle of...\n\n\nMore  \n\n\n", "\nWe needed a layover between Australia and Seattle and chose Honolulu. Most of the hotels were more expensive than I wanted to pay, especially near the airport so we chose this smaller hotel downtown in the Waikiki area. We weren't disappointed. The room was clean, large and comfortable with a private balcony and all the other expected amenities. The location...\n\n\nMore  \n\n\n", "\nThe hotel was for one night only, could not locate our reservation, and finally settle in to a nice room for our evening prior to flying out! The continental breakfast was mediocre, however, it is not a 5* rated property.\n", "\nI stayed at the Coconut Waikiki hotel for 3 nights, On arrival i was upgraded to a great spacious room for free! The room was equipped with a big bed, 2 bathrooms, a little dining area, and also a lounge area! Breakfast was good, had the essentials such as toast, waffles, yoghurt, fruit ect. Walking distance was around 5-10 minutes...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/02/4d/ca/00/bw-plus-coconut-waikiki.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1419", "title": "Aqua Aloha Surf Waikiki Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "444 Kanekapolei Street, Honolulu, Oahu, HI 96815", "review_list": ["\nSuper friendly and helpful staff! Michael at the concierge desk was amazing. Everyone at the front desk was welcoming and a pleasure to deal with. This is an amazing value for the price, it is a 5-10 minute walk to the beach (just depends on your pace) and has great mountain views. If you aren't looking to spend $$$$$$ on...\n\n\nMore  \n\n\n", "\nWe requested a room with a view of Ali Wai and we are very pleased to have the room with a balcony that has everything we asked for. The location is ideal for walking to Diamond Head tennis courts in one direction and Waikiki beach in another. Every employee has been friendly and helpful, but there are three that I...\n\n\nMore  \n\n\n", "\nWe stayed here for two nights on a layover from the U.S. to Australia. This was a great choice for many reasons:\n* Staff: we arrived before check-in. The staff member at reception. I am sorry I don't remember his name, I was rather jet lagged. He asked us if we wanted beach towels so we could go for a...\n\n\nMore  \n\n\n", "\nThis place did not end up being as bad as some reviewers had mentioned. I found the service to be great. The room wasn't anything special, but it was clean with no cockroaches. The air conditioner worked fine, although I wish I had the option of blowing it in a direction that was not right on the bed.\n", "\nTravelling around the world I have never had such a friendly reception from staff with free cocktail hour on a Tuesday done by the manager and a box of chocolates from a director the open foyer with relaxed seating and free coffee and complimentary coffee 5 minute walk to beach and at a great price for this part of town...\n\n\nMore  \n\n\n", "\nWe checked in on 1/16/16. Excellent location, walk to town, but quite noisy with street traffics.\nThe room was horrible! AC in wall was right next to the bed..blew right on the head, or if off, too hot in the room. Very old looking, and ancient carpeting. Lobby is fine. Breakfast is free, but unless you like cold pancakes, tasteless...\n\n\nMore  \n\n\n", "\nHotel is very close to every thing in Waikiki area. The staff was very friendly and helpful. I was surprised that they provide free breakfast. It is more than continental breakfast, more like full fare with both Asian and western breakfast buffet food.\nThe room is rather small but it is clean and for the price in Waikiki, this hotel...\n\n\nMore  \n\n\n", "\nThe hotel isn't right on the beach, but it's in a wondrful location just far enough away to avoid all the tourist noise at night but close enough to have a short walk to the beach and Duke's. But THE STAFF are amazing! They treat the guests so awesome. I would come back here just for that. Their corporate reservations...\n\n\nMore  \n\n\n", "\nIs worth the money. They really should call it a full meal rather than continental. Tons of unhealthy and healthy options to choose from. I really enjoyed the buffet that extends tothe neighboring restraunt.\n", "\nGreat hotel. The staff are amazing. So helpful. I love the relaxed and welcoming feel. The little extras like staff walking around and talking to guests, the complimentary house specialty drink time in which guests are all mingling together just made my solo trip all the more enjoyable.\nYes, the rooms are a little dated but they are clean. The...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/ef/9c/f9/aqua-aloha-surf-waikiki.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1674", "title": "Aqua Palms Waikiki Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "1850 Ala Moana Blvd, Honolulu, Oahu, HI 96815", "review_list": ["\nI like the fact that this hotel is approximately half way between Waikiki and Ala Moana Shops. Also easy access to Beach.\nRooms comfortable enough with micro wave and fridge although a little small, atypical for Waikiki. Strange sensation walking in the corridors as the floor are all sloping and uneven. Plenty of dining outlets nearby. I found the staff...\n\n\nMore  \n\n\n", "\nWe won 7 nights in Honolulu and were given the choice of two hotels and chose Aqua Palms simply because of the location. We couldn't have been more pleasantly surprised! Location was great, staff was extremely helpful, and the room was clean. On check-in we were notified that we would only get housekeeping one day because of the award that...\n\n\nMore  \n\n\n", "\nThere were a lot of irritating things upon check-in. The pool is closed. A staff member said she tried to let all the booking sites know, but it's not even on their own website. The bell-person was unessisarily rude. That said, they made efforts to improve my stay when I let them know. Had they not, this would be a...\n\n\nMore  \n\n\n", "\nThe building is old and needs updates, but it was clean and had comfortable beds. It was a good location and the bus stop was right outside the building. We walked to Waikiki beach and took the bus to the Pearl Harbor Memorial.\n", "\nThis hotel is quite nice for the price. The location is ideal as it is surrounded by cafes and shops and only a short walk to Waikiki Beach. Bus stop across the street provides cheap transportation. Staff are very friendly and helpful.\n", "\nThis hotel was priced excellent and had a lot of amenities for the price.\nIt had a nice refrigerator in the room and the room was dated but large. The lobby is very nice and the staff are very helpful.\nThe location is perfect. Very close to the beach, nightlife and shopping. It does have a shuttle service that you...\n\n\nMore  \n\n\n", "\nOur stay was very nice but the only complaint i have is the room size and the bathroom size very cramped could have fixed the tub in the room the drain was very loose but other then that it's a very very nice hotel quite close to everything nice that it's across from the hilton hawaiian village to go to...\n\n\nMore  \n\n\n", "\nWe stayed at this property for 7 nights, and for the price, and friendly staff, we found it very comfortable. Our partial ocean view was more thn I expected, and by booking this type of room, we enjoyed a complimentary full breakfast at the Wailana coffee shop, just a few steps away, a complimentary shopping shuttle, which took us as...\n\n\nMore  \n\n\n", "\nWe booked this hotel because they were offering a very good price for the week. I was a little skeptical with a 3 star but it wasn't so bad. The bed had nice clean sheets and was very comfortable! The thing I didn't like was our room wasn't cleaned until about 230pm every day and I don't think they vacuum...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/8b/8e/b6/aqua-palms-waikiki.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2128", "title": "Trump International Hotel Waikiki, Hawaii/Honolulu", "rating_string": "4.5", "address": "223 Saratoga Road, Honolulu, Oahu, HI 96815", "review_list": ["\nHad a wonderful stay at the Trump in Waikiki. Location is prime though not directly on the beach...but walking distance to most of Waikiki main streets and the beach itself. The service was excellent throughout our 7 night stay. I loved that there was an endless supply of fresh towels in our bathroom throughout the day. The room was spotless...\n\n\nMore  \n\n\n", "\nBest place to stay!!!!! Perfect location!!!!walking distance to everything in wikikiii.\nThe staff treats you like royalty!!!!! If you need something they will find or do it for you.\nI could not be happier with my stay here.\n", "\nOur very first time in Honolulu and booked the best hotel here. Flight was early so we arrived to do the checkin, paid extra money to get an ocean view room which was REALLY worth trying!\nRoom is spacious and equipped with kitchen stuff, feel like home. We could see the breath-taking view of the ocean direct from the balcony,...\n\n\nMore  \n\n\n", "\nExcellent very modern and well equipped rooms with spacious bathrooms. Not on the beach (but not many are and frankly it's not much of a beach to be on!) but only a block away and towels etc are provided. Jut walk across the road and when at the beach turn right and walk 200 yards where the beach opens out....\n\n\nMore  \n\n\n", "\nTrump International is friendly & generous in servicing people.\nI like their smile.\nsome hotels like ihilani JW marriott treat asian stayer in bad ways. they frown, look down & even cheat by overcharging the bill.\n", "\nThe location was perfect, steps away from famous waikiki beach but located on one end of the strip away from all the hustle and bustle that is waikiki. We were there celebrating my sons 12th birthday. We had an early check in which was nice. We pulled into the valet where we were greeted by the doorman Marleto. He offered...\n\n\nMore  \n\n\n", "\nMy husband and I stayed at the Trump International Waikiki for a week in January. It was a perfect vacation. The hotel is beautiful, immaculate, convenient to everything Waikiki has to offer and the staff was attentive, professional, polite, friendly and incredibly helpful.\n", "\nStayed in the luxurious Trump international for 5 days in February. The hotel is nicely located just off the main strip and very close to all the good restaurants in Waikiki. The hotel would be a fantastic property for a business trip however does not have the beach holiday feel to it that other properties like the Outrigger or Moana...\n\n\nMore  \n\n\n", "\nWe know the Trump Las Vegas and the one in Waikiki is at the same level when it comes to customer service and great amenities. To our surprise we were upgraded from superior city view to deluxe partial ocean view which got us a bigger room with lanai. It is all very sophisticated. It really felt like home and we...\n\n\nMore  \n\n\n", "\nAll staff was professional, friendly, and the room was beautiful! Next time I stay in Waikiki I will definetly pick this hotel again!\nI was always pleasantly greeted first which made me feel welcomed and not hesitant to ask questions. Everyone was very professional and knowledgable about the property!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/cf/36/ff/trump-international-hotel.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "727", "title": "Lotus Honolulu at Diamond Head Resort, Hawaii", "rating_string": "4.5", "address": "2885 Kalakaua Avenue, Honolulu, Oahu, HI 96815 (Formerly The Lotus at Diamond Head)", "review_list": ["\nThis place is amazing! This hotel feels more like a resort away from the busy Waikiki area. Its located in between the end of the Waikiki strip and the famous Diamond Head volcano. We upgraded to the premium room (corner suite) with two balconies, one facing the diamond head and the other facing the beach, where you can enjoy the...\n\n\nMore  \n\n\n", "\nLocated 10-15 min walk from Waikiki and main drag. Far enough away to be quiet, but close enough to avoid taxis. Very friendly staff, especially the valets and beautiful views from our 10th floor room.\n", "\nVery friendly staff, great room, great location.\nI slept very well\nWill stay there again\nEverything was just wonderful.\nI highly recommend thus lovely boutique hotel for business or vacation as well\nMahalo\n", "\nMy wife and I recently stayed at the hotel.\nThe experience was wonderful.\nThe staff was very helpful and they went beyond the expected to help us. They were 5 star.\nThe room was 5 star.\nWe highly recommend the hotel to anyone.\n", "\nA very clean, quiet and upscale Hotel. Also included is a very nice wine service late afternoon each day. Although there is no pool, they offer towels and beach chairs to use on a private and very cozy beach nearby.Excellent service, quiet and relaxing!\nClose proximity to Waikiki beach as well as Diamond head.\n", "\nWhat a find!!! We loved this place. Quiet with only the birds to sing to you as you sit on the balcony resting your eyes on the luxurious green of Diamond Head & Kapiolani Park. A slight turn of your head and the view changes to the ocean with a surfer or sail\nBoat. The Lobby greets you with the...\n\n\nMore  \n\n\n", "\nIf you are looking for an excellent, comfortable hotel near the heart of Waikiki then I heartily recommend Lotus. We love the Zen like atmosphere and Balinese furnishings. Staff is very friendly and accommodating. We have stayed multiple times and have never been disappointed. I would definitely recommend it.\n", "\nMy wife and I had booked a long weekend in a Diamond Head View Premium View room at the Lotus. The website promised incredible views and free breakfast with a 5-night stay. When we checked in to the room our view turned out to be a Parking Lot View Premium (see photos) and we were told that the breakfast was...\n\n\nMore  \n\n\n", "\nNice big room with a view to the mountain, beach snd parking lot, nice big balcony. Clean, modern room, with coffee maker. Complimentaty wine serving every night(?). Nice calm location with easy beach access, nice small beach. Service was great!10min walk thru the park, safe. Parking included. Small breakfast option not so tempting. Overall, good price for the quality!\n", "\nWe loved the location of the hotel. It was a quiet spot away from town but close enough to walk there. A free shuttle to town if a person isn't able to walk or chooses not to. Easy access to the beach and a nice park across the street. The employees were all friendly and accommodating. The rooms were kept...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/73/a4/43/lotus-honolulu-penthouse.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1735", "title": "Courtyard by Marriott Waikiki Beach Hotel, Hawaii/Honolulu", "rating_string": "3.5", "address": "400 Royal Hawaiian Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nPicture 20 people, staying in 11 rooms, anywhere from five to nine nights. Ona and Brent pulled it off flawlessly for us. No problems at check-in, all rooms were ready and as expected. Staff was courteous and well-trained...the front desk staff knew most of our names on site after a couple of days (sort of expected), but so did the...\n\n\nMore  \n\n\n", "\nThis stay was very good right up to check-out!!\nThe bed was amazing, they accomdated my very early arrival, and best of all Ray thought of a way for me to get to the Mariott Vacation Club for $30 rather than $175!!!!!\nThank-you again Ray:-)\n", "\nNice place to stay. Great location, walking distance to beach, shopping and restaurants. Very clean and friendly staff. Rooms are small but if your in Hawaii..all you should be doing in your room is showering and sleeping. Pool does not get much sun...but is beautiful and clean. I would definitely stay here again.\n", "\nMy aunt gifted us two nights here for the first portion of our stay in Waikiki. Let me begin by saying, I would never choose to stay here.\nParking is valet only. Valet was a heaping $37/night + tip. The valet guys were pretty cool for the most part with the exception of one lady who was just stank from...\n\n\nMore  \n\n\n", "\nI booked the trip with expedia, they say \" no extra charges\" I had to pay 170$ extra for parking!! They're renovating the balconies so you can't use them, the room we got look nothing like the pictures in expedia and the beach is not walking distance!! Terrible service and attitude in the front desk just bad!!...\n", "\nThe hotel rooms and hallways are outdated, doors squeak, bathroom faucets and sinks are not designed well so water leaks everywhere. But the staff is absolutely amazing. They go above and beyond to help out and if you are short on something, housekeeping will be at your door soon after the call. The valet staff is also very kind and...\n\n\nMore  \n\n\n", "\nThis was a layover stop on the way to New Zealand so what was important was a good night's sleep. I found my room in the tower on the 9th floor to be very comfortable and quiet. It had a balcony that was under construction, but no work was done while I was there, so it was not a problem....\n\n\nMore  \n\n\n", "\nMy only disappointment was Marriott advising me I would not get credit for my 9 night stay because I booked through \"a 3rd party\" even though the cost I paid for points was actually higher than their posted rate on line the day before I checked in. I thought this cheap on behalf of Marriott and not something Amex would...\n\n\nMore  \n\n\n", "\nGood overall stay!! Nice clean room friendly staff, only draw back was not able to use the Lani (balcony) due to renovations. Still good reasonably price room close to many restaurants and night clubs, retail stores.\n", "\nAlthough the room is comfortable, but the food options on site are disappointing. I did not choose this hotel for its location but it is close to lots of things. For a good bed, hot shower, friendly staff, and very clean room, this USA good place to stay. Wishing the poolside waterfall was quieter, and that the air conditioning did...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/4b/8c/b0/corner-suite-balcony.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1000", "title": "Hilton Grand Vacations at Hilton Hawaiian Village Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2003 Kalia Road, Honolulu, Oahu, HI 96815", "review_list": ["\nIt was supposed to be an upgrade. They mistreated me. Gave me a room different than the one in the photo that I used to book it. They wouldn't change the room and when I threatened to leave they asked when. I wrote a letter to Hilton and received a computer written reply. HHV is crowded and overpriced. I paid...\n\n\nMore  \n\n\n", "\nI have stayed in this resort 10 times and would not ever stay anywhere else. Everything is top notch here! Easy access to anywhere on the island. Very clean. Very helpful staff. On site shopping is great.\n", "\nWe stay at the Kaliia tower,which I think it was a great choice is really close to everything within feet of the main pools, maybe 150 feet or less to the beach. We had a room with a king size bad with a really beautiful view of the beach and the whole property.even though we had a side view. In...\n\n\nMore  \n\n\n", "\nFriendly and accomadating staff! The location is within walking distance to great restaurants, downtown shopping and the mall. Charlie's Taxi provides flat rates to & from the airport. The Resort has something for everyone in the family to enjoy.\n", "\nGreat location, beautiful ground & fireworks every Friday night. Easy walking to lots of places to eat. Great pools with happy hour & right on the beach. Good access to a lot of shopping & close to the bus route.\n", "\nThe size of this property was initially overwhelming and we didn't expect a \"village\" in its literal sense. It took a few days to become familiar with the various parts of the village and even then I don't think we covered it all. The village itself is a very busy place with constant flows of guests walking the streets -...\n\n\nMore  \n\n\n", "\nThis was an important stay for our family. So I tried to contact them more than 3 times (2 emails, 2 phone calls, and leaving a note) just to confirm a room type, as we purchased \"ocean view\" two bedroom suite. Long story short, we got a room facing hotel construction hearing the noise all day long. You could see...\n\n\nMore  \n\n\n", "\nWe were a little hesitant of the ocean view if there were buildings in front of the lagoon tower, but they worked it out just perfect that you can see the view to iconic Diamond head and still some of the beach. We were lucky enough to see the birds eye view of the luau's below us too. Be aware...\n\n\nMore  \n\n\n", "\nThe Lagoon Tower, Hilton Hawaiian Village is an excellent place for a vacation any time of the year, our vacation to Hawaii was in January for a two week vacation, the various activities at the village are many and various\n", "\nWe stayed here during the holidays for a week. Overall it was a good experience. The only things we didn't care for was the slow internet, the onslaught of young children inundating the hot tub, and the early closing of the Lagoon Tower pool area. Also, though the room was comfortable, it could probably use a nice remodel soon.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/08/14/d7/44/lagoon-and-kalia-tower.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2131", "title": "Holiday Inn Resort Waikiki Beachcomber Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2300 Kalakaua Avenue, Honolulu, Oahu, HI 96815 (Formerly Ohana Waikiki Beachcomber)", "review_list": ["\nGreat Hotel, couldn't ask for a better location, very clean, tidy rooms with super comfy beds, rooms very quiet despite location and building noise of the International Market Place. Customer Service outstanding and the Front Desk Staff even remembered my name each time I walked by, for the whole week! Would highly recommend it.\n", "\nWe stayed for 7 nights in a 2 double room. We had a cot brought in for our 4th.\nThe beds were very comfy\nthe room large enough to fit the cot in between with still walking room\nThe housekeeping is exceptional. Lots of towels and toiletries available\nThere is a coffee maker with coffee in each room, plastic cups...\n\n\nMore  \n\n\n", "\nWell appointed rooms, very comfy bed. Clean. Location excellent. Everyone I spoke with at the hotel was very nice and helpful. I would highly recommend a stay here. Only negative comment was the high cost of parking, $35.00. But that might be the norm in the area.\n", "\nI stayed here for 10 nights on business - brought my wife. Our room was pretty big for Waikiki, clean and well equipped. The hotel gym was very well equipped, with a very new treadmill, exercise bike and elliptical along with other stuff.\nThe pool, while small, was nice, as was the hot tub, and there were always fresh pool...\n\n\nMore  \n\n\n", "\nStandard quality Holiday Inn. Rooms are large, clean and well appointed. The staff, from the front desk to the cleaners are extremely friendly and helpful. Excellent location in the heart of Waikiki. It doesn't get more central than this. The pool is small, but gets good sun throughout the day. When the hotel is busy it can be a bit...\n\n\nMore  \n\n\n", "\nJust returned from15 days in this hotel, our home away from home. Thanks to Jennifer F for her total care with our booking after our travel agent made everything difficult. Christina checked us in with a huge smile and it was the easiest check in we have experienced, anywhere. She was as excited as us about the gorgeous room we...\n\n\nMore  \n\n\n", "\nA group of 14 of us arrived at the Holiday Day Inn Beachcomber Waikiki on January 21 before we boarded the NCL Pride of America cruise. The holiday staff was so friendly from the bellhop who greeted us at the curb and helped us with our luggage, to the front desk clerks who were always smiling and willing to answer...\n\n\nMore  \n\n\n", "\nThe Hotel was beautiful and fantastic location- easy to walk to everywhere.\nHighly recommend to request the top floors of the hotel because the view is unreal. Best of the best staff at the beachcomber starting with James Speight. He worked above and beyond as concierge to magically fulfill our most crazy of ideas to make our holiday amazing. I...\n\n\nMore  \n\n\n", "\nThe hotel is in such a great location very central to everything. Despite having for 4 adults to one room it was still very spacious and did not feel squishy at all and views were incredible. All staff where very friendly and helpful, in particular one of the concierge - JAMES SPEIGHT.\nJames was so incredibly helpful and our holiday...\n\n\nMore  \n\n\n", "\nThe hotel was amazing - incredible staff, beautiful rooms/views and perfect location. Whilst the hotel ticked all the necessary boxes, they also win the title of best concierge in Hawaii, specifically: JAMES SPEIGHT.\nJames is honestly one of a kind. He does his job in such a way you can definitely feel that he is genuine and has your best...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/75/d2/a0/holiday-inn-waikiki-beachcombe.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "567", "title": "White Sands Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "431 Nohonani St., Honolulu, Oahu, HI 96815 (Formerly Celebrity Resorts Waikiki)", "review_list": ["\nI find it hard to say anything negative about this hotel at the price and location. Our pool view room with kitchenette was sizeable with a balcony. The kitchen was adequately equipped to self cater although irritating to English people they provide a coffee maker but no kettle so tea water has to be microwaved (common in the USA). There’s...\n\n\nMore  \n\n\n", "\nI have been going to Hawaii since 1964 and stayed in all types of hotels. I do not like any of the high rise Waikiki hotels, just too many people, too much time getting to an from your room. The White Sands is clean,extremely reasonable, outstanding location, quick in quick out which is so important. Front desk is incredibly friendly,...\n\n\nMore  \n\n\n", "\nThe positives: the location, it's close to everything. The staff did seem friendly but we did our best to stay out of the hotel because of the...\nThe negatives: it's outdated and gross. We had a roach that came to visit in the bathroom each night. Our air conditioner was rotting as well as most of the hotel. We did...\n\n\nMore  \n\n\n", "\nI've staying at White Sands Hotel in Waikiki, while working a block away, for the past 3 weeks. Myself and 5 other coworkers have been enjoying our stay here immensely. The staff are very helpful and kind, especially Christieann. The Hawaiian word of the week is a great touch. 👌\nThe location is excellent, about 2 blocks from the beach....\n\n\nMore  \n\n\n", "\nI read the reviews but since we didn't have a car we figured we would try it. The place is nice, good location. We got a shuttle from the airport, it wasn't from the hotel but it took us there. You have to ask the guys at the airport with the shuttles & some take people all over the place...\n\n\nMore  \n\n\n", "\nI did not expect a 5 star hotel, since I was not paying for one. My standard room had a king bed, mattress was not bad. The second floor lanai overlooked the pool. I had a microwave, frig, coffee maker. They do have rooms available with full kitchens. Free newspaper, the internet was not very strong in my room, I...\n\n\nMore  \n\n\n", "\nI found this hotel through reviews on Tripadvisor. The price was right, location excellent, reviews good.\nThe staff was very friendly when we checked in and when we asked questions at the front desk. Helpful with things like getting towels for the pool or help with directions.\nThe setting is very pleasant. Flowers overhead great you as you enter. The...\n\n\nMore  \n\n\n", "\nLooked good online but was quickly disappointed upon arrival. There is about 8 parking spots in front of the hotel which ISN'T FREE!! If you can find a spot (good luck) it costs $20 to park there! We had to park across the street where it costs $35!! On top of that there is an extra $11 cleaning fee for...\n\n\nMore  \n\n\n", "\nThey do not tell you parking is $30/night and their convenience fee is $10.75/night applied at the hotel - it is not included in any fare/taxes/fees that you pay through the booking site. The room is mediocre but nothing so bad as to make us leave. The area is very busy and crowded, looking forward to getting out of Honolulu...\n\n\nMore  \n\n\n", "\nStayed here last October..A lot of great places to eat nearby and a great pool . Great view of the mountains and only blocks from the beach . A market with anything you need nearby.Old school Hawaii in Downton Waikiki .... LOVED IT and just saw you on Hawaii Five O ...They know where the Ohana is. We look forward...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "755", "title": "The New Otani Kaimana Beach Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2863 Kalakaua Ave., Honolulu, Oahu, HI 96815", "review_list": ["\nWe were there for three nights and really appreciated the quick access to the beach. The room was very small which made me a little stir-crazy by the second day. The restaurant in the hotel was very expensive and not kid-friendly. That being said, the food was very good. The valet fellows were all very nice and friendly and helpful....\n\n\nMore  \n\n\n", "\nTwo nights here, late January. Rooms are small but adequate. Away from the noise and traffic along Waikiki, but an easy walk away. Very nice beach. Outstanding breakfast menu, and the restaurant is noteworthy. Attentive, well trained staff. This would be my first choice for future trips to Honolulu.\n", "\nWe chose an Ocean Superior Room for 4 nights. At first, they made some mistakes on our booking order. They gave us Ocean Waikiki Superior type instead of Ocean Superior, and claimed that not all the types revealed on the website of Booking.com. After we told them that the price we paid and the picture displayed on the Booking.com indicating...\n\n\nMore  \n\n\n", "\nWe booked our room before we left based on reviews. We opted for an Ocean View room, but upgraded when we got there. The ocean view really was only a side view of the ocean. The room we upgraded to had the \"side view\" of the ocean, but also a full on view of Diamond Head. You could watch the...\n\n\nMore  \n\n\n", "\nWonderful hotel located on the beach that's next to Kapiolani park. The outside of the hotel is unassuming. Rooms are newly updated with fresh designs. Standard amenities are all there. Quiet air conditioner to keep you cool on those hot summer nights. It's a quiet little hotel that I would recommend to friends and family.\n", "\nWe stayed for four nights in November and initially had a tiny but well designed and equipped room, with a fabulous view of the ocean and the Waikiki skyline. On the third night the hotel upgraded us to a superior room with the same great view and much more space. This small boutique property is in an ideal location in...\n\n\nMore  \n\n\n", "\nI'm a little late in writing this review, but I definitely wanted to post it. I stayed here in May for combination business / pleasure. There was a minor snafu with my reservation--in that despite my confirmation number in print with the days of my stay, the person at the registration desk could not find a record of my arriving...\n\n\nMore  \n\n\n", "\nAfter a terrible experience at a nearby hotel, we booked a long weekend in a Ocean View Standard room at the New Otani, and we couldn't be more pleased. The room, while small, was clean and comfortable with an awesome view of the beach, park and skyline.\nThe New Otani is on the sand at Kaimana Beach, which is only...\n\n\nMore  \n\n\n", "\nThe hotel is in a good location if you prefer to be away from the crowds of the commercial area of Waikiki beach but is within walking distance of the strip, also you can take the hop-on hop-off bus to get you to the strip. The hotel is right on the beach and the lobby restaurant is open air on...\n\n\nMore  \n\n\n", "\nNice hotel, not the best one on the waikiki beach, but cheap.\nAt the end of the beach, in a beautiful park. 8- 10 min by walk far from the main street of the town.\nRestaurant with an amazing view, wonderful place where have a drink.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/37/a1/46/getlstd-property-photo.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1409", "title": "Hawaii Prince Hotel Waikiki, Honolulu", "rating_string": "4.0", "address": "100 Holomoana St., Honolulu, Oahu, HI 96815", "review_list": ["\nMy wife and I stayed here on 1/27/16 and again on 1/30/16 to 2/2/16, on two different floors. I chose this hotel because it was one of the few I found in this price range that got a 4 star rating on both Expedia and Trip Advisor. Also, several reviews said that it was on the quiet end of Waikiki....\n\n\nMore  \n\n\n", "\nThe hotel is in a a fantastic location, has knowledgeable and helpful lobby staff and a free shuttle bus to Waikiki which was a nice touch. But the rooms themselves were kind of tired; stayed on two occasions, both rooms had peeling wallpaper and a bit of mold in the shower. Not deal-breakers, but not what I expect from a...\n\n\nMore  \n\n\n", "\nStayed at this hotel for one night before and early flight. Was convenient as it was closest to the airport that was near the waikiki strip. free shuttle bus provided by the hotel that can take you to a few different stops in the area. The hotel is probably about a 30- 40 minute stroll from the main area of...\n\n\nMore  \n\n\n", "\nOne of my fav hotels in Honolulu stayed here many times always great. Ok not on Waikiki but just ashort walk or hotel provided shuttle. But what you get are amazing views of the marina and ocean and the rooms are big, clean and comfortable.\nBest features are the large windows that open to the trade winds. Leave them open...\n\n\nMore  \n\n\n", "\nHawaii in these areas are run down what can you expect the place is in the center of Waikiki. Close to everything and the food across the street is a buffet and worth trying. I rented my jeep from downstairs and was saticefied market downstairs also in the building. 2 blocks from the beach and river. Found it to be...\n\n\nMore  \n\n\n", "\nI chose this hotel as it was at the airport end of the Waikiki strip for an early flight get away. It is an easy walk to the Ala Moana Shopping Centre, Ala Moana Beach Park, Hilton Hawaiian village complex and lagoon. It's a quieter end of Waikiki. I also chose a slightly more upmarket room which was lovely. Huge...\n\n\nMore  \n\n\n", "\nI needed a hotel for one night before my early morning flight. This hotel is at the western edge of Waikiki closest to the airport and it promised a view of the marina and the ocean beyond, so I booked it.\nOverall, The lobby is in better shape than the rooms, which could use repainting and other minor updates. I...\n\n\nMore  \n\n\n", "\nGreat location, okay accommodations, and breath taking views! The hotel is very central for a Waikiki hotel. Close to downtown Honolulu and an easy walk away from all of the Waikiki attractions. Rooms are fairly spacious however, seem a bit worn in and dated. A modest refresh of the room would do this property wonders. Pool and hot-tub area seems...\n\n\nMore  \n\n\n", "\nWe've stayed at the Waikiki Hawaii Prince a few times and have had a pleasant experience each time. We usually have an upper-floor room with a view of the marina and the ocean beyond - the sunsets are amazing!\nAll rooms here are ocean-view and the windows are floor to ceiling to take full advantage of that view. In general,...\n\n\nMore  \n\n\n", "\nHad a great stay at Prince Hotel Waikiki, a 10 min walk from Waikiki beach was worth it after long full meals, the mall was at a 5 min walk, the Hotel is quite, customer service is on point & fast room service.\nA bit over priced comparing to more central Hotels considering the distance, and the food & beverage...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/b7/93/5f/hphwexterior-vfm.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "924", "title": "Shoreline Hotel Waikiki, Hawaii/Honolulu", "rating_string": "4.5", "address": "342 Seaside Ave, Honolulu, Oahu, HI 96815 (Formerly Seaside Hotel )", "review_list": ["\nArrived 9am. They were able to check us in to one of our groups rooms until the other room became available. Stayed for 3 nights. Great friendly staff. Excellent lobby area with good wifi and water. Roof top pool was cool. Quick walk to Waikiki beach. Good eateries close by. Would definitely stay again.\n", "\nWe spent two nights here and arrived in the night after 2 am. The receptionist was so friendly, he even offered us something to eat. The rooms are small but the bed is comfortable, the bathroom clean and well equipped.\nAnd everything you need is in walking distance. Also breakfast at Heavenly Coffee is highly recommended. Worth every penny!\n", "\nThis hotel compared to some around it was not comparably big but I would classify it as Boutique and beautiful. It met all our needs and was extremely well presented from the lobby through to the rooms. We stopped here on our way home to Australia from the mainland. This is not my first time in Hawaii and this hotel...\n\n\nMore  \n\n\n", "\nWe stayed at the Shoreline for 6 nights in January. The hotel was in a great location and the hotel made our stay a fantastic one.\nWe were visiting for our honeymoon and my husband was 40 whilst we were there also. Check in was a breeze and our room was ready when we arrived at just before 3pm. The...\n\n\nMore  \n\n\n", "\nThis is a good value for money option when staying overnight in Waikiki. Location is excellent, rooms are small but clean and staff is friendly. We already stayed here 2 years ago and think it’s solid.\n", "\nThis hotel is greatly overrated on most reviews 8/10 is no where accurate. The rooms are small & balconies small,so double rooms have 1 chair inside & 1 chair outside,basically there is no room. bathrooms small, basically. Small is the best word to use. We were on the 12th floor view to ocean blocked by city concrete. location ok &...\n\n\nMore  \n\n\n", "\nPosting this review sitting out on the lanai at this nice hotel. Stayed 4 nights. At check-in was given a choice of what room I wanted out of 4. I recommend picking a room that is not facing the Seaside Commercial Center (it's kind of not pretty looking). My wife and I had a private swim on the rooftop pool....\n\n\nMore  \n\n\n", "\nWe picked this hotel because of location which is in the centre of Waikiki, not in the strip but very near to the main attraction. The room is clean and the staff are very friendly. We had an initial issues with our card as we thought however the staff admitted that it turned out their system had just been upgraded...\n\n\nMore  \n\n\n", "\nWe booked this hotel for nine nights after reading reviews and on recommendations of others. We were very disappointed.The rooms were meant to be renovated but were very small and the bathroom was tiny with no ventilation whatsoever .\nWhen we tried to check in on arrival after a nine hour flight we were told check in was at 3pm...\n\n\nMore  \n\n\n", "\nPros: Free Coffee and Tea in the lobby 24/7, valet parking, free wifi, 5 mins from Waikiki beach, friendly staff, clean rooms\nCons: Housekeeping knocked on my door at 7am each morning, pool is a bit small, restaurant wasn't too great. Found a roach in my room and contacted the receptionist. The bellman arrived and quickly removed it from our...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/08/b4/fc/c3/exterior.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1351", "title": "OHANA Waikiki East Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "150 Kaiulani Ave, Honolulu, Oahu, HI 96815", "review_list": ["\nOHana East is located 1 block back from the beach, shops and restaurants of Waikiki.\nIt ts only a three to five minute walk and your on the main street of Waikiki, a couple of minutes more and your on the beach. The hotel itself is comfortable,,we'll run, clean and tidy with coffee shop/bar, pool area. Economically priced, good position.\n", "\nCurrently staying here for 7 nights and after reading the mixed feedback over the past few weeks before our arrival kept an open mind. Can I say we were pleasantly surprised. Yes it's an older hotel but its maintained quite well. The bathroom is small but there is a dressing area in front so it's no big deal, toiletries selection...\n\n\nMore  \n\n\n", "\nStayed here with 4 other friends in a 2 bedroom suite on the 18th floor. Room was clean, spacious, and comfortable - Plus had a great view of the ocean! Location of the hotel was awesome - a minute to the beach, to the bus stops, and to a pick up for the pink line trolley. Staff were super helpful...\n\n\nMore  \n\n\n", "\nStaff are very polite and friendly. We stayed on level 16, has a great city view. The room overall was well maintain and clean. The hotel provided us with complimentary shuttle service to go around Waikiki. Short distant to restaurants and shops, which is very convenient. We would choose to stay at this hotel again for our next visit.\n", "\nFrom the moment we checked in to the moment we checked out we were treated with nothing but superb customer service. Reasonable rates, great location, clean room, and the customer service makes Ohana East by far my favorite hotel to stay at in Waikiki. Mahalo to the staff at Ohana East for setting the bar high and ensuring future stays...\n\n\nMore  \n\n\n", "\nWe stayed here for 7 nights in January 2016 and found it to be a good basic hotel in a great location in Waikiki. The rooms are a bit tired, could use some updating, but clean and well maintained and the bed was very comfortable which was important for us! We stayed on level 7 by the elevators which was...\n\n\nMore  \n\n\n", "\nWe have enjoyed another Hawaiian vacation and another pleasant stay at the Ohana Waikiki East Hotel. It has a lobby that feels homey and Hawaiian, friendly employees, restaurants nearby, bus and trolley service nearby. The location is perfect for everything and is just two blocks from the beach. We have recommended this hotel to friends and all were pleased with...\n\n\nMore  \n\n\n", "\nMy mother and my husband and I just returned from Honolulu coming from the Pro Bowl and we truly enjoyed our stay at the Ohana East. The service was top notch from the moment we pulled up and checked in. They always greeted us by our names which made us feel welcome. We have been staying at the Ohana every...\n\n\nMore  \n\n\n", "\nPleasantly surprised at the value this hotel offered. We received a nice big room on 17th floor with partial ocean view and great balcony all for the price of an average hotel room at our home in cold Texas. The staff were always very friendly and helpful.\n", "\nI stayed here the week of Mother's Day (May 9-15, 2015) this is a beautiful hotel, it is located in a very nice area. there are so many restaurants in the area, and walking distance to the beach. I enjoyed long walks on the beach. The staff is very friendly and accommodating. I will stay here again.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/08/07/0c/1b/ohana-waikiki-east-hotel.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "877", "title": "Grand Waikikian by Hilton Grand Vacations Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "1811 Ala Moana Blvd, Honolulu, Oahu, HI 96815", "review_list": ["\nIf you can, you need to stay here. If you can't stay, it's worth visiting. Walk around the Hawaiian village and shops. Our room wasn't ocean front... But ocean view. Loved the lobby area. Plenty of restaurants nearby, walking distance. If you need any last minute items, I recommend the ABC stores. Great alternative with gift items, food, drinks, toiletries...\n\n\nMore  \n\n\n", "\nAloha spirit lives here. Staff always helpful, not always knowledgeable but willing to find out. Parking is a little high $30/night valet only but public transportation of various types are available and most are just a slight walk away.\n", "\nGreat stay at the Hilton Hawaiian Village. Beautiful resort with many pools, lagoon and beaches. Room was comfortable and good size but disappointed with the view. Beach umbrellas very pricey at $60 for umbrella and to chairs so take your own. Good restaurant selection with a live band in the evening.\n", "\nWe always stay at the Grand Waikikian. We love visiting this resort. It has many wonderful amenities and it is very beautiful. The rooms are very nice and roomy unless you stay on the end. The 2 bedroom end units either have a beautiful ocean front view or a view of the city. The downside to these units is they...\n\n\nMore  \n\n\n", "\nhad an amazing week at the Hilton Grand Vacations resort in Honolulu Hawaii. Wonderful room and amenities, great location on the beach and only 2 miles from Diamond Head. the resort pools close early, many food and shopping options on site- although they need more \"local inspired\" food option in the Hilton Hawaiian village. overall 10/10!\n", "\n2 BR condo was nice but had a few maintenance issues, which they did fix pretty quickly. There were a few spots that could have used more cleaning but it wasn't terribly bad. Beds were OK but a little firm for my taste. Kitchen is small but did have almost everything we needed, except salt & pepper. Pools were nice,...\n\n\nMore  \n\n\n", "\nSecond time my family has stayed at the Waikikian. Had a two bedroom corner with two balcony's on the 12th floor. Great view. As an elite premier owner I have two complaints and they are the same two complaints I had 5 yrs ago when I stayed there. 1st, elite members should have a guaranteed checkout later than 10:00am. I...\n\n\nMore  \n\n\n", "\nThis property is of the same great standards of a HGVC developed property. The room was clean and very up to date. The staff was helpful and friendly. Even though the Hilton Hawaiian Village is a large complex, everything is accessible. My only wish is that they had a quiet bar for an evening drink. The bar by the beach...\n\n\nMore  \n\n\n", "\nWe stayed in a one bedroom plus suite room on the 19th floor. Fantastic city views and a partial view of the ocean. The suite was wonderful, nice wood floors, full kitchen, water/dryer, big tub, bedroom, etc. The lobby and area around the hotel is top notch, clean, and beautiful artwork. But the best part is the actual Hilton Hawaiian...\n\n\nMore  \n\n\n", "\nWe stayed at The Grand Waikian at Hilton and had a wonderful time. We came with our two small kids under 3 and loved everything about the stay here. The resort and the amenities and staff were just so wonderful. Highly recommend as a great place to relax.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/0c/97/a8/paradise-pool.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "578", "title": "Aston Waikiki Beachside Hotel, Hawaii/Honolulu", "rating_string": "3.5", "address": "2452 Kalakaua Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nThis hotel has an amazing view and location! The hotel staff keep trying until you're happy! Be sure and let them know if you need a room with a good air conditioner! Thanks Lave for all your help! The hotel manager (sorry I forgot your name!) kept working with us until we had a room that could handle my hot...\n\n\nMore  \n\n\n", "\nWe missed our flight home so had to stay another day in Honolulu (darn) so we booked this hotel last minute. Booked thru trip advisor, it was super easy and straight forward! We picked this hotel because it was right on Waikiki beach within walking distance to everything!(and the price was definitely right).\nWithout knowing what a crummy morning we'd...\n\n\nMore  \n\n\n", "\nVery good location.\nBut looks old building and small.\nYou will be uncomfortable if you rent a car because there is no valet.\nI stayed two nights with a ocean view room. I can't see the beautiful waikiki ocean due to a very big tree right in front of this hotel.\nBut... Very good location...\n", "\nI recently stayed at this hotel with my partner for just over a week. The hotel exceeded my expectations, and the staff are absolutely amazing. Lave, as well as all other staff went out of their way to make our stay enjoyable, and always used good honour and a happy nature to make us feel welcomed. Overall - An affordable...\n\n\nMore  \n\n\n", "\nRight in the middle of waikiki beach you can walk to shops beach the zoo easy to get public transport to all of honolulu i took a walk to diamond head one day will be staying there again for sure next trip highly recomended for budget travelers\n", "\nAston Waikiki Beachside Hotel is directly across from the beach. The hotel has no swimming pool, and no bell service. This is a 3 stars hotel, when we checked in we got upgrade to a bigger room (1 Queen Bed). The hotel is a little bit old, with Chinese décor in the room. Parking is at the sister hotel, and...\n\n\nMore  \n\n\n", "\nDo not stay here!\nWalked into the room and the toilet was broken, it was making a terrible loud screeching noise that was defining. Had to call down to have it fixed, and even then it made noises and ran water for about 10 minutes after flushed.\nThe air conditioner was extremely loud and difficult to sleep with.\nThe room...\n\n\nMore  \n\n\n", "\nU are right on the beach, u just have to cross the street. Also on the main shopping street if u are interested. Lots of places to eat nearby, and pick up for tours easy. Staff helpful.\nNegatives hotel is ageing although bathrooms seem to be modernized. Rooms small but comfortable. But no free wifi, really??? When u arrive if...\n\n\nMore  \n\n\n", "\nFirst and foremost - the location is 10/10. You want to be on the beachfront every morning? You've got it. But if you want free wifi and stellar views, this isn't it. Upon paying for our week and a half long stay, we unpacked only to find out there's no wifi. It comes at an extra charge of $35 -...\n\n\nMore  \n\n\n", "\nThis hotel was great! Although it isn't \"shiny & new\", it is in the perfect location, with 24-hour front desk. Staff is great, and hotel offers beach towels for daily use. Waikiki Beach and trolley stops are less than a block away, across the street. There is easy access in every direction. You can even walk to the Honolulu Zoo...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1601", "title": "Aqua Bamboo Waikiki Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2425 Kuhio Ave, Honolulu, Oahu, HI 96815", "review_list": ["\nWe were referred to the Aqua Bamboo by a B&B operator. We were hopeful our budget could afford a good 3 star hotel.(less than $200/nt). We had a small room with a kitchenette that was clean. We were 2 blocks from Waikiki beach and in the middle of all the action. The staff were young, helpful and tried hard and...\n\n\nMore  \n\n\n", "\nThis hotel is not overly clean, the bathroom is very outdated, and the continental breakfast was terrible. They have very limited parking and you will most likely be required to park in the ramp next door for $25 a night. It is close to downtown and Waikiki beach making it convenient for activities in the area. Traffic can be bad...\n\n\nMore  \n\n\n", "\nIf you're looking for reasonably priced, a few blocks from the beach and not terribly clean... this is your spot! The staff (depending on the day) was semi friendly. The noise from the surrounding streets (regardless of time of day or floor you're on) is annoying! I was surprised to learn they do not perform room service daily (meaning your...\n\n\nMore  \n\n\n", "\nWe were booked here for business travel and because I was unfamiliar with the hotel I was sceptical. I would describe this hotel more of a boutique style.\nBreakfast was fresh and good. Though small, it was reasonably priced and comfortable. Close to beach and shopping. Staff very friendly. We would recommend it.\n", "\nAll the streets are busy in Waikiki but once you are in your room, and especially if you have a room looking over the pool, you've found a quiet oasis. The courtyard was a quiet relaxing place to get away from the hustle of the city and you are just a couple of blocks from the main shopping street. You...\n\n\nMore  \n\n\n", "\nI make myself crazy attempting to find the 'perfect' hotel when I travel. I scour websites, read reviews, and altogether spend way too much time. I didn't want to spend too much, Waikiki can be uber expensive. Aqua Bamboo turned out to be perfect for my needs. I had a lovely studio that faced the inside courtyard, was very clean....\n\n\nMore  \n\n\n", "\nThe Aqua Bamboo is the ideal place on Oahu as a base for your Hawaii vacation. Located a short walk from Waikiki beach the Aqua Bamboo has all the amenities you could want and more. Our room had a stove top, microwave and refrigerator so we could avoid having to eat out for breakfast and many dinners. A grocery store...\n\n\nMore  \n\n\n", "\nWe thoroughly enjoyed our 8 night stay at the Aqua Bamboo for our honeymoon. We were upgraded to a partial ocean view room overlooking the courtyard. The room provided everything we needed (we got a kitchenette room) and was clean and tidy. The air conditioner was noisy but we didn't have it going at night. The staff were super helpful...\n\n\nMore  \n\n\n", "\nGot here Jan14/2016 and still here.The staff here go out of their way to help you,rooms are very clean.I would recomend this hotel to everybody.Its less than 3 minutes to beach,has a bus stop right in front.The pool area is very clean and very beautiful with all the plants and trees just perfect for relaxing and tanning with a pool...\n\n\nMore  \n\n\n", "\nWe stayed at this hotel for 8 nights in October. The location is superb, 2 minute walk to Waikiki beach without being right in the hustle and bustle. The room was well appointed with a separate bedroom and self contained kitchen which we used a lot. Only fault was the air conditioning was very loud but earplugs fixed that. Staff...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/05/7b/9c/54/pool-aqua-bamboo-and-spa-v331435.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "902", "title": "Aston Waikiki Beach Tower Resort, Hawaii/Honolulu", "rating_string": "4.5", "address": "2470 Kalakaua Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nJust finished a wonderful week stay here. The location is great, the room is great, and the people are great. We really appreciate how helpful, accommodating, and friendly all the staff are. We needed a late checkout and they were more than helpful even though it's a busy Saturday for them.\nThe condo is modern, fresh and nicely appointed. The...\n\n\nMore  \n\n\n", "\nWe stayed here January 25th for 6 nights with our 3 teenage children on the 15th floor. All the staff were super friendly and helpful right from the Manager to Mary and Amy. Anything that needed fixing in our room was immediate and followed up by a phone call to check all was ok... Very impressed with this service.. also...\n\n\nMore  \n\n\n", "\nStayed 4 nights in Jan '16 in #1904\nThis condo was nice. The view was great. Don't get a room any lower than this or your view will be partially blocked by the building in front. Access to the beach was good because it was right at a stop light so you could get right across.\nThe manager Byron was...\n\n\nMore  \n\n\n", "\nWe stayed on the 11th floor and it was fantastic the view was great.....we loved eating our breakfast out on the balcony watching the early morning surfers....the apartment suited our needs and the kitchen was well equipped including a jug when many other hotels only offer a coffee maker. We had a small issues with the tv and DVD player...\n\n\nMore  \n\n\n", "\nWe enjoyed the lanai and view as well as location. We rented property through captain cook so didn't have much interaction with hotel staff. Valet guys are nice. We did miss the Hawaiian feel as it lacks that it also doesn't have a restaurant or bar attached. It's more of a condo type environment. We stayed at the ilikai last...\n\n\nMore  \n\n\n", "\nRight from the entrance, what you'll see is a awesome view of waikiki beach. The hotel room we were in was facing towards the beach. Our room was big and very comfy, the service was very awesome. They took care of us. We stayed for 6 days and we never had a problem.\n", "\n2 br 2 ba partial oceanfront views, cross street from the beach, so close to everything, shopping, restaurants you name it, night life, oh my...I love it !! 😉 the kitchen it's complete with everything you need, the patio/balcony it's huge, we alway have breakfast in our balcony and hand out food from the kitchen window over looking the ocean....breathing....you...\n\n\nMore  \n\n\n", "\nThis hotel is in need of a make over, decor looks a little worn and 80's. Rooms are small and when we checked in we had to have house keeping come to the room to clean as there was a plate of literally half eaten food and spilt milk in the mini fridge. They were quick however to come and...\n\n\nMore  \n\n\n", "\nReservation process and manager communication were practically flawless. We rented an 18th floor condo with a great view of the ocean as advertised. Full kitchen was put to regular use. Accommodations were very comfortable for our family of five adults.\nVery convenient location in the bustle of Waikiki. Reserved parking stall was a big plus.\nProperty staff we encountered were...\n\n\nMore  \n\n\n", "\nStayed in September 2015 . A group of 4 retired old gals from Australia on a reunion trip returning from Alaska and Canada. Could not have been happier. Champagne and high quality chocs complimentary on arrival, Easy to use kitchen and the unit - a 2 bedroom - was sooo spacious.\nThe location was great. The service was very exceptional....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/73/6b/a1/suite-master-bedroom.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "549", "title": "Waikiki Prince Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2431 Prince Edward Street, Honolulu, Oahu, HI 96815", "review_list": ["\nThis hotel has no maid service except once during our week stay but I loved it. You don't have to worry about being gone so someone can clean your room. If you need clean towels, you just exchange them at the office. It is less than 2 blocks from the beach. It is a much older property but it is...\n\n\nMore  \n\n\n", "\nThe room is dated as others have stated but very adequate. So close to the beach and shopping. Great farmer's market at King's Village Mon Wed Fri Sat 4-9 bought chinese food for dinner. The Pantry grocery store is a few blocks away for groceries and ABC stores are everywhere. Car rental beside the hotel too. The staff are great...\n\n\nMore  \n\n\n", "\nWe stayed at the Waikiki prince for 10 nights when visiting Waikiki. It was everything we needed. Clean, comfortable room only 1 minutes walk to the beach and ideal location to shops and resturants, which were all in easy walking distance. It's not a luxury hotel, it's great for those who prefer to spend their money else where, like on...\n\n\nMore  \n\n\n", "\nNothing fancy, but a nice place to sleep only 2 blocks from the beach. Staff were friendly and while one had to do a few things that are normally done by staff (ie one had to take towels to the lobby for clean ones), the price/value was reasonable. Unit was clean and comfortable and the AC was adequate. If one...\n\n\nMore  \n\n\n", "\nJust stayed here for 14 nights and would be happy to stay again.The room was dated but very clean, Had kitchenette,great shower good a/c and very comfortable bed.The staff were very friendly and helpful .Location to beach,food and shops is ideal.There is an issue with noise early in the morning(trash trucks)that has been spoken about in other reviews of this...\n\n\nMore  \n\n\n", "\nI have stayed here four times. I lay over for a few days on my way to and from Australia.\nI have always had a good reception when I arrive, and super service from the staff, they are very helpful and can answer many questions you have. A printing service for your flight check in is available, and there are...\n\n\nMore  \n\n\n", "\nThey provide everything you need. Front desk is very friendly. If you are tight on budget, this is the best hotel for you. The location is so convenient and close to everything. ABC store is around corner. Bus stop is on the other side of street. 2 min walk to Waikiki beach. Free shows are there as well. It is...\n\n\nMore  \n\n\n", "\nOverall we enjoyed our stay in Waikiki Prince hotel. The room was very dated, but everything worked fine, and the kitchenette, while did not look a bit modern, was well equipped and useful. The room had the biggest number of power outlets we have ever seen in a hotel room, which was very convenient. Usually it is a challenge to...\n\n\nMore  \n\n\n", "\nLoved Loved Loved this hotel and the Waikiki area of Honolulu. Yes, it's old and not renovated, but it's clean and has everything you need. I stayed with my wife to run the Honolulu Marathon. You are 2 mins from Duke's statue/Waikiki Beach, you'll have delicious Kona coffee to drink on your cute little lanai, have kitchenette to use if...\n\n\nMore  \n\n\n", "\nA comfortable stay, Close to the beach, closer than many of the more expensive places. Our pre-booked room was ready before the stated check in time, so we were able to move right in. The balcony gets the morning sun, so by afternoon is shaded and would have a chance to cool in a hot season. Individual air conditioning unit...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2491", "title": "Waikiki Wave Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2299 Kuhio Avenue, Honolulu, Oahu, HI 96815 (Formerly Aqua Waikiki Wave)", "review_list": ["\nI was moved to this hotel because there was a plumbing issue at the hotel where I was scheduled to stay. The other hotel prepaid for the room. I called ahead to verify that I would be arriving after 8:30 pm. Not only was the front desk not expecting me they wished to charge me for a \"resort\" fee for...\n\n\nMore  \n\n\n", "\nThis hotel was very clean, very convenient, and an excellent value. It's not 5 star, but it doesn't claim to be. The beach, shopping, restaurants, entertainment, etc, are all within walking distance. If you are looking for a centralized hotel at a value price, this is the place for you.\n", "\nLocation is fantastic. Right in the heart of Downtown. Everything is easily accessible by foot, including the beach. Marukame Udon, a world-class, cafeteria-style Japanese restaurant, is right across the street!\nStaff, and in particular, Dee, was amazing. Highly competent and warm. She took an immediate interest in our group, going above and beyond in ensuring our comfort.\nWould recommend based...\n\n\nMore  \n\n\n", "\nThe location was just a short walk from the beach, and very close to the shopping area. The hotel itself was okay - the rooms were rather outdated, everything looked old and a little run down but was clean. The construction was also a little noisy, but generally we had a good stay.\n", "\nMyself and 4 friends stayed here in September.\nThe good.\nCheck in was super fast - the male check in staff were lovely and tried to make sure our rooms were close together.\nWe had one 3 queen bedroom room and a twin room. The 3 QB was really large and enough place for us the spread out - would...\n\n\nMore  \n\n\n", "\nWe stayed one night at this hotel before our cruise on Pride of America. Expected this to be an average hotel, and thats what it turned out to be. We had a corner suite, which was fairly large with 2 balconies. Everything in the room - from the mattress to the carpet and fixtures in the bathroom were quite tired....\n\n\nMore  \n\n\n", "\nThis was a clean pleasant hotel with a pleasant staff. It was within walking distance of everything in Waikiki. We could walk to the beach, restaurants and sites. Clean, quiet and family oriented. We enjoyed our stay and would recommend this Hotel to those who want to stay away from the crowding on the beach but want to be in...\n\n\nMore  \n\n\n", "\nThe location is good, close to the beginning and ending of the marathon (in case you are running it). The service was average, the room was OK for the price. There was a lot of noise because they where building another hotel or something in front. Most of the time the parking lot was full so you would have to...\n\n\nMore  \n\n\n", "\nI have recently stayed in this hotel for 6 days with my family. It is nicely located 5 to 10 minutes from Waikiki beach , Kalikaua St and Royal Hawaiian centre. And that is about all. The rooms and hallways are worn down, front desk staff is cold polite at best, sometimes frankly rude. My daughter returned toilette key to...\n\n\nMore  \n\n\n", "\nThere is much construction going on right next door and all around this property. It was very noisy. The room was outdated and run down. Not worth it at all for the price we paid. There was no parking and we had to park several blocks away and then wait forever for the parking attendants at the other hotel to...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/21/6f/53/aqua-waikiki-wave.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "328", "title": "Aqua Skyline at Island Colony Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "445 Seaside Ave, Waikiki Beach, Honolulu, Oahu, HI 96815 (Formerly Aqua Island Colony)", "review_list": ["\nOK It's not the Four Seasons but it is clean and comfortable in a great location with amazing views. I only stayed for one night but enjoyed my visit. The front desk staff is exceptionally friendly and helpful. The room is well appointed. Had I stayed longer than one night, I would have been perfectly comfortable there. The room has...\n\n\nMore  \n\n\n", "\nWonderful experience staying at the Aqua Skyline. The front desk staff were super helpful and friendly. They definitely exemplified the 'Aloha Spirit'.\nI loved the amenities offered by the hotel. They have an on-site convenience store, coin-operated laundry, small fitness gym, pool, jacuzzi, and sauna. There is also a bbq area on the pool deck for your use as well....\n\n\nMore  \n\n\n", "\nMy mom and I booked a four night stay in September. We arrived in the evening and found out we were upgraded to a 1 bedroom suite. We had a great view from the balcony off the bedroom and could see downtown Waikiki and the canal that runs behind the hotel. I loved the Mango hair and body products that...\n\n\nMore  \n\n\n", "\nWe thoroughly enjoyed our stay. Brian was great. Room was very clean and housekeeping was very efficient. Have stayed there many times and will definitely do so again. View of Ala Wai canal Cowan. Enjoyed watching outrigger canoes going down canal.\n", "\nIt was a last minute trip to come to Hawaii and my last experience with Holiday Inn resort was not pleasant. I decided I didn't want to spend that much money for 2 nights only.\nWent online and found decent review and price for this hotel and decided to book it. I was not expecting anything fancy or nice as...\n\n\nMore  \n\n\n", "\nSo from the 17-22, I was going to be in Honolulu visiting my boyfriend, and I wanted to try another place after previously staying at the Aqua Bamboo Waikiki. Once my flight came in I took a cab to the hotel, and I loved the lobby! It was open to outside, and my room was ready two hours early, so...\n\n\nMore  \n\n\n", "\nI want to start off by saying that out of the 10 staff i dealth with the 5 day length of our stay, 9 was really happy to help us, the type of people that seems like they love their job. I booked a 2 queen bed, on the high floor with panoramic ocean view i was told 36 floor...\n\n\nMore  \n\n\n", "\nStayed here a couple times. Most recently for my birthday and I must say we'll be coming back for as long as they'll keep taking us! Great hotel with great staff and a breath taking panoramic view of the mountains and ocean! Convinent store located with in the hotel and also great location in Waikiki! Five stars all the way!\n", "\nStayed her for a Birthday party in a one bedroom suite with an ocean view. The Suite was big and roomy with a full kitchen and huge lanai. The staff always seemed happy to help and even gave us a bottle of wine since we were celebrating a birthday. Will be back next year.\nMahalo Aqua Skyline!\n", "\nDecided to try someplace new this stay and I am glad I did! I am not one to drive on Oahu so needless to say the location is great for just putting on a pair of shoes and walking around Waikiki. Very nice staff, nice spacious and clean room. Enjoyed all of my four nights at the property. Definitely looking...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/06/11/8f/c1/studio--v2355547.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "292", "title": "Aqua Oasis Hotel, Hawaii/Honolulu", "rating_string": "4.5", "address": "320 Lewers Street, Honolulu, Oahu, HI 96815 (Formerly Aqua Waikiki Joy Hotel)", "review_list": ["\nWe were pleasantly surprised by the location of the hotel. Its proximity to the beach and the shopping center of Waikiki is an added benefit for people that are only staying in the city for a few nights. The staff we met were all friendly and accommodating - our cleaning lady Conchita was most helpful and our room was always...\n\n\nMore  \n\n\n", "\nGreat location. Clisr to the beach, shopping, places to eat, including an Irish Pub & the Moose with great Mai Tai's at a reasonable price & an early happy hour. Friendly & helpful staff, comfortable beds, roomy rooms, balcony with doors & screens, a contenental breakfast, comfortable hanging bamboo chairs & reasonable rates. The only negative was the odd shaped...\n\n\nMore  \n\n\n", "\nWe spent 8 nights at the Aqua Oasis. Overall, we had a great experience. All the staff we encountered were friendly and helpful. The location is great for walking to restaurants and shopping, especially further down Lewers street. Even the beach is within walking distance. The only disadvantage to the location is the lack of ocean view, in fact our...\n\n\nMore  \n\n\n", "\nAfter an overnight flight from Sydney it was wonderful to arrive at the hotel and after being greeted with a lovely smile, being told our room was ready long before the official check in time. Our room was facing Lewers St but traffic noise did not worry us for the 3 nights we stayed before joining a cruise. Room was...\n\n\nMore  \n\n\n", "\nthis is one of our favorite place to stay, as soon as you arrive you experience the very friendly warmth and the aloha spirit from the entire staff throughout you stay, the hotel is located in the middle of the Lewer Street between Kuhio and Kalakaua Ave, if you want to avoid the hustle and bustle and prefer a quieter...\n\n\nMore  \n\n\n", "\nGreat staff - Mike and all of the valet parking men were cheerful and helpful. Parking although is expensive $30/day, but much cheaper than the ticket we got parking on Ala Wai blvd. Watch out, if you find a place to park, it's probably street cleaning day! The front desk attendants - really helpful and nice. Internet connection was fast....\n\n\nMore  \n\n\n", "\nComing off a long flight with excitement to stay in a beautiful hotel prior to our cruise, but arrived to find that they had cancelled our reservation because \"a third party credit card had been denied.\" Overheard the same story going to other awaiting guests. We were \"upgraded\" by manager to get a room even though they were supposedly sold...\n\n\nMore  \n\n\n", "\nMy spouse and I had a warm and welcoming stay at Aqua Oasis. The room was very clean and was equipped with everything we could need, to include a comfy bed as well. The staff was friendly and helpful, Mr. Yasu specifically stood out and went the extra mile to help us out with our stay. He was very helpful...\n\n\nMore  \n\n\n", "\nThis a nice boutique hotel, the staff are friendly and helpful. The concierge was very knowledgable. Our room was large with a kitchenette, couch, desk and a good sized bathroom. At times the shower pressure was not the best. Walking distance to the shopping areas and the beach.\n", "\nAfter staying at the big \"Disneyland\" hotel down the street, it was a welcome relief to stay here for the last 2 nights of our trip. Clean rooms, nice balcony and great location! The staff was kind and attentive. Will definitely go back here!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/04/7c/94/hotel-room-2-double-beds.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "2883", "title": "Sheraton Princess Kaiulani Resort, Hawaii/Honolulu", "rating_string": "3.5", "address": "120 Kaiulani Avenue, Honolulu, Oahu, HI 96815", "review_list": ["\nThe wife and I stayed here for 7 wonderful nights. We had a pool view room and every evening we would sit out on our balcony and listen to the Hawaiian music being played by the pool side usually with an accompanying dancer. The room was one of the larger hotel rooms we have stayed in. The hallways outside the...\n\n\nMore  \n\n\n", "\nReally happy with the service we received during our 3 night stay. Large comfortable bed and excellent location. We had the buffet meal one evening which we would recommend. Would definitely stay again!\n", "\nThe staff was always friendly great beds and excellent staff. Anytime I go back I stay here. Better yet is the pool. It's outdoors and is on the ocean side what can be better than that. Location makes it great as well with all the restaurants and it sits in the heart of waikiki. Get up early and take a...\n\n\nMore  \n\n\n", "\nWe had a great 9 days in Hawaii staying at the Sheraton Princess Kaiulani we were on the 4th floor with pool view rooms.\nWith connecting room for our daughter and granddaughter the beds were good and the room clean every morning .\nClose to everything and not far to walk to beach or restaurants we would recommend this property...\n\n\nMore  \n\n\n", "\nStayed here twice before in 2012 and 2009 and will again this April. Fantastic location, rooms fine if a little outdated but we'll worth staying here. Cheesecake factory across road which is also a plus! Do they still have the free pineapple each day?\n", "\nStayed here for 6 nights, rooms are pretty average they look alright on the photos but they need new carpet and paint, the balcony area is poor and needs renovations also, the bed was comfy though it didnt have the usual split in the middle, the pool isnt anything special and the food downstairs at the bar is average also,...\n\n\nMore  \n\n\n", "\nI got to the hotel and found out I was up graded like before and the staff remembered me from the year before I had a great room facing Waikiki beach 26 fl the room was clean and very very comforble the hotel is in the hart of everything abc stores at the hotel the morning buffet had every thing...\n\n\nMore  \n\n\n", "\nI've stayed here 3 times. The rooms may need a little updating but the location and overall hotel is great otherwise. I love having the convenience of a parking station nextdoor though you do have to pay for that in resort fees. They do an amazing thanksgiving meal there.\n", "\nStayed for 8 nights at the beginning of Feb 16. This was our first trip to Hawaii and the US. We found that the room very well presented, clean and tidy. The hotel it self is old but well maintained. From our pool view room we could also see the ocean and palm trees at the beach. The hotel is...\n\n\nMore  \n\n\n", "\nWe have just returned from our 40th Visit to Honolulu. For the last 20 visits we have been staying at this magnificant Hotel - Sheraton Princess Kaiulani. The staff here are just so helpful - especially Alex in the Reservations department. As soon as we have booked our Flights we contact Alex and request our \"usual\" Room. In no time...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/07/7f/b8/a2/exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1064", "title": "Aqua Waikiki Pearl Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "415 Nahua Street, Honolulu, Oahu, HI 96815", "review_list": ["\nSo Tiki, Ape, Harry and the Maintanence and who fixed our sliding door are so friendly, helpful and make everything so easy. Great location. No fuss, no muss. Just nice place to stay. Twice I stayed here and I would stay again.\n", "\nThe hotel is ok. The hardware facilities is very common. However, front desk staffs are VERY friendly! We stayed here for 4 nights. The coverlets and quilts were clean and fine. On the first day we had a little bit disappointment, because there was no bulb and/or no function in 2 lights (there are total three lights in the room,...\n\n\nMore  \n\n\n", "\nHad a lovely stay at this hotel. The staff were very friendly and welcoming and it was easy to check in and out. The room was clean and spacious and services everyday.\nThe location was very central and close to everything. The hotel also has a shuttle that runs between all its other hotels to take you to Ala Moana...\n\n\nMore  \n\n\n", "\nThe hotel is basic but offers large rooms with two twin beds. It is a converted condominium. The window type aircon we had was noisy and needs to be replaced. There is a lot of construction near the hotel so expect noise during the day. There is no construction noise at night. The location is ok as it is close...\n\n\nMore  \n\n\n", "\nWe had booked 4 nights at the Aqua Wave and were moved here due to the refurbishment at Wave. We knew both were a relatively budget option for Waikiki, but the room was so disappointing we checked out after the first night. Yes the rooms are large as advertised but very poorly utilised, lots of empty space and gaps where...\n\n\nMore  \n\n\n", "\nWe stayed at this accommodation end of December 2015. The room was very low standard, old and bathroom very poor. Construction all around, woken up at 6am weekdays. Can hear people in the room next door. WiFi continually drops out. Hidden costs - When we arrived we were provided with a flyer advising that we had the following services available...\n\n\nMore  \n\n\n", "\nToo much construction all around Jan. 2016--the street, two hotel buildings behind and adjacent made it very noisy!! Check this before booking...Rooms large, good cleaning service, helpful staff at front desk. Street parking is difficult to find...beware of towing.\n", "\nWhile we didn't splurge on this hotel and the size of the room was generous it was disappointing for the money paid. The view was of a dingy street and there was construction taking place so that there was banging from early morning until early evening. We used the hotel as a base, so didn't spend much time there which...\n\n\nMore  \n\n\n", "\nThe only good thing about this hotel was its location to the beach and shops. Check in time was suppose to be 3pm however that was not the case and even by 4pm the staff behind the counter looked bewildered with a blank look to say, \"yes we are on the computer screen and booked in but not sure if...\n\n\nMore  \n\n\n", "\nThe rooms look nothing like the photos. The carpets are stained and dirty, the foldout bed was broken, the insinkerator doesn't work, one hotplate worked out of the two, the toilet got blocked, utensils not adequate for self contained unit, the furniture was from the 70,s, no maintenance done, check-in was later than 3pm, furniture on balcony is old and...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/08/f5/77/ee/aqua-waikiki-pearl-exterior.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1245", "title": "Waikiki Parc Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2233 Helumoa Road, Honolulu, Oahu, HI 96815-1962", "review_list": ["\nStayed here for 2 nights before heading to the Oahu North Shore. Opposite the beach, but no obvious access to the beach short of walking through the Sheraton loading dock. the room was pleasant enough, ocean view prime, but the bathroom is absolutely tiny. The balcony is small and balcony railing looked a tad precarious. Overlooked by the Sheraton opposite...\n\n\nMore  \n\n\n", "\nWe stayed at this hotel in January for two weeks. It was in the perfect location to access the beach, shops and restaurants. The staff were very friendly and accommodating. The restaurant was fantastic, especially for breakfast. Again the staff were wonderful. I would definitely recommend this hotel and I will be booking this place again.\n", "\nI stayed at the Waikiki Parc Hotel over Pro Bowl 2016 weekend. I must say, it was like being in Japan (it's no wonder there were a lot of Japanese tourists staying there). First off, the hotel was soooo clean and modern. Even though the lobby and rooms are a little on the small side, it was pleasant to look...\n\n\nMore  \n\n\n", "\nWow, I was first unhappy about paying $200/night for a room at this unknown name hotel.\nI am VERY VERY pleased. The front desk was very nice and let us choose our room, gave us a 50% off pass to their breakfast.\nPros\n- Excellent Room and View, totally worth $200/night\n- Very friendly service\n- Room has very fancy...\n\n\nMore  \n\n\n", "\nStayed here many times and have never been disappointed. Less than a block from Waikiki Beach - so easy for morning/evening ocean dips. Rooms with balcony and ocean views are always desirable. Shopping and dining options are all nearby and in easy walking distance.\n", "\nThe location of the hotel is perfect for enjoying all Waikiki has to offer. The rooms are very clean and quiet and the floor to ceiling wood blinds add charm and sophistication. The staff is the best I've experienced, they truly go \"above and beyond\" with a smile. This place has real aloha and it seeps into everything they offer.\n", "\nThis is a small hotel tucked into a tight corner but with a very respectable neighbor like the Halekulani, a five star property in a nice section of Waikiki. Nearby is the five star Trump hotel and a minute's walking distance to the well-known Roy's restaurant. If you are value-conscious, a 24-hour Denny's restaurant is just around the corner from...\n\n\nMore  \n\n\n", "\nAt last a hotel that realizes the difference between good and great is fantastic staff. This is an excellent place to stay in Waikiki with all services included in the room cost. The room we got was lovely and even though we were a little early, the helpful person at reception had a room available. The complimentary valet parking made...\n\n\nMore  \n\n\n", "\nI just checked into my first of 4 nights today and am already turned off by the service here. My husband and I are checking in for a friend's wedding and we unfortunately booked through Orbitz instead of with the discount code so we were unable to get the free parking. Understandable. However, I booked for \"a double room or...\n\n\nMore  \n\n\n", "\nWas so impressed with this hotel we will definitely be back..we arrived 8am and the brilliant lady at reception arranged a gorgeous room on a high level within 20 minutes...we were so surprised. Fantastic views it was magical..great location much nicer than the massive hotels that you find in Waikiki. They also let us have a late checkout of 1pm...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/bd/5d/32/waikiki-parc-hotel.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "277", "title": "Aqua Pacific Monarch Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2427 Kuhio Ave, Honolulu, Oahu, HI 96815 (Formerly Aston Pacific Monarch)", "review_list": ["\nThis is a great choice for anyone who's trying to have a budget conscious Hawaii vacation. The pool was usually quiet, and the views from the roof are fantastic. There's a large hospitality room with great views and space to read or watch movies. Our room was nice and cozy without being overly small, and the kitchen was well stocked....\n\n\nMore  \n\n\n", "\nIt is a condo building, so the rooms are more like small apartments. We booked a studio but were upgraded to a 1-br apartment on the 16th floor. The part-ocean view was enjoyable, rooms were clean and attended daily. Though the open balcony seemed a bit dangerous...\nThe interiour looks dated but - clean and cozy. It came with a...\n\n\nMore  \n\n\n", "\n2 blocks to the beach; 2 blocks to ABC storeS (a few!!); has a shuttle; pool on roof gets good sun and has excellent view of ocean; and view of what you can see of Diamond Head thru the tall nearby buildings. Kitchenette; dining table; small balcony. ONLY minor negative would be TV is not set up to be visible...\n\n\nMore  \n\n\n", "\nA friend and I (two females) stayed at the Aqua Pacific Monarch in a one Bedroom Ocean view in October. We loved the balcony overlooking the ocean and spent many an evening having a quite drink after a long day, looking over the city and surf. the shuttle bus was excellent (even if a little crowded at times) and the...\n\n\nMore  \n\n\n", "\nI love this hotel.. It may be very 80's but so are alot here, but its just a great location for everything. The studio suite is fantastic as it has your bed, table and chairs, kitchenette and a sofa that folds out to a bed. For a two week trip this has been fantastic as it give you room for...\n\n\nMore  \n\n\n", "\nWe stayed at the Aqua Pacific Monarch for 3 nights in October/November 2015. Check in/out was quick and easy with friendly staff. Although we arrived well before check in time our room was ready for us. The location is fantastic, only about a 3 minute walk from the beach, and everything you need (groceries, bus stop, restaurants, shops etc) is...\n\n\nMore  \n\n\n", "\nThe room was like a small apartment, with full kitchen, coffee maker, toaster, plates, pots, pans & utensils. Bedroom was its own room. Everything was clean and we could see the beach from our balcony two blocks away. Staff responded quickly to requests. I would go back there for sure! The pool is on the roof, and the hot tub...\n\n\nMore  \n\n\n", "\nThe Pros:\nLocation-one city block from beach.\nWalk to all restaurants and bars in Waikiki.\nThe check in staff was super friendly and all staff that we came in contact with said hello to us.\nHad a superb corner room with a great view looking south down the city block to Waikiki beach on one side and of the quaint...\n\n\nMore  \n\n\n", "\nI stayed in this hotel for 3 weeks, from early November until early December 2015. This hotel is mature and obviously undergone a relatively recent reno. The room was outstanding in terms of cleanliness – the kitchenette, fridge and associated area were immaculate (plenty of cutlery and etc. too). The lobby is small, and a snack bar is adjacent which...\n\n\nMore  \n\n\n", "\nWe stayed at the monarch Dec 19 to 29. We were very lucky to have stayed on the 31st floor with great Ocean views. The room was large and the full kitchen came in handy with breakfast and the odd dinner cooked. (The food pantry is just down the road.) All of the staff from front desk to housekeeping to...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/04/af/94/41/aston-pacific-monarch.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1034", "title": "Ramada Plaza Waikiki Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "1830 Ala Moana Boulevard, Honolulu, Oahu, HI 96815", "review_list": ["\nRoom was great clean and comfortable beds. Shower pressure was perfect. The only downfall was the location. After previously staying at the Ohana east hotel I preferred that location better as there is more nightlife. If you like the Ala Moana shopping centre think would be great for you as it is quite close. The great thing about this hotel...\n\n\nMore  \n\n\n", "\nOur flights have been cancelled and we stayed there for two nights at the last minute. We arrived at noon and the frontdesk charge us in advance the sum of the two daily and another filing fee. After all expenses paid, he said that we have to come back at 3PM to enter the hotel (???).\nAll we ask in...\n\n\nMore  \n\n\n", "\nConvenient location to restaurants, shops and beach. Clean and comfortable room. Good facilities and friendly helpful staff. A little traffic noise at night was the only negative, so a room away from the main road may help light sleepers.\n", "\nVery clean, pleasant staff, close to Waikiki Beach, close to food & shopping. Stayed 2 nights & beds were comfortable. Jazmine the Concierge was very sweet & helpful. She recommended restaurants that were terrific. Recommended some tasty local food also. Glad we listened to her.\n", "\nThis is the 3rd stay at this hotel, I like it. The staff are always pleasant and professional. The room, lobby and elevators are very clean. The only concern I had was that due to the room's location above the pool, the AC had a fragrance of chlorine. I'm sure that I could have gotten another room. But as I...\n\n\nMore  \n\n\n", "\nExcellent service and rooms!.Staff at the hotel could not do more for us.They were ever so willing to help out anytime, be it with hotel services or general information about busses or touring.\nThe hotel is ideally situated and has very easy access to the local busses. Great eateries around too and just a 20 min stroll to Alamona Shopping...\n\n\nMore  \n\n\n", "\nStayed here with a family of 4. Rooms were \"tidied\" daily although having room service knock on the door at 0800-0830 in the morning was a bit early. Majority of the staff were unapproachable and didn't appear friendly except for concierge staff who were very welcoming and extremely helpful. The pool area was very run down and kids ended up...\n\n\nMore  \n\n\n", "\nThough it is not in the busiest part of Waikiki, there are some small shops and some restaurants in walking distant, thus it is not too noisy and quite fit my preferance. Within 2 mins driving time, cross the river, you arrive the center of Waikiki.\n", "\nThe property itself is older and not quite as fancy as others, but my stay here was excellent! My fiance and I stayed in a room that had a balcony overlooking Ala Moana Blvd, and the city lights at night were beautiful. The room was a decent size and always clean. The staff was extremely friendly and welcoming the entire...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/07/e4/ad/4b/ramada-plaza-waikiki.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "803", "title": "Ilima Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "445 Nohonani St, Honolulu, Oahu, HI 96815", "review_list": ["\nA little dated but very clean. Reasonable prices, close to the beach and tons of shopping. STAFF are excellent to deal with. Very friendly and helpful. This hotel is on my list for a return next year for a longer visit.\n", "\nWe stayed here for three nights before heading to some other islands and really enjoyed ourselves. The place is super cool and retro, with massive clean rooms with balconies and nice views. Staff were very friendly, and the price was amongst the best in Waikiki, especially for us with the weakened Australian dollar. On top of that there is free...\n\n\nMore  \n\n\n", "\nStayed here for a week in December and thoroughly enjoyed it! The staff were so friendly, room was clean, solid wifi, lots of towels, activities in the lobby and they gave shell lei's as a parting gift. A very pleasant stay!\n", "\nThe Ilima Hotel is one of the few mid- priced hotels left in Waikiki! This was our first time staying at the Ilima and we were warmly greeted upon arrival. The rooms are quite spacious with a small kitchenette. The décor could use freshening up, but honestly, who is in their room long enough to worry about the décor. The...\n\n\nMore  \n\n\n", "\nWe stayed for 16 days in a high level one bedroom this christmas.\nThe premises and rooms might be a bit dated. However everything clean. Bed great.\nThe room had 2 ac quiet wall ac units.\nQuiet.\nKitchen helps save a lot.\nA couple of BBQs in the pool area would help.\nLocation not far from the beach.\nParking included,...\n\n\nMore  \n\n\n", "\nWe had a great stay at this hotel. We had a room with a mountain view on level 11 with a superb balcony. The rooms are very spacious and very clean. The hotel is a little tired however it's very clean and excellent value for money. All staff are excellent and went out of their way to make our stay...\n\n\nMore  \n\n\n", "\nThis hotel is one of the few left still owned by native Hawaiians. It is clean, comfortable, spacious, and offers free parking (which is unheard of in Waikiki). It's a bit no frills, but there is a kitchenette if you are there for a longer stay. There was a great balcony where we enjoyed our coffee in the morning. The...\n\n\nMore  \n\n\n", "\nMy family of four stayed here for 1 night. The location is fairly convenient, close to F&B establishments. There's nothing fancy about it, just the basics you will need. The room I stayed in came with a small kitchenette, with utensils provided. There was air-conditioning, and the beds were comfortable enough. The entire place did look a bit worn though....\n\n\nMore  \n\n\n", "\nLocation is great closer to the canal end and near the Pantry, they film parts of Hawaii 5o at the hotel next door which is value, nice mountain views and partial ocean view. Great verandahs, large rooms and cooking facilities.\nThere are also a lot of great restaurants close, Ross Dress for Less is just down the road and to...\n\n\nMore  \n\n\n", "\nThis is our 5th time to Waikiki and the 3rd time we have stayed at this hotel and I am sorry to say it is really starting to look a little tired now. Staff are excellent and courteous, the room was very spacious, neat and clean, and had two queen beds but the whole building really needs a refurbishment. It...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/23/3e/27/ilima-hotel.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "941", "title": "Waikiki Sand Villa Hotel, Hawaii/Honolulu", "rating_string": "3.5", "address": "2375 Ala Wai Boulevard, Honolulu, Oahu, HI 96815", "review_list": ["\nI was so excited to be in hawaii for our last trip before out baby comes. WORST hotel 1st impression of my life. First off we booked a queen room and ended up in a room with 2 double beds. Mind you i am very pregnant it was a very tight fit. Next the washroom was Filthy HAIRS and left...\n\n\nMore  \n\n\n", "\nWe stayed here for 11 nights & it fitted our holiday very well. It is very close to everything, the beach, shopping & restaurants & being those few blocks back (5 min walk) we liked being off the main track. The hotel backed on to the canal & the golf course so the views were pleasant from the balcony. We...\n\n\nMore  \n\n\n", "\nDo not expect too much. That`s a budget hotel, but clean and with friendly staff. The location is quite noisy, but rather close to the beach and the main attractions of Waikiki. For the breakfast you have to pay additionally, but it`s reasonable option. The food is tasty and in a pretty good choice. The price for a triple room...\n\n\nMore  \n\n\n", "\nSet a few minutes walk from Waikiki beach, it has a very hot jacuzzi and foot spa and lovely big swimming pool. Pool towels are provided. There is a bar near the pool area. You have to walk through the restaurant to get to the foot spa or the pool area though. The rooms are basic but we stayed in...\n\n\nMore  \n\n\n", "\nI stayed here for two nights, it's a very basic room but does have a mini fridge which was good and the WiFi was decent.\nMy biggest complaint would be that it's not sound proof at all. I could hear the neighbouring families but mostly it was the cars screeching up and down the road. I was on the 7th...\n\n\nMore  \n\n\n", "\nWaikiki sand villa hotel isn't the most modern or luxurious hotel in Waikiki but the rooms are clean and has everything that pretty much every other hotel in Waikiki has. The hotel has a sort of transit room where if you arrive early you can have a shower, freshen up and use the Internet. With the hotel having free wifi,...\n\n\nMore  \n\n\n", "\nRating is probably more of a 3.5. Definitely more of a \"budget\" hotel, but if you're planning on spending most of your time out of the hotel on the beach or sightseeing, it has everything you need.\nPros:\n- Location is only 2 1/2 blocks away from the wide stretch of public beach at Waikiki. Really can't beat that, unless...\n\n\nMore  \n\n\n", "\nWe stayed in Waikiki Sand Villa from December 2015 to January 6th 2016.\nWe had a fantastic stay! The Customer service was excellent and the hotel is literally a straight 5 minute walk to the beach.\nHowever, the hotel does need some TLC, the hallways to the rooms aren't great and doesn't give a good first impression in complete honesty....\n\n\nMore  \n\n\n", "\nWe stayed here with 4 of us: me, husband, 20yo and 14yo. The room was about what I expected, plain but very clean. There were 2 double beds and a couch bed. However, you couldn't fold out the couch bed. It had a small kitchen with everything except an oven. The location was perfect as it was very easy walking...\n\n\nMore  \n\n\n", "\nwe reached Honolulu after a grueling 25 hours of travel as we had a layover at Narita of 8 hours! we reached the hotel at 11, but were informed that the check in as at 3 only so we could wait in the hospitality room. That room was over crowded, not very clean and with no place to sit also!...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/ef/0f/2d/pool-side-suites.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "499", "title": "The Imperial Hawaii Resort at Waikiki Hotel, Honolulu", "rating_string": "3.5", "address": "205 Lewers St., Honolulu, Oahu, HI 96815", "review_list": ["\nI have had a time share at the Imperial for 30 years. It's my home away from home. Since the beach walk on Lewers has been completed it's a perfect location. Over the years there have been many improvements. The TV's have recently been upgraded and Wifi is in the rooms. It's nice to have a small kitchen. I really...\n\n\nMore  \n\n\n", "\nWe were there from Jan 30/2016 to Feb 06/2016. There were six of us staying in a one bedroom unit on the 20th floor. We had to move some furniture around to make space for the sofa bed and Murphy bed, no sweat! The room had a small balcony with partial Waikiki beach view, a good place to sit and...\n\n\nMore  \n\n\n", "\nWe have been coming to the Imperial for the last fifteen years. The staff is excellent and go out of their way to accommodate our every wish. The property is older and outdated which they are slowly renovating. The best thing they could do is update the uncomfortable furniture however it suits our basic needs as a timeshare. The owners...\n\n\nMore  \n\n\n", "\nWe had a great visit and loved walking every day to see the sea turtles and swim at the beach. The kitchenette was perfect for making breakfast and snacks. We also loved the ABC Store on the bottom floor! Great place to get snacks and necessities!\n", "\nThis resort was magnificent. The location was perfect. It was close to the beach, restaurants, and nightlife. There's lots of shopping and access to various tour locations. Imperial staff were great, friendly, funny, and professional especially the valets. The accommodations were superb. I used the hot tub and they used the pool. practically everyday! At night looking out from my...\n\n\nMore  \n\n\n", "\nThe room needed a complete overhaul - there was a cutout in the kitchen ceiling and the bedroom ceiling which had been nailed up but not finished taping of the drywall. So this was a first impression. Then we overlooked the air conditioning units which was by far very unappealing.\nThe master bedroom had two queen beds and the second...\n\n\nMore  \n\n\n", "\nVery clean but dated and needs reno. Fine for us as we were only in the room to sleep. Great location to beach, shopping and restaurants (but be sure to make reservations, very busy). Quiet ( we were on 21st floor) nice staff, very clean.\n", "\nThey staff is very professional and helpful. They amenities are superior And it is in a great location. ABC store downstairs and the kitchen is well equipped. Pool and sauna very fun for all. They also have a exercise room\n", "\nStayed at the Imperial for 11 days - location is great - I picked it because it was close enough to walk to the Honolulu Marathon start and it is also close to waikiki beach and the main shopping strip - ABC store on ground level is good for food shopping - room was large enough with a kitchenette and...\n\n\nMore  \n\n\n", "\nThe location of this resort was great. Just one block off the beach and very near shopping and restaurants. The staff was great and very helpful. The reason I would rate this location as average is because the rooms are very small with very outdated and uncomfortable furniture. In the bedroom we had to lift our suitcase onto the bed...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/06/fd/f6/9f/bdrm.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "829", "title": "Ohana Waikiki Malia Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "2211 Kuhio Ave, Honolulu, Oahu, HI 96815", "review_list": ["\nPROS: Nice location on Kuhio, near the cheap and good Murakame Udon. Local bus stops are around the corner and across the street. Pink Trolley is free, just show your hotel card key. Helpful staff, shout out to Kayo for entertaining my daughter who loves everything about Japan. Hiccup on the wifi during the first 2 days but after it...\n\n\nMore  \n\n\n", "\nThe Ohana Malia was a good choice for our two day stay in Oahu. The location is great. Easy walk to Waikiki Beach and dining. Clean rooms and friendly people. Very helpful They were able to arrange transportation to Pearl Harbor before we even arrived. The attached IHOP was a good option for breakfast. They even give you coupons for...\n\n\nMore  \n\n\n", "\nOur room was on the 18th floor, with an ocean view, excellent bed, clean, mini frig, daily paper, new beach towels, new elevators with a security card system, and a balcony to greet the morning sunrise or watch the fireworks on Friday night. However, the very BEST aspect of this hotel is the employees!!!!!!!\nShawn T, Roy, Troy, Peter, Victor...\n\n\nMore  \n\n\n", "\nIt's was our 5th time on Waikiki but first time we so disappointed. Hotel was very dirty. Dust on the wall, on AC unit , everywhere. Mold in bathroom, with terrible smell, ants on balcony. Elevator not working. Bed bugs , all my legs and arms was bites.\n", "\nComing from Canada with a weak currency, we were looking for an economic stay in Waikiki. I looked at travel websites for months and finally found a decent deal through their website on Cyber Monday.\nThe hotel is centrally located on Kuhio Avenue (landmark is the IHOP) and close to everything. Despite my dislike for resort fees, I was a...\n\n\nMore  \n\n\n", "\nIt's a nice hotel at Waikiki beach. Stayed there for 3 days from 9th January till 12th January. Got an ocean view , though little far but it was nice. Room we got was equipped with a little fridge and basic amenities but if we had microwave also then it would have been much better to heat up some food....\n\n\nMore  \n\n\n", "\nI really liked this hotel. It was close to everything and you could use your room key to ride the trolley around places close to Waikikki Beach. The front desk people were very helpful. I would definitely stay there again.\n", "\nI've stayed here a few times in the past and am always satisfied. Room 1623 had an ok view and was very quiet. The ac worked well and was quiet also. The staff was extremely courteous and efficient from check in to check out. All of our needs were met.\nPros: Easy parking, fast check in, courteous staff, quiet and...\n\n\nMore  \n\n\n", "\nStayed here during thanksgiving weekend and when checking in our room wasn't ready so was offered one of the family rooms in the old wing of the building, it may have been a little dated but I was impressed with the layout of the room. It has 2 singles in a L shape with tv as you enter and a...\n\n\nMore  \n\n\n", "\nI recently stayed in this hotel after a cruise around the Hawaiian Islands. My friend, who was celebrating her 80th birthday, and I arrived at the hotel at around 10am and were warmly greeted by Pam at reception. Even though check in was not until later that afternoon, Pam found us a room on the 18th floor - what a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/08/7e/2a/e6/ohana-waikiki-malia-hotel.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1073", "title": "DoubleTree by Hilton Alana - Waikiki Beach Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "1956 Ala Moana Boulevard, Honolulu, Oahu, HI 96815-1897", "review_list": ["\nI stayed twice at this hotel in the last few months on business-once in November and again in January. It is centrally located (but not on the beach and you can only glimpse the beach from the balcony if you're above the 10th floor or so.) Yes, it has the requisite cookies, but I'm not a fan of chocolate chip,...\n\n\nMore  \n\n\n", "\nI travel to O'ahu every other week for business and have stayed at multiple Waikiki locations. I refuse to stay any where else these days after experiencing what the double tree has to offer. They are professional, courteous and just honestly care about our experience to the island.\nThe hotel staff is top notch and always willing to help with...\n\n\nMore  \n\n\n", "\nThanks for the great stay. I like cookies! Note the parking priced did seem high from my point of view but I guess it was competitively priced compared to other hotels. Short walking distance from from all the places that were on and poppin.\n", "\nThis hotel is a hidden gem! It's located very conveniently to both Waikiki AND the Hawai'i Convention Center/Ala Moana Shopping Center. I LOVE staying here! The staff is friendly and SUPER helpful...and the beds are extremely comfortable.\n", "\nwhole 10th floor and our room very musty nasty smell. talked to front desk numerous time but were ignored finally just gave up.desk would never call you back.best part of hotel is small gym.we used honors points but should have used them elsewhere.\n", "\nThis hotel is perfectly located in Waikiki. The rooms are comfortably spacious and all have a little terrace with 2 chairs and a small table. I stayed in room 1004 and I must admit my only complaint was about the smell of the hallway. Although, it is not a spoiled meat or rotten fish smell it is a uniquely nauseating...\n\n\nMore  \n\n\n", "\nA Hilton Honors member, I arrived at 10PM to find that my room was \"not yet available.\" The hotel staff was apologetic and was kind enough to buy my dinner while I waited for my room to be cleaned. 45 minutes later I was handed a key to my room and ascended to find that I had been given the...\n\n\nMore  \n\n\n", "\nExcellent Hotel. The staff had a high level of professionalism. I would recommend this hotel to anyone. The Double Tree is within a short walk to the Hilton Resort, where you can use the Resort area as a Hilton member.\n", "\nIn Honolulu for business a few times to conduct leadership training based on my books and stayed at the DoubleTree. Walking distance of the beach and of the Ala Moana shopping center. Short taxi ride to the university and the East-West Center. Loved on arrival that they give you a warm cookie--better than a lei!\n", "\nI stayed here for six nights while here on business. The room was very nice except the bathroom is very small but way better than it use to be. The staff at this hotel was fantastic very helpful and I love the new text program they are doing. Just send a text if you need anything what a great idea....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/01/e3/8c/25/newly-renovated-standard.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "370", "title": "Ewa Hotel, Hawaii/Honolulu", "rating_string": "3.5", "address": "2555 Cartwright Road, Honolulu, Oahu, HI 96815", "review_list": ["\nPleasant stay, Rooms were clean, service was kind and helpful. Unfortunately Internet access was hopeless. Some amenities should be renovated, replaced for new ones. Location is perfect, just minutes away form Waikiki Beach.\n", "\nShort Version:\nThe Staff are amazing! Very helpful and friendly. Great location and price for waikiki strip.We were allowed to check in 4 hours early. However...\nThe hotel is in serious need of repair and TLC. The rest of my review will be about the negatives.\nLong Version:\nThis is not a 2 start hotel, it is a zero star....\n\n\nMore  \n\n\n", "\nWe couldn't be happier with our stay at the Ewa Hotel! We stayed for 14 nights at room 614, located right in front of the elevator and it had a partial view to the beach and to the hostel. The location, at just a block away from the beach, and near every bus, was great! It's also 2 blocks away...\n\n\nMore  \n\n\n", "\nIf I could give this place ZERO stars, I would. This was a terrible hotel.\nFirst, the pictures online are NOT what you get. This place was an absolute dump.\nTo summarize:\n- Good luck in the elevator, we were on the 7th floor and afraid it was going to break each day.\n- You end up paying a weird...\n\n\nMore  \n\n\n", "\nWe stayed here for 6 nights. The house cleaning did their job every night.\nOnly complaint is an unpleasant \"toilety\" smell throughout the room for the first couple of days.\nThe shuttle has an average wait time of 20-30 minutes. It is faster to take the public bus than to wait for the shuttle + wait for your turn to...\n\n\nMore  \n\n\n", "\nAmazing hotel with reasonably affordable rates and accommodations. The staff is very attentive, friendly, professional, and full of Aloha. I've been to many hotels in Waikiki and this one is on my list of favorites. Great location, friendly staff, and clean rooms.\n", "\nMy husband and I stayed in this hotel on Holiday. The room was clear and had street view. The room was with balcony. It was not small room, I liked it.\nSometime we have some problems with connection at WI-FI (it is free, but booking.com showed that it should were cost money), because hotel's routers have limit connections (we were...\n\n\nMore  \n\n\n", "\nThis is not a five star hotel for sure but it is in a good location and provided good value. Waikiki in December is not cheap and we needed more than one room so had to look carefully at value rather than 'looks'. Each room was a reasonable size but cleaning standards varied and the bathroom in each was quite...\n\n\nMore  \n\n\n", "\nWhen I booked this hotel was looking for the cheapest I could find at last minute because our flights had changed. Wasn,t expecting much but was surprised how spacious and clean the room was. It was only basic decor but was comfortably and offered all what we needed.Location wasnt too bad and there was a free shuttle to Ala Moana...\n\n\nMore  \n\n\n", "\nWe booked this hotel because we had about 8 hours until our flight and it has the best reviews of the budget hotels. It was actually very quiet and we enjoyed happy hour (of our own making with our trip leftovers) on the small lanai. The front desk clerk was great and let us in an hour prior to check...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/03/fd/15/13/ewa-hotel-waikiki-lobby.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "352", "title": "Hokulani Waikiki by Hilton Grand Vacations Hotel, Hawaii/Honolulu", "rating_string": "4.5", "address": "2181 Kalakaua Ave, Honolulu, Oahu, HI 96815", "review_list": ["\nI visited Hawaii for the first time in 30 years. Hawaii has greatly chinged! There are many famous stores along the streets. Generally speaking, prices were very high and we sometimes miss Japanese food. I would like to visit Hawaii again in the near future. Thank you.\n", "\nMy wife and I stayed four nights at the Hokulani to celebrate our 35th wedding anniversary. This is the newest addition to the collection of Hilton Towers in Waikiki. It’s on one of the most convenient streets on the west end of Waikiki. Coffee shops, pubs, restaurants, shopping areas, and the beach are but a few steps away from the...\n\n\nMore  \n\n\n", "\nThe hotel location is the best. Easy to do everything in waikiki. The hotel is quite new and the room and all facilities are very nice. We enjoyed a lot having a spa pool after a day of activities. The view from the roof pool/spa is also awesome.\n", "\nHokulani Waikiki has a good location. There are some shopping center, restaurant and coffee shop. And there are excellent staff, quick response and action. We had no trouble on our vacation. Room is very clean and modern style. We can live by using smart and casual goods, it's cool !\n", "\nMy husband and I went here. We really enjoyed the hotel. It is right in a strip of restaurants and little shops and very close to the beach. There is lots of action at night around here and the rooms are spacious and clean with their own balconies. There is a two element burner, microwave, fridge, freezer and sink. The...\n\n\nMore  \n\n\n", "\nThis is so good location to go anywhere by foot or by Torolley for shopping and sight seeing, also very closed to the beach. I strongly recommend to choose this hotel not only solo but friend, family and couples.\n", "\nWe stayed at this Hilton vacation hotel which had easy in and out valet parking, in room kitchen with stove fridge freezer and dishwasher. We swung by Costco our second day and stocked up on essentials so we could make most of our meals. The front desk staff and concierge were all fantastic and we would go back in a...\n\n\nMore  \n\n\n", "\nThe Hokulani by Hilton hotel is about half a mile from the other Hiltons in the \"Village\" complex. It seems to be completely soundproof, and has model accommodation with 1 bedroom suites. The bathrooms and the kitchenette are beautifully designed and maintained. I have no hesitation in recommending the Hokulani to the traveller who likes to sleep in a quiet...\n\n\nMore  \n\n\n", "\nThis is one of if not the nicest resorts in Honolulu. This trip was for my wife and teenage child and is was comfortable for all of us and providing entertainment and shopping from the minute you stepped outside of the building. Minutes to the beach. I would definitely recommend it to anyone.\n", "\nthis is a great location a few blocks from the beach in the center of the action. the valet guys gave us great recommendations! the accommodations were very nice! no problems encountered. the pool and cabana area was fantastic!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/08/14/da/4f/exterior.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "201", "title": "Aston at the Executive Centre Hotel, Hawaii/Honolulu", "rating_string": "4.0", "address": "1088 Bishop Street, Honolulu, Oahu, HI 96813 (Formerly ResortQuest at the Executive Centre Hotel)", "review_list": ["\nThe rooms were spacious, the view, especially at night was stunning. Decor was dated. However, I loved this place for the room and the view. Unfortunately it's in a deplorable location. We were there in late December. There was very little open at night in the area. Very difficult to find a restaurant, the one attached to the hotel but...\n\n\nMore  \n\n\n", "\nThe views were okay, we had both city and partial ocean. The bed was stiff, not as soft as I would have liked, there were only 3 pillows on the bed, and the jacuzzi tub only for 1 person. For $250/night, you would think that they had better/softer beds, more pillows (at least 4: 2 per person), and a bigger...\n\n\nMore  \n\n\n", "\nI was on the 30th floor with a beautiful view of both the mountains and ocean. The room was very expensive in comparison to some I had found in Waikiki, but I wanted the downtown location. The suites were spacious and felt like you were in a condo rather than a hotel - kitchen with fridge, living room, bathroom, closets,...\n\n\nMore  \n\n\n", "\nI was on the 14th floor and my friend on the 18th. Neither of us could see the ocean form the hotel. It's downtown so quiet on the weekend. Taxi from airport cost about $25. Staff really nice. Rooms are all different and some could use remodeling.\n", "\nA little utilitarian but still very nice. Central to downtown and very close to the NCL cruise ship berth. Very professional and helpful front desk people! Limited eateries on the week-end. Aloha towers has been converted to college dorms but Gordon Biersch survived and is within easy walking distance.\n", "\nROOM\nBeautiful and spacious. Much bigger than what you'll get at any hotel in Waikiki. The interior is a bit like a small apartment. My room had a large fridge, stove and oven. The bed was comfortable. Clean and modern decor. The cleaning ladies did a fantastic job every day. Things I found strange were that they only put three...\n\n\nMore  \n\n\n", "\nThe ratings on Tripadvisor are tough. Am I rating this against the likes of the Outrigger or Surfrider on the beach of Waikiki? If so, then 3 stars, otherwise can't complain for what it is and its purpose. This is where you want to stay when you have business downtown and want utility. For that, its great. From the outside...\n\n\nMore  \n\n\n", "\nIt's within walking distance or cab service to the Queens hospital for husband's surgery.\nFor his recuperation we felt at home with kitchenette & the tub/shower combination.\nKitchenette had plates, silverware, cups, big bowls, and frying pans. There is a stovetop, microwave, and mini icebox. Also there is a coffeemaker & kona coffee packets as well as sugar,creamers,Splenda, tea &...\n\n\nMore  \n\n\n", "\nNestled in downtown/Chinatown, this hotels location served well as a base for exploration on all shores over the last week. Nothing to fancy, and a hybrid building (residents, offices, and hotel combined), it was very nice to be able to walk to a plethora of restaurants and stores. In room Kitchen is nothing special but convenient for simple things like...\n\n\nMore  \n\n\n", "\nI received the privilege of staying at Aston at the Executive Centre Hotel on the 21st floor due to some relocation perks that my job provided. I'll start with the positives before going into the nitty gritty details. To paint a picture, I stayed in the suite that sported a spare bedroom in the living room, a kitchenette with a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/28/5d/15/aston-at-the-executive.jpg", "class": "3.0"}]
