[{"category": "spot", "review_count": "4614", "title": "Palm Springs Aerial Tramway, Palm Springs", "rating_string": "4.5", "address": "1 Tramway Rd, Palm Springs, CA 92262", "review_list": ["\nSpectacular views! Fun ride up 8000 ft.\nOnly problem is that the trails are not well marked. Snow covered much of the trails not a place for wheelchairs or those with trouble walking. Those that are handicapped can travel up and see the views but going into the woods has a steep hill to go down and then return back...\n\n\nMore  \n\n\n", "\nThe tram holds about 80 people and slowly ascends the side of the mountain. As it does the floor slowly turns so everyone can see the view. It sways slightly at different points along the way which adds a fun element of surprise. There is a restaurant at the top along with walkways and hiking trails. It's a great experience.\n", "\nA fun experience for everyone, kids included, up this mountain with great vistas. A different experience for many and a terrific Palm Springs memory.\nThe climatic and visual transitions are impressive. Take your camera and the entire family.\nThis is a \"Don't miss\" adventure.\n", "\nWe had a great time on our tramway ride. Spectacular views of the San Jacinto mountains and the snow up in the forest of pine trees. Quite a wait to get on the tram but definitely worth it.\n", "\nWe did the \"ride & Dine\" combo during the evening. Tram ride is EXCELLENT especially at night. The tram car slowly rotates giving you a 360' view as you ride. The meal included is OK, nothing special but was nice to do sitting in the dining room enjoying the view. There was snow on the ground and it was CHILLY...\n\n\nMore  \n\n\n", "\nGet in the tram and go form palms to pines (as they say). A great ride to the top of the mountain and to the park. It may be hot in the valley but there could well be snow at the top! At around 8200 feet you might feel the air is a bit thinner but the views are remarkable...\n\n\nMore  \n\n\n", "\nWe rode the tram up when it was 90 degrees--52 degrees on the mountain. We watched the films they play continuously, walked through the building and then set out on a hike. Walked to the top \"notches\" and what a view! The walking was moderate for the most part, challenging a bit occasionally because the snow had melted enough to...\n\n\nMore  \n\n\n", "\nViews and experience in the desert makes for a not so typical day! You literally go from sandy desert to alpine climate within minutes and the vistas are spectacular!\n", "\nIt's worth it just for the view from the top--snow and trees on the top of the mountain--the city and the desert below.\nWe had to wait for about an hour to get on board. The cars were packed, and we started up the mountain--marveling at what it must have been like to construct the towers. About halfway up, just...\n\n\nMore  \n\n\n", "\nWe decided to check out the aerial Tram while we were passing through Palm Springs, thinking it would be a quick 1 hour visit. We were wrong. Our 3 kids had a blast at the top- climbing rocks, hiking trails, etc - we couldn't get them to leave! And it was nice and warm at the top.\nThe aerial tram...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/0e/9d/b8/on-the-trail.jpg"}]
[{"category": "spot", "review_count": "583", "title": "San Jacinto Mountain, Palm Springs", "rating_string": "5.0", "address": "Mountain Station, Palm Springs, CA", "review_list": ["\nA few wonderful hours hiking. Views are spectacular. Broke walking sticks as there is snow on the trail\n", "\nAt the top of the tram you'll find this terrific, snow capped mountain. See the desert way below while you're tramping in the snow. Bring layers and a jacket if you have one; the temp variation can be as much as 50 degrees colder up top.\n", "\nThis mountain rocks! With hiking trails approaching from either the Tram (3.5 miles each way) or from Idylwild up the Devil's Slide approach (5.8 miles each way) there is a steep uphill trek awaiting you! Take plenty of water, sunscreen, and be prepared since the temperatures drop to freezing in a matter of hours. Getting a Wilderness Permit is not...\n\n\nMore  \n\n\n", "\nThis was a really cool excursion. We enjoyed taking the lift up to the top and exploring the area. It's easily accessible for anyone with mobility issues and bring a jacket cuz it gets chilly....but take the family and have a great day up taking in the wonderful views!\n", "\nWe were actually here a few summers ago, but I can't rate back that far. The summer weather was so hot and dry. We headed up the tram and it got cooler and cooler, then there was more and more vegetation. Finally, we stepped out on this beautiful mountain setting with forests and trails to hike. It was like finding...\n\n\nMore  \n\n\n", "\nWe decided to drive around San Jacinto and a pleasant drive it is. Plenty of interesting scenery to admire. We took hwy 74 out of the valley to 243 which went through Idylwild, a nice little town that we'd consider staying overnight in the future.. Remainder of the trip of 90 or so miles total took us to interstate 10...\n\n\nMore  \n\n\n", "\nHop off the tram and the wonderful San Jacinto Mountain awaits you. There's lovely trails that offer you a change to explore with relative ease, follow the tracks from notch to notch and prepare to have your breath taken away by the superb views.\n", "\nYou have to do this at least once! The tram ride is a quick 11 minutes and picks up elevation to get you to the top in no time at all. The construction of the aerial tram system is quite interesting. The first time I went I felt like I entered Narnia. I went from the desert floor to a...\n\n\nMore  \n\n\n", "\nI love the drive to the lookouts. And the views are breathtaking. Always a must see when I am in Palm Springs. Such a different perspective coming from the East Coast.\n", "\nThis is accessible via the Palm Springs Tram & is about 30 degrees cooler than at the bottom & 1' of snow today - many people are playing in the snow- well worth the money to get here\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/3f/fd/5e/san-jacinto-mountains.jpg"}]
[{"category": "spot", "review_count": "984", "title": "Palm Springs Air Museum, Palm Springs", "rating_string": "4.5", "address": "745 N Gene Autry Trail, Palm Springs, CA 92262", "review_list": ["\nLove going here... went a few weeks ago.. went once before when it first opened forever ago. Planes are amazing.. the old times with real knowledge of history and experiences a huge plus. Climbing in and out of the bombers was amazing. flight simulator is a nice touch.\n", "\nI expected a small museum but was pleasantly surprised once I got inside. Quite a few planes and static displays with videos. I didn't think we'd be here long but ended up spending several hours. Be sure to visit the library up stairs.\n", "\nYou would EXPECT a great museum in moneyed Palm Springs--but this museum exceeds even those expectations. The facility--the aircraft--all first class, and the docents have matched the level of the exhibits.\nYes, you CAN do it in three hours--but why not take longer and get your money's worth? If you stop to read the material--talk to the docents, and really...\n\n\nMore  \n\n\n", "\nRegardless of whether you know aerial war history, this museum will provide hours of enjoyment, learning, entertainment. Like many spots in Palm Springs, this site appears to benefit from volunteers who really add to the visitors experience. There are many planes to view, with history signs adjacent. There are several displays describing war history, statistics, and surprisingly simple but relevant...\n\n\nMore  \n\n\n", "\nOne of the finest collections of flyable vintage aircraft on the west coast. There is usually some special event every weekend. Be sure to check their website.\n", "\nIf you want spend some time around some classic airplanes, WWII bombers and fighters, this is a very good place to do so. Lots of other great memorabilia on display, also. Very helpful docents. Don't miss visiting here if you are an airplane buff.\n", "\nThis place is a must see. It's located at the PSP airport property. As you walk around take advantage of the knowledgeable and kind volunteers who are there to make your visit even more exciting!\n", "\nThe museum is located on the far side of the PSP airport. It has a collection of aircraft that spans WW II through current times (more or less). What makes this museum different is that many of the aircraft seem to be in flyable condition. They had a P-47 out while I was in town and it was a joy...\n\n\nMore  \n\n\n", "\nClimb inside anmint condition WWII bomber. The docents are all vets and eager to talk and teach. Much to see. Will give you a new understanding of what aircraft warfare was like.\n", "\nFor anyone who loves our aviation history in particular, this is a great way to touch the past. The presentation of the planes and their historical roles are well documented. The museum really makes history come alive. The airport there also had an old plane in flight ,Very informative and worthwhile for all ages.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/00/1b/8a/6a/nice-little-yellow-craft.jpg"}]
[{"category": "spot", "review_count": "696", "title": "Indian Canyons, Palm Springs", "rating_string": "4.5", "address": "38500 South Palm Canyon Drive, Palm Springs, CA 92264", "review_list": ["\nOn private indian land. Great place to learn history, culture, and ecology! Excellent hiking for all ages and abilities. Rangers are very knowledgable and friendly. The lead tours very frequently and really bring the history to life!\n", "\nThis is an amazing hike! So very pretty and awesome indigenous palm trees. A must do while in Palm Springs if you enjoy nature.\n", "\nWe were told that the canyon was really something to see. We were not disappointed! The various hiking trails and the groves of giant palm trees were breathtaking!\n", "\nThere is a choice of several hikes within the different canyons from easy up to more strenuous. We expected for the entrance fee of $ 9 to receive a good map with description of the hikes. But we only received an overall plan and a good hiking map at additional cost. We also recommend to use bathrooms before entering the...\n\n\nMore  \n\n\n", "\nThere are dozens of places to hike around the Coachella Valley, but this is the best. The trails lead up through canyons that have great palm stands along the way. Some trails are easy, while others are quite challenging, but a good trail map shows which are which. It costs a few bucks to get in, but it's really worth...\n\n\nMore  \n\n\n", "\nFirst of all I have to say that this place is great for hiking. Some trails are in the sun and can be quite draining, but other paths cross through oasis' and get to see a beautiful scenery pretty much the whole time. Found a Rosy Boa and was able to catch it and show it off to the fellow...\n\n\nMore  \n\n\n", "\nMy wife and I have been there several times both in February 2016 and 2015. There are many hikes to enjoy, both long and short, hilly and flat, exposed to the sun and tree covered. I would have two recommendations though- on busy days, there is a line-up in your car to pay the entrance fee- there is only one...\n\n\nMore  \n\n\n", "\nI visit this whenever I come here, and this time it was just as good as the last. I go for the gentle hiking in the desertscape. You an wander for hours, or find a nice area and just perch and look at the mountains. it combines the best of being in a a protected base camp atmosphere with mountans...\n\n\nMore  \n\n\n", "\nThere are various hikes here of various levels of difficulty. The Andreas canyon hike is a very easy loop of just over one mile suitable for everybody. It passes through an oasis with water, palm trees and wild life. The Murray canyon hike connects with the Seven Sisters one. This is a more difficult hike - I say medium -...\n\n\nMore  \n\n\n", "\nHiked a couple of trails here then had to leave because the park closed at 5pm. Ranger told us we had to be out by 5 so we made the best of it since we already hiked around Joshua tree earlier. Indian canyons is an easy find right outside of Palm Springs and the hikes were easy and beautiful.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/ee/c4/54/view-from-the-trail.jpg"}]
[{"category": "spot", "review_count": "855", "title": "Palm Springs Art Museum, Palm Springs", "rating_string": "4.5", "address": "101 Museum Drive, Palm Springs, CA 92262", "review_list": ["\nWhat a great surprise to find this impressive museum in the desert in a relatively small community! What a remarkable reflection of the kinds of people living in Palm Springs. Obviously the people of Palm Springs care about the arts.\nThe building is beautifully done and the collection a delightful surprise. Be sure to shop in the gift shop to...\n\n\nMore  \n\n\n", "\nMy friends got married here and it was perfect. This art museum was an amazing backdrop for my friends who are both artists.\n", "\nIf you like modern (not contemporary) art, you'll love the museum. It has a wonderful permanent collection as well as visiting shows. The PSAM has two additional locations: an Architecture and Design center in downtown Palm Springs, and another site with a sculpture garden in Palm Desert (20 min drive from Palm Springs). All are well worth a visit.\n", "\nThe Palm Springs art museum is an accessible, open space that houses a nice collection. Easily tour-able in one morning or afternoon, yet immersive enough to impress, it's a must see when in Palm Springs!\n", "\nOne of the best art museums in America, World class art collection with emphasis on Western Art of Native people and Americans. Palm Springs legend George Montgomery's art and furniture are displayed, as well as his extensive private collection. Rotating special shows feature artists or collectors. Great Henry Moore sculpture featured in current show. Easy abundant parking and proximity to...\n\n\nMore  \n\n\n", "\nWe visited on Thursday on our way to the street fair. A very large facility that capably provides space for collections. Recommended by front desk volunteer we started on 3rd floor and worked our way down to 1st. Sculpture, glass work, paintings. We particularly enjoyed the 3rd floor collections with the variety of medium and pieces. The wiener collection of...\n\n\nMore  \n\n\n", "\nAlways changing, go on Thursday & then stay for Village Fest on N. Palm Canyon Drive 2 blocks east. Make sure to take the docent tour at 5PM\n", "\nWe were very pleasantly surprised by how excellent this small museum is!! World class artists (you'll know the names) and beautifully laid out. Highly recommend this museum if you are an art lover. We have been to many of the great ones in the world and really loved this one. Don't miss it!!\n", "\nThis is a very special gallery...AKA Museum. Truly spectacular and Thursday's between 4-8 pm, it's FREE, although you can also make a free-will offering. The displays are well done...the building itself set into a mountain side...is awesome. This is a special art shrine. Worthy of a visit when in the Palm Springs area. Friendly and helpful knowledgable staff and volunteers....\n\n\nMore  \n\n\n", "\nI have been to this museum three times and have not tired of it yet. It is well curated, with some really good exhibits. Love the contemporary sections - they have Picasso, Rodin, Henry Moore, Anish Kapoor, Andy Worhol to name a few. Good glass exhibit too. Having said that I noticed new things since I was there last so...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/05/6f/4b/eb/palm-springs-art-museum.jpg"}]
[{"category": "spot", "review_count": "315", "title": "Coachella Valley Preserve, Palm Springs", "rating_string": "4.5", "address": "Ramon Road to Thousand Palms Canyon Road, Palm Springs, CA", "review_list": ["\nWe really enjoyed this hike, short and not at all challenging, some stairs, bridges through the swampy areas, a fair amount of loose sand in the flat areas between the wetlands. The pond was very nice and peaceful, fish and birds. Bring a picnic lunch, it would also be very nice early in the morning. Picnic tables, garbage cans, benches,...\n\n\nMore  \n\n\n", "\nI'd never been to an 'oasis.' You watch desert style movies and the Arabian horsemen always ride into an oasis. This is the real thing. It's an short drive north of I-10. Parking can be difficult so plan to go early. Parking is better in the afternoon but it's hot then. We took the hike out to the pond, just...\n\n\nMore  \n\n\n", "\nWe happened on this Oasis and feel so blessed to have found it. What a treasure. On the San Andreas fault, it provides a short hike to a Palm Oasis (McCallum Pond) that will completely delight. Bring your camera, sunscreenand water. Wear good shoes because you'll be walking through the sandy desert. It's an easy hike, about two miles round...\n\n\nMore  \n\n\n", "\nLovely natural area only minutes from Palm Desert and Rancho Mirage. Water seeps to surface of desert thanks to San Andreas Fault, creating a true oasis. Towering palms and shimmering ponds. Plenty of shade, but be prepared to walk for a mile or two to take it all in. Recommend early morning visit to avoid high temps, larger crowds.\n", "\nGet there early in the morning to avoid the hot sun and to get parking by the visitor center. While there are several trails you can take, the one to McCallum pond is the most popular leading you to a small palm oasis with water and great photo opportunities. While the hike out there is only 2 miles round trip,...\n\n\nMore  \n\n\n", "\nWe went on a weekday in February, and it wasn't easy to get a parking spot in the small lot. A volunteer approached us and offered information and a map of the trails. We did the McCallum Pond two mile loop trail which was very easy and suitable for all abilities. Most of it was in the sun, but there...\n\n\nMore  \n\n\n", "\nThis is a beautiful Place to see and is being supported by donations. Well worth the few miles out of the city :-)\n", "\nMy wife and I hiked in the Oasis in Feb, 2016. Trails are well marked, and plasticized maps are given to everyone ( never saw that before anywhere in our world travels!). The trails we took ( McCallum Trail/Moon Trail) are sand covered, and the Oasis with the many palms is really an extraordinary sight. The hospitality in the Visitors...\n\n\nMore  \n\n\n", "\nThis preserve presents a look at an amazing desert ecosystem just a short drive from Palm Desert. The short trail near the visitor center takes you through a huge grove of native palm trees clustered around a spring and is suitable for just about anyone - it's hard to believe you're in a desert. We also took the hike to...\n\n\nMore  \n\n\n", "\nBeautiful place to see. Doesn't take alot of time away from you. Very easy walk to the oasis. Some parts in giant palm then in open desert (hot). At the oasis, cool breeze with some benches to sit in the shade with a cool breeze cooling you down.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/40/b6/30/1000-palms-nature-preserve.jpg"}]
[{"category": "spot", "review_count": "405", "title": "Agua Caliente Indian Canyons, Palm Springs", "rating_string": "4.5", "address": "S Palm Canyon Dr, Palm Springs, CA", "review_list": ["\nThis historic site was long occupied by the Cahuilla Indians for centuries. Remnants found go back to over 1,000 years. The dependable flow of water, Date Palms, and wild life made living here possible. There are multiple trails that course through the canyons. The easiest loop with a fabulous view is the Victor trail, should take about an hour and...\n\n\nMore  \n\n\n", "\nThis is a very interesting place to hike with the \"skirted\" palm trees, nice stream and interesting carved rock formations. But be very careful. A friend was hiking here last year, got off the trail and was lost for a while. Luckily she was able to get a cell signal and had to call search and rescue.\n", "\nLoved hiking through these monumental ancient palms and huge rock formations. Unlike anything I had seen before. Worth visiting to see the original Palm Springs from thousands of years ago.\n", "\nThis park/reserve is pretty expensive to get into at $9 per adult. It's worth it though. Its beautifully maintained and very clean.\nGo and plan on spending at least 2-3 hours. Not stroller accessible.\nCheck out the hummingbird feeder behind the trading post for lots of birdie action.\n", "\nA great hike. Lots of variety and beautiful oasis at the end. We had to cross a stream which was a it if a challenge but manageable. Would definitely recommend the hike for the average hiker. Not strenuous but need to be fairly fit.\n", "\nTook a hike on a beautiful winter day...in Shorts. Love the weather here and the hike. Great conversation and excerise.\n", "\nJust a short ride from Palm Springs. There are some hikes around the area. Beautiful palm trees and a meandering stream down in the canyon. A nice place to go on a hot day as its cool down in the canyon.\n", "\nWith three canyons to explore and dozens of hikes to choose from, this is one thing not to be missed in Palm Springs. A ten minute drive from downtown and a $9 entry fee gets you access to the palm oasis, gorgeous hikes, and beautiful landscape. Even 6.5 months pregnant, we especially liked the Victor Hike - about 3 miles...\n\n\nMore  \n\n\n", "\nWe had to pay $5.00 to get in the Canyon. It was worth it. The Indian Canyon is a easy hike next to a beautiful creek with natural vegetation and cactus. It is one of the few places left that is still natural in the desert.\n", "\nThere are two parts to this hike. The shorter one is a great view of palms and rock, cacti, and other vegetation. The second one at the Traders Cabin can be longer or a short hike down to the water. Both are great.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/00/12/94/3c/agua-caliente-indian.jpg"}]
[{"category": "spot", "review_count": "838", "title": "VillageFest, Palm Springs", "rating_string": "4.0", "address": "Palm Canyon Drive between Baristo and Amado, Downtown, Palm Springs, CA", "review_list": ["\nEvery Thursday the main downtown street is closed to cars and local artisians set up shop. Lot's to see, fun things to buy, great people watching\n", "\nFun activity that starts about 6pm on Thursday nights. There is a free shuttle that will pick you up and drop you off until late at night at various stops around town. Lots of vendors with a variety of wares. TONS of food vendors. Make sure to watch the spray paint artist, Arturo, in action. We were here once years...\n\n\nMore  \n\n\n", "\nA classic way to spend a lovely Thursday evening in downtown Palm Springs. There is always something new to see.\n", "\nVillagefest is a must if you are in Palm Springs any Thursday night. The vendors have a variety of food, art, crafts and fresh fruits and vegetables as well. The restaurants along the blocks are open and filled with guests. Lot of fun!\n", "\nBlocks after block of street vendors with food, fresh vegetables, candy, art, crafts and more.\nPeople of all ages walk in every direction enjoying the samples, food, the things that are for sale and the atmosphere of an outdoor street market event.\n", "\nWe enjoyed walking thru downtown and seeing all the venders and all their wares.. Very different. We bought silver rings that were unusual.\n", "\nIf you don't mind crowds and do like all sorts of vendors including many artists, then this one is for you. Hours are 6pm to 10pm every Thursday downtown from October through May. Parking can be an issue. We tried to get parking at Palm Springs downtown covered parking garage, which has unlimited parking and is free, but is was...\n\n\nMore  \n\n\n", "\nA fun time. Good vendors, good food. But the people that insist on bringing their dogs on those leashes that let them stretch out 15 feet or more makes it difficult. At least keep your dog under your control and close to your side. You may love your dog, but not all of us do. I leave mine at home....\n\n\nMore  \n\n\n", "\nThen there are the inconsiderate people who have to bring their doggies to the event .... seems they do not think about others who have allergies to animals, children who are not comfortable with dogs in their faces or how their leashes obstruct merely walking up to the many vendor booths.\nMany talented artists selling their creations of all kinds...\n\n\nMore  \n\n\n", "\nMany interesting foods, crafts and art on offer. Throngs of people trying to make their way through, got quite crowded. I would plan to have your dinner here.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/f0/f3/8a/villagefest.jpg"}]
[{"category": "spot", "review_count": "378", "title": "Palm Canyon Drive, Palm Springs", "rating_string": "4.5", "address": "Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nIt's nice to take a walk and browse the many interesting shops ranging from high end to just tee shirts. When hunger sets in, there are lots of choices, from fast food to sit down restaurants, with indoor and outdoor seating. There's also many places to grab a quick snack.\n", "\nThis is a long stretch of road that goes through Palm Springs CA as well as other towns. Once outside the town of Palm Springs, it changes to highway 111. This stretch of road is the location of the downtown area of Palm Springs.Once out of the downtown section, it turns into a business section of hotels, restaurants, strip malls,...\n\n\nMore  \n\n\n", "\nWe love the shops walking restaurants - easy walking\nand sitting outside to have coffee or eating and watching the people go by\n", "\nThis is the main street for shops. If you enjoy a walk there are a large variety of shops and eating establishments.\n", "\nHave spent many a day and night on this iconic drive. So many choices for food, beverage, entertainment and shopping. I love coming here and will hopefully retire somewhere close by.\n", "\nThis place reminds me of Santa Barbara. There are tons of shops and restaurants, and lot of people on the street walking around. The place seemed very safe to walk around at night as well. There are couple of large constructions going on, and the place will be even better once the construction's complete.\n", "\nI love Palm Springs so much that I would be happy to move there. I get a thrill being on Palm Canyon Drive. One of the most beautiful places in the world to be is Palm Springs.\n", "\nTake a stroll up and down both sides of the street--enjoy the vast retail and plentiful eateries. GREAT!\n", "\nPalm Canyon Drive (also known as HWY 111) is the main thoroughfare through Downtown Palm Springs. This is the epicenter of tourism in Palm Springs, as many hotels are located there, along with a wide array of restaurants for all budgets, bars & nightclubs, souvenir shops, ice cream stores, coffee houses & clothing boutiques.\nTourists strolling down this thoroughfare can...\n\n\nMore  \n\n\n", "\nThis area is so good for walking day or night - there's always something going on. Their Thursday evening market is really excellent with more quality stalls than junk. The shops are fun to wander in and out of and there are plenty of restaurants, cafe's and snack places so you can sit and people watch. Some of the best...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/7e/06/8f/palm-canyon-drive.jpg"}]
[{"category": "spot", "review_count": "331", "title": "Tahquitz Canyon, Palm Springs", "rating_string": "4.5", "address": "500 West Mesquite, Palm Springs, CA 92262", "review_list": ["\nthis was a handy morning trip. Pricey for what it was, but I think it's privately owned. It's just a waterfall at the end of a one mile trail.\n", "\nWe loved our hike to the waterfall at the top of the canyon. There are many steps (some high) but with a hiking or walking stick (which they provide for visitors' use) it's a really doable trail. We happened to meet up with the ranger-led group and learned lots of interesting information and were treated to great stories. All the...\n\n\nMore  \n\n\n", "\nInteresting canyon with stream and waterfalls, Used to be a hippie hideout until cleaned out by the Native Am tribe who regulate and protect this wonder. Go on the hike with a guide for a more complete experience. We were picnicking when a nearby group played soothing pan-flute meditative music. Record some tribal music for yourself and play it during...\n\n\nMore  \n\n\n", "\nThe Ranger was extremely informative and it is worth the crowd. Second time here and it is worth it for sure. Start early morning to avoid the heat\n", "\nQuite a busy stop, although there were times we were on our own just stopping and gazing at the beautiful surroundings. It took us a couple of hours to walk the route, but this was at a very leisurely pace! Well worth the visit.\n", "\nThanks to our very knowledgeable ranger who knew so much about this canyon, the history, the Native use of the land, the mountain goats, even the famous people who spent time there. The waterfalls are a very great treat!\n", "\nI love hiking here when I only have less then two hours to spend. Gorgeous canyons, a seasonal waterfall and streams and heavenly quiet! One of my favorite parts of Palm Springs and very close to downtown, although you'd never know it! An antidote to partying!\n", "\nThis is a wonderful way to spend a few hours if you are in the Palm Springs area. You start out at the visitor center and there is a modest fee to enter the indian reservation. The trail is well marked and not too challenging. From the visitor center parking lot there is a wonderful vista of the valley floor....\n\n\nMore  \n\n\n", "\nThis is a relatively short hike that has some steps up and down, but is an easy to moderate trail. There are some beautiful rock formations and the waterfall at the end of the loop is worth the walk. There is a fee for the hike.\n", "\nThis is an easy about 2 mile round trip hike to a 60 foot waterfall.There are lots of steps with an elevation change of about 350 feet. Beautiful rocks provide places to rest for those who need it. There is a $12.50 fee.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/7d/c2/04/wow.jpg"}]
[{"category": "spot", "review_count": "161", "title": "Palm Canyon, Palm Springs", "rating_string": "4.5", "address": "Palm Springs, CA", "review_list": ["\nDefinitely put this place down on your list to visit! Bring a camera too! The fan palm trees are crazy amazing, especially if your unfamiliar with a desert oasis scenery. Check the weather because it gets hot! If it's going to be on the hot side that day I'd recommend wearing cool clothing like something light, airy, or sleeveless, and...\n\n\nMore  \n\n\n", "\nCanyon of the palms is truly unique. We did a 5-mile hike and LOVED the uniqueness of the palm tree forest. The palm trees provide much needed shelter from the baking sun. Our camelback backpacks were a huge help. Super unique terrain. Highly recommended as a great 2-3 hour hiking adventure in Palm Springs.\n", "\nI thought the park was gorgeous with a lot of choices for hikers. The views were beautiful and the hiking trails challenging. Good value but bring water for sure\n", "\nWe chose the Palm Canyon Trail, a moderate 6 mile round trip, to the Stone Pools. We had a late morning start which allowed us to have our lunch at the \"Stone Pools\". The hike wanders through the canyon floor lined with Palm trees and then ascends up through a variety of cactus and amazing vistas of Palm Springs and...\n\n\nMore  \n\n\n", "\nOur visit to Palm Canyon was an unexpected surprise! We had no idea that we would encounter the beauty that this destination boasts!\n", "\nThe palm trees are I credible and you are on an Indian reservation. Military entrance is free. There is an Indian gift shop with original Indian souvenirs. Take w all in all themparks and take a picnic. Dogs are forbidden.\n", "\nWe drove to Palm Canyon on a Monday and paid the $9 per person just to enter the site. We were looking forward to taking one of the ranger led hikes described here and in their literature. Once we arrived at the trailhead we found out that the Rangers only lead hikes on weekends. We went ahead and did several...\n\n\nMore  \n\n\n", "\nWe hiked Palm Canyon in January 2016. We chose the Victor Trail, which was a moderate hike of about 4 miles. The trailhead begins to the left of the Trading Post, where you can purchase souvenirs, snacks, books about Native Americans and the desert, and, most importantly WATER. The clerks in the store are Native and very knowledgable about their...\n\n\nMore  \n\n\n", "\nWe enjoyed and after short hike in the canyon. It was shaded which was nice. The Palm trees fronds go all the way to the ground and are huge. There was a restroom,souvenior shop and snack shop.\n", "\nIf you like hiking in spectacular scenery..this is perfect for you. You need a car to get to the Canyon and there is a fee to access the area...but it's minimal. Take your camera. Hikes can be as long or short as you want. If the weather is hot take bottled water for sure.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/61/e6/db/palm-springs-rock-formations.jpg"}]
[{"category": "spot", "review_count": "120", "title": "Indian Canyons Hiking Trails, Palm Springs", "rating_string": "4.5", "address": "S.Palm Canyon Drive, Palm Springs, CA", "review_list": ["\nWhen we drive down Highway 111, commonly knows as East Palm Canyon we see cars parked near the trail, lots of hickers. These trails are very popular and challenging. Rewarding if you're in good physical condition. Better to enjoy the trail during the cooler months. Bring lots of water and a charged-up cell phone just in case. Try this trail,...\n\n\nMore  \n\n\n", "\nThe trails vary.. Waterfalls, shaded Palms and vista views. Get started early if you want to do the whole Palm Canyon trail. Rangers were extremely nice and informative. Steered me away from doing to long of a hike at 1 in the afternoon and sought out other options for my safety. Great place and so close to down town Palm...\n\n\nMore  \n\n\n", "\nSun and shade and natural beauty make these hilking trail a do not miss. Beautiful natural waterfall and springs, multiple hiking trails for the novice and the experience hiking lovers with sun and shaded routes to choose from.\n", "\nWe took scooters out to the canyons and then hiked once we arrived. It was really pretty! Nice vegetation and interesting history.\n", "\nWow, hiking was the best. Well marked trails. Map was easy to follow. The view at the top was spectacular. We hiked for three hours and covered 5 miles of trails.\n", "\nWe traversed several trails. Each had it's own character. It is easy to spend a day hiking here. The trails are very clearly marked and no need to fret about getting lost.\n", "\nGreat place to hike. This particular trail is relativly easy and is very doable with younger children.\n", "\nHiked into Palm canyon. Loved the stands of native palms! In the desert I did not expect such a nice, quiet and shady spot!\n", "\nThere are well maintained and interesting trails for all levels of hikers available here and the entrance fee of $9.00 is well worth it! The many oases scattered through these canyons are fascinating, as are the many types of palm and ferns. We saw many birds flitting around plants and water. The Agua Caliente Indians (whose land these trails are...\n\n\nMore  \n\n\n", "\nOn a recent trip to the Palm Springs area, we wanted to check out the well-known Tahquitz Canyon hiking trail in the Indian Canyons. When we arrived, we were shocked to find that the Agua Caliente Indians were charging adults $12.50 each, just to hike in the great outdoors for an hour or so! After parking in the parking lot,...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/05/6d/72/59/indian-canyons-hiking.jpg"}]
[{"category": "spot", "review_count": "164", "title": "Elvis Honeymoon Hideaway, Palm Springs", "rating_string": "4.5", "address": "1350 Ladera Circle, Palm Springs, CA 92262", "review_list": ["\nIf you don't, then skip it.\nIf you do, then you will be happy. We loved it. Fantastic to have so many things preserved untouched, and to have such great access.\nGet in before the property sells (it's still on the market).\n", "\nWhat can you say except that it's amazing that you can tour their home with items that belonged to them, plus it's a swanky midcentury pad with very interesting space age-ish architecture. Wonderful!!!\n", "\nA fun way to spend the afternoon in Palm Springs. The house has been kept the same since the time Elvis used the house, with original fixtures and furniture. It is in great condition. The tour was interesting, although I do think overpriced at $30 per person. We were willing to pay the price as the house is currently on...\n\n\nMore  \n\n\n", "\nThis place is ok, but tours are expensive. We were able to get in with other visitors, or it would have been way too expensive. There are a few things to see, but not too much. The house itself is not too impressive, but if you love Elvis I guess it is worth the visit.\n", "\nA fun look into part of Elvis' life. Very cool House as well with lots of memorabilia. The tour guides are also very knowledgeable about Elvis' life.\n", "\nIt's like stepping back in time. Loved the house and the 1960's decor, the front entrance and pool area. The fact the Elvis once lived there was the icing on the cake. The tour guide was a little full of himself but that can be overlooked.\n", "\nFor any Elvis fans this a must stop. There are two daily tours of the house. The tours are at 1 and 3 pm. This might change.\n", "\nIf you are an avid Elvis fan, then you may want to take the time to tour this home. Otherwise I think the $30 pricetag for the tour is pretty steep, but then again it is in Palm Springs and everything is expensive in PS. The home is presently for sale for 9.5 million and who knows if the next...\n\n\nMore  \n\n\n", "\nBooked a private tour given by the lovely Laura and her husband. No questions unanswered. This was my 4th visit to this fantastic house\n", "\nFun thing to do on a hot day in Palm Springs - you need to book ahead! Tucked away in a neighborhood - it is also fun to drive around and check out the curb appeal of all the homes - and it isn't too far from the old Liberace estate either.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/52/e8/52/elvis-honeymoon-hideaway.jpg"}]
[{"category": "spot", "review_count": "50", "title": "The Buzz, Palm Springs", "rating_string": "4.5", "address": "Palm Springs, CA", "review_list": ["\nNice drivers, great way to get around Palm Springs! Thursday - Sunday it runs and it is free! Good way to get to the Thursday street fair!\n", "\nAlthough the route is limited, the Buzz is readily available and hits many of the downtown hot spots. Even locals use it to get safely to and from the casinos.\nThis runs fairly late at night, and the price is perfect!\n", "\nA great way of getting into Palm Springs..\nThe route is a little limited,and short,but for those on the route,a FREE bus into town,that goes on past Midnight..(better than the SunBus which stops about 2130..what could be better..\nCheerful drivers,and great mix of passengers,and a service than is prompt and frequent..every 10-15 mins..Thur-Sun...\nGREAT\n", "\nPerfect to get around Palm Springs. We were lucky enough to be in Palm Springs in January 2015 just after it started and again this last January. It runs from Thursday through to Sunday, from 11 am til late (can't remember it's finishing time) Perfect to get into town for a meal of an evening and such a friendly convenient...\n\n\nMore  \n\n\n", "\nThe Buzz picked us up very close to our hotel which was the first stop and to our surprise the driver asked where we wanted to get off. We told him we wanted to stop at Rio Azul' a restaurant, and although the bus was full, he remembered and let us off there. It ran every 15 minutes and the...\n\n\nMore  \n\n\n", "\nA lot of money has been invested in Palm Springs recently and The Buzz is one of its better ideas. A free shuttle that runs around town at the weekend (Thursday to Sunday) every 15 months. Ride it & enjoy it!\n", "\nNow where in the world today you can get free transit from one end of the city to the next plus. Very pleasant bus driver with friendly people of the bus bus. We started our journey right after happy hour from the purple room to straight downtown to the Thursday evening market.\n", "\nFree PS shuttle that goes from the North end (Riviera Hotel) to the South end (Saguaro/Purple Room) and everywhere in-between....\nFree & Fun, does it get any better!\n", "\nNice driver, nice trolley. Easy on and off, and it goes until 1am Thursday thru Sunday. We travelled to our hotel late evening, so we felt secure.\n", "\nThis is a great perk in any city but gave us a sense of the area and made driving unnecessary for all the things we wanted to do. If only more places had it!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/d1/c1/e7/free-transportation-around.jpg"}]
[{"category": "spot", "review_count": "189", "title": "Moorten Botanical Garden, Palm Springs", "rating_string": "4.0", "address": "1701 S Palm Canyon Dr, Palm Springs, CA 92264", "review_list": ["\nWe are staying in downtown and went by Buzz bus; stop 14. Short walk to the garden, $5 per adult entry. We enjoyed the great variety of cacti and in Feb, many flowering. Generally shady so it wasn't all hot sun. Plan to spend about an hour, more if you shop. No lot, cars park on the street..\n", "\nMoorten's Botanical Gardens is a hidden treasure. They have hundreds of plants, walking trails, caged iguanas the list could go on and on. Best of all it's no charge. Lots of shade, jungle like almost unknown to visitors. Can be difficult to find. Heavy plant and tree growth in the front areas. Parking not a problem, handicap friendly. Don't miss...\n\n\nMore  \n\n\n", "\nBeautiful cacti gardens, saw many types from all over the world.\nGreat value with an admission of only $5\n", "\nI love these gardens, they have so many cactus varieties that you can't find anywhere else in this desert. The owner takes a lot of pride in his garden, perfect for a nice family day.\n", "\nWe had a great time wandering around this beautiful garden. It has many types of vegetation, and is very well kept.\nWe bought many succulents here for very good prices!\n", "\nThere is street parking only. Allow 30 - 45 minutes to tour the gardens. Entrance fee was $5 per adult. We arrived before noon on a Friday and there were a number of other visitors touring. We were impressed with all the hummingbirds flying around. There is a nice variety of cacti with most of them being identified on good...\n\n\nMore  \n\n\n", "\nGiven the fact that cactuses in Southern California grow everywhere these guys could have had a bigger collection of cactuses. Frankly, I saw a wider variety of cactuses on the streets of Californian towns rather than in this supposed to be \"cacti garden\". Keep in mind that this garden is not free, so you should pay $5 per person.\n", "\nLoved this little Cactus Garden. It is small, but well maintained and interesting. Don't miss the fun growth in the little greenhouse.\n", "\nYou have to admire private individuals with a dream and this is what the garden is. It doesn't take long to wander round but there are excellent cactus and beautiful hummingbirds. For a few dollars take half an hour out of your day and chill......if that is possible in Palm Springs!\n", "\nfabulous easy to get to and so interesting never seen anything like it and it has a very long history\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/27/cb/e0/moorten.jpg"}]
[{"category": "spot", "review_count": "101", "title": "Ruth Hardy Park, Palm Springs", "rating_string": "4.5", "address": "700 Tamarisk St. at Avenue of Caballeros, Palm Springs, CA", "review_list": ["\nDuring our 5 day stay we tried various school playgrounds closer to our hotel and finally headed to tripadvisor to find one that wasn't locked behind fencing and gates! This park was great for kids both young and old as it has the playground, basketball and tennis court, and a trail all the way around the playground- many older kids...\n\n\nMore  \n\n\n", "\nThe tennis action starts at 8 AM and continues throughout the day. Mostly doubles, mixed and some women's play. Your partner can walk the dog while waiting. Nice for picnics and kids to play. All this for free!\n", "\nNice for picnic, walking the dog, tennis (when you can get a court). Right in the middle of everything. Check out the Wellness Park - for fitness walking and there is Yoga in the park on Saturday mornings at 10.\n", "\nWe've been walking our dogs up to this park. It's very large, and people are friendly. Most people that have dogs keep them on leash here. If not, the dogs are well trained to stay close by their owners. There is a playground for children, and it's a good spot for runners. The park adjoins (but is not part of)...\n\n\nMore  \n\n\n", "\nLots of green space to run and wear off some energy. The playground is very well suited for the under 6 crowd.\n", "\nThe Ruth Hardy Park is a nice clean park with beautifully kept trees and shrubs. There are a few exercise stations along the walkway which are fun to use.\n", "\nJust a green open area for you to sit and walk in, enough space for a bit of soccer kick about or other ball games.\n", "\nHey do you love homeless people? not to be rude but this place is where they hang out. they are not at the playground necessarily but i wouldn't let me kids out of my site that i can tell you. not a bad looking park but like i said it is homeless central so i have to say not my...\n\n\nMore  \n\n\n", "\nNice green belt in the desert with trees and exercise park in the Wellness park section. Great areas to sit and look at the mountain or meditate. The desert landscape and shrubs are beautiful. You can play tennis and there is a basketball area. Also a children's playground.\n", "\nAfter a lot of sign seeing it was a nice place to stop for a picnic and relax. It's right in the Movie District\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/c3/d0/84/ruth-hardy-park.jpg"}]
[{"category": "spot", "review_count": "94", "title": "Painted Canyon, Palm Springs", "rating_string": "4.5", "address": "Palm Springs, CA", "review_list": ["\nThis is a very popular hike. We camped at the trailhead (in a truck/camper) for 3 nights and the parking lot was packed most of the day. My husband, a friend and I hiked the main Ladder Trail one day and it was a beautiful hike. I am somewhat fearful of heights but I was okay going up the first...\n\n\nMore  \n\n\n", "\nA great hike once you figure out which way to go. Everyone we met was lost at some point. Make sure you follow the arrow at the trailhead that points to the canyon. It is hard to see but once you look inside you will see the trail. We went straight rather than left and ended up lost on several...\n\n\nMore  \n\n\n", "\nWe waited over a week for the road to be open. Once the road was open, the beginning of the road was in good condition then the sand was deeper and the traction control in our vehicle kept engaging. The sign at the beginning of the road says \"4 wheel drive\" but a few years ago we did not experience...\n\n\nMore  \n\n\n", "\nThis was truly an amazing experience! Not for claustrophobics and it helps to be a little goat!! The hike through the narrow part of the canyon was terrific and the view from the top was amazing! It is a very busy place on the weekends but has a reputation for vehicle breakins during the slower times.\n", "\nThis is an excellent hike with some awesome views. The trail has a few sections that can be challenging. There are several ladders, narrow trail sections and moderately steep in places. We did the hike early in the year with moderate temps. If it's hot I would make sure it did it early in the day. It could get pretty...\n\n\nMore  \n\n\n", "\na must hike and i am not great with ladders and high places. our friend was amazing as Trish showed us the way. Do not be scared but do go with someone who knows the way.\n", "\nThe trailhead is a little difficult to get to but well worth the effort. While the hike does not gain a lot of elevation, there are a series of ladders that are difficult for the elderly and very young children. Don't even try it with a dog unless you can carry fido. The slot canyons are amazing and the view...\n\n\nMore  \n\n\n", "\nMaybe you are better than us at finding your way through a desert hike but in spite of being lost we really enjoyed everything about this hike.\n", "\nThere were many people who went yesterday for the New Year weekend so no break-ins observed. We started at around 1:20 pm and took us 3.5 hours since we took a lot of pictures. We enjoyed the whole experience a lot and plan to go back. The colored rocks are just fabulous work of art from the higher power.\n", "\nYes this is a beautiful place, however we had our window smashed and things stolen from our vehicle.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/3c/b5/ba/the-beginning-of-the.jpg"}]
[{"category": "spot", "review_count": "141", "title": "Palm Springs Visitor Center, Palm Springs", "rating_string": "4.0", "address": "2901 N Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWe stopped in the visitor center to get directions and eta's for a couple of places we wanted to visit. They were very helpful and informed.\n", "\nWe visited this architectural gem by the modernist Frey, as part of Modernism Week.\nWe viewed Frey's mid-century futuristic masterpiece as the first stop on the tour for North Palm Springs,\nInside you will find all the maps, brochures, and tourist items necessary to plan your vacation in Palm Springs. Staff is helpful and friendly .\n", "\nVery helpful. If you going to be in this area, definitely worth a visit. The young lady who helped us told us to buy tickets for the Living Desert at the Center to save some money. Tickets for the team will also save you some money.\n", "\nVisitor Center provides a wealth of information. The workers were friendly and knowledgeable and the bathrooms were numerous and sparkling clean. Everything you would want in a Visitor Center.\n", "\nI always go to the visitor centre first in a new area. I come prepared with my questions, and usually find the staff very helpful. Unfortunately, the staff at the Palm Springs Visitor Centre were very unfriendly and unhelpful. They just ripped a map off the pad and thrust it at me. When I asked for a specific brochure which...\n\n\nMore  \n\n\n", "\nStopped here recently on our first visit to the area. Interesting structure on the outskirts of town, on the way to the aerial tram. Staff were friendly, providing directions to local hiking trails. As expected, there are many brochures to local attractions and accommodations, as well as souvenirs and water, etc. Overall, serviceable but not the nicest one we've been...\n\n\nMore  \n\n\n", "\nThis place is at the beginning of the road that leads up to the tram. The people take the time to tell you about the main attractions in Palm Springs including the tram ride up Jacinto Mountain 8000+ feet to a state park. They also had free area pamphlets and souvenirs for sale.\n", "\nI was in town to see a friend he had a lot of stories about the past in palm springs he couldn't remember exactly where some of the famos homes were so i checked the visitor center out they were great and very helpful they had two self guided driving tours that took you to most of the famos homes...\n\n\nMore  \n\n\n", "\nThis is a quaint visitor's center. Little tid bits of information about the city and located on the road that leads to the Tram. Which on a clear day you can see forever on the mountain top. Worth stopping but there is not much there.\n", "\nVisitor Centres are always a good place to start, they are full of helpful maps, brochures and ideas. The staff who helped us was excellent, lots of ideas and tips (i.e. free days at certain attractions, free parking, etc..)\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/17/e0/32/palm-springs-visitors.jpg"}]
[{"category": "spot", "review_count": "60", "title": "Santa Rosa Mountains / San Jacinto National Monument, Palm Springs", "rating_string": "4.5", "address": "Palm Springs, CA", "review_list": ["\nWe stopped and were invited to hike the Randall Henderson Trail. We met up with a fellow hiker that knew many of the plants along the trail. The paths were well kept and easy to hike. Enjoyed our sunny trek.\n", "\nWe saw the (somewhat long) video about the National Monument. Urge all to see it, to put it in perspective with, for example, Joshua Tree National Park. The Visitor center is an oasis of calm, with easy nature walks of practically any distance you choose. Lots of birds, including hummingbirds, and flowering plants, even in January. Thought we'd breeze through...\n\n\nMore  \n\n\n", "\nCan't beat the views on a clear blue sky day. Didn't have time to hike on this trip but it seemed to have many great options. Winding road is steep, take your time and enjoy.\n", "\nThe National Monument Visitors Center on Hwy 74 is definitely worth a stop, especially if you're new to the area. The volunteer and Rangers were quite helpful and suggested some hikes and gave us maps and reading material. We didn't watch the movie and there didn't seem to be much to see indoors, but we preferred to get outside anyway....\n\n\nMore  \n\n\n", "\nGreat walks. Lots to see. Bring a camera. The colors are great in spring. If you are in Palm Springs you can be there in minutes. As you drive around the Terran changes. Same withy the time of the year.\n", "\nThis is a great way for visitors to experience the unadorned, yet very interesting desert of the Coachella Valley. The Henderson Trail is very manageable, and after a guided tour with one of the volunteer hike leaders, one comes away with all kinds of good information about desert flora and fauna. Check the schedule for guided hike days and times.\n", "\nFascinating hike with multiple knowledgeable volunteers. Relaxed pace. This hike involved some aspects that require a little bit of physical agility. About 2:45 of excellent learning with great opportunity to ask questions of the docents. Donations if you want--and who wouldn't?\n", "\nWe did a short hike in the scenic Santa Rosa Mountain area. There is both mountain and desert scenery.\n", "\nWe decided to join a guided tour on a beautiful and cool Saturday morning. Met the volunteers in the parking lot and registered. The group was split into two. Actually you got to choose which hike and we decided on the Dead Indian Canyon trail. Both were 3 mile hikes. Our hike took 2 1/2 hours, however this included many...\n\n\nMore  \n\n\n", "\nWe enjoyed an excellent tour with the trail volunteers at Santa Rosa and San Jacinto National Monument. For most of the year, a couple of days per week, the volunteers will lead a group of hikers into the valleys (and up a few of the hills) at this National Monument. We had 3 tour guides with our small group -...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/8f/c4/8d/santa-rosa-mountains.jpg"}]
[{"category": "spot", "review_count": "60", "title": "South Lykken Trail, Palm Springs", "rating_string": "4.5", "address": "El Estero, Palm Springs, CA", "review_list": ["\nthis is a free trail at the end of Mesquite st. I walked about a quarter mile up it one evening. Great views night or day, but cooler and shaded after 3pm.\n", "\nThis trail is close to our home so we hike it often. It is a moderate incline but have taken kids and grandkids up the trail without issues. Dogs can be off leash so you need to expect meeting dogs, sometimes unexpectedly.\n", "\nOne of my favorite places to hike is South Lykken Trail. During the early hours of the day, and from the months of October through June, it is a delightful place to be. The grade can get a bit steep and in some places a bit narrow, but that's usually a good place to take a breather, turn around and...\n\n\nMore  \n\n\n", "\nSee also review for North Lykken Trail\nWe picked this one up by parking on the main road (Palm Canyon Drive) up by the Tahquitz Canyons. The trail starts out when you are walking by some houses to your right. We hiked for about 2 hours - total 4 miles. South Lykken, it appears to me, is steeper than North...\n\n\nMore  \n\n\n", "\nThe other reviews confirm that the trail is uphill but not terribly difficult. Pack a snack and enjoy the view from the top. Early morning is best as this trail can get hot even in winter. Be aware of the temperature if traveling with dogs or children. Remember, they are closer to the ground than you are. Bring water for...\n\n\nMore  \n\n\n", "\nA steady climb all the way to the top but not overly difficult. Grea views reward you at the top. Took us about 3hours you will need two cars so you don't have to walk all the way back. We left on s the end of Ramon road and started on palm canyon drive just before Indian canyon . You...\n\n\nMore  \n\n\n", "\nTake your dog and your kids...this is a good trail which I especially like in the morning for better Views of the valley. This Time of year it is warmer in the afternoon, too hot in summer in the afternoon. In season it is good all day long but looking into the sun most of the time .\n", "\nVery nice uphill trail with great views at the top. Extremely busy on the weekends. Early morning weekdays are best. Should take lots of water and wear good hiking boots, many rocky areas. There are usual lots of dogs also, but generally well behaved. Easy trail to follow, up steep in places. Great first hike for new comers to Palm...\n\n\nMore  \n\n\n", "\nDid this hike solo in the morning and enjoyed every minute of it. Just the right amount of cardio and beautiful surroundings, weather so different from the winter climate I'm usually inhabiting. I highly recommend this gem for a great hike very close to downtown Palm Springs.\n", "\nThis is a well used trail at both ends. There are picnic tables at the top at both ends. The total trail is about 4.25 miles. Between the picnic tables the trail is not as busy.\nEtiquette says that the uphill hiker has the right of way, if you are going downhill please be courteous and step aside.\nThe uphill...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/2e/f4/ea/south-lykken-trail.jpg"}]
[{"category": "spot", "review_count": "54", "title": "Ruddy's General Store Museum, Palm Springs", "rating_string": "4.5", "address": "221 South Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nThis is like walking into an incredibly curated time capsule. I've been several times and recently took my parents. They loved it, recognizing so many products and items from their childhood. Be sure to ask Sally the guide what some of her favorite items are and she'll point out some hidden gems.\n", "\nWhat a treasure in the heart of Palm Springs! Meticulously replicated \"general store\" with hundreds of beautifully displayed, authentic products from America's late 19th and early 20th century. Well worth the visit, especially combined with several other Palm Springs Historical Society museums in the same courtyard.\n", "\nour kids were not very interested after the first few minutes but we found it interesting to look at the old items that were collected so many years ago.\n", "\nThis was never actually a store but rather a collection by someone who was nostalgic about the \"old days.\" What was interesting was that many of the items on display still had the original contents inside. It was one room stuffed to the rafters with loads of household products, shoes, and medicines. I wish we could have gotten closer to...\n\n\nMore  \n\n\n", "\nOnce you walk in the door, you step back in time. The museum is unique in the product variety, displays and authenticity. It's so much fun to see all the packaging and advertising from that era. A must see, for all ages!\n", "\nYour 95¢ admission supports one of the most impressive collections of 1930s & 1940s era products. From medicine to clothing and from tobacco to popular food items, everything at Ruddy's is authentic and original--not a single replica in the store! Next time you're strolling Downtown Palm Springs, stop in, relax, and take it all in.\n", "\n95 cent transports to you another time when menopause was dealt with herbal pill and pharmacy meant creating any sort of concoction possible.. smokes were a plenty...\n", "\nJust a small quaint museum that is worth the 95cents admission fee. Take a few minutes and stop by. The historical society is next door so you can easily stop there and get information on their walking tours.\n", "\nThis is a 40+ year collection of Ruddy's. He was there at the time of our visit. The store is amazing. I mean period perfect. Every category with items in perfect condition. Cans of fruit with fruit in them. Medication with medication still in them. Just a total must see. There is also the Cornelia-white house to see, next store.\n", "\nI walked into Ruddy's General Store Museum, and all I could say was Wow. This quaint room was packed with a wide variety of items that depicted an authentic General store. An amazing collection of one mans passion to preserve a moment in time.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/08/18/6d/pic.jpg"}]
[{"category": "spot", "review_count": "75", "title": "Palm Springs Convention Center, Palm Springs", "rating_string": "4.5", "address": "277 North Avenida Caballeros, Palm Springs, CA 92262", "review_list": ["\nThis convention center couldn't quite figure out how to serve the two thousand of us who were staying and eating. They didn't have staff sufficient, and they were overwhelmed. I think that there might be better places to host a convention in that town.\n", "\nThe venue is well designed and situated for events. It is truly unfortunate that the parking is not adequate for large events.\n", "\nRequest rooms that overlook the pool, these seem to have nicer views. The higher floors are better. The cabana pool rooms will be noisier as they are on the street level near the outdoor bar. Request a room that has been hopefully updated and not in need of repair. Executive Suites are large rooms and good for entertaining, however, the...\n\n\nMore  \n\n\n", "\nAlways stop by here when we visit Palm Springs because you get the most up to date info, lots of information, and can get useful maps.\n", "\nThe Palm Springs Convention Center has a nice venue, very clean and well laid out. It is centrally located to downtown Palm Springs with a large choice of restaurants.\n", "\nThis is a must do first thing. lots of info. Great dining menus to see and even good gifts to buy for people. Not to be missed, even if you have been here before.\n", "\nLarge meeting rooms, main exhibit hall, and grounds to put aircraft on display around the convention center building.\n", "\nAs convention centers go this is one of the nicest.\nThere is plenty of free convenient parking and it is a beautiful facility.\nJust wish it had some eateries.\n", "\nThis convention center really suits Palm Springs. It is an open, airy with enough room. This is a great place to have exhibitions and concerts. It also has amazing Mountain View's\n", "\nclean, comfortable hall with easy access from loading area. Lighting could have been better in some areas of hall but overall was good.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/fb/9a/85/palm-springs-convention.jpg"}]
[{"category": "spot", "review_count": "51", "title": "Murray Canyon Trail, Palm Springs", "rating_string": "4.5", "address": "Palm Springs, CA", "review_list": ["\nWe hiked Murray Canyon early in the morning before it got too hot. It was a perfect hike for us. It is about 2 miles in and 2 miles out. The first part is through a dessert like area, and the remainder criss crossing a little stream about 16 times. It isn't a difficult hike and it has varied scenery....\n\n\nMore  \n\n\n", "\nA really fantastic hike up a creek you cross over multiple times. So you do a little rock hopping but nothing scary. Very shallow creek.\nLots of palms and ...Beautiful!!! Keep going to the end and the Seven Sister Falls. Gets VERY busy so go as early as possible. We were the first ones in and then the masses followed,...\n\n\nMore  \n\n\n", "\nWe had fun trying to cross the many water crossings by hopping from rock to rock! There were giant palms and low cactus along the trail. The end of the trail reward was a gentle waterfall.\n", "\nGot here at 8a in January and had a LOVELY hike. It wasnt busy at all, which we loved. Hiked to the waterfall and back and loved it. It was the perfect hike for the 2 of us (in our 30's) that didn't want a short hike but didn't want something super challenging. Loved seeing all of the different landscapes...\n\n\nMore  \n\n\n", "\nMurray Canyon up to Seven Sisters Falls has been my favorite hike among many I've done in the Palm Springs area. It's a good mix of palms, water, mountain views, and rock formations in a comfortable 2 hour hike.\n", "\nAfter you pay a fee to get into Indian Canyon reservation, follow the signs to Murray Canyon. We hiked in January 2016. The hike is moderate, you cross the stream a few times by stepping on large rocks when you are in the Oasis. There is climb up a small hill before you get to the Three Sisters Waterfall.\n", "\nWe hiked Murray Canyon in January 2016. It's accessed by passing through the common Palm Canyon gate, at the far south end of Palm Canyon Drive. Just keep driving until you can't drive any further. $9/person entry fee, paid to the Agua Caliente Native Tribe who owns and maintains these lands, allows access to all trails for the day. A...\n\n\nMore  \n\n\n", "\nRecent rare rainfall inspired us to choose this hike for the reported waterfalls at the turn around point. It was the first sunny day of the week and perfect day to hike. The trail is well maintained and easy to follow. The reward and the falls was nice.\n", "\n2.5 hour hike in the Indian Canyons. Mostly flat with one difficult section towards the end. Ends in a small waterfall with lots of shade.\n", "\nNice hike in the desert. Lots of things to see. Start off early and bring water. It can get really hot.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/99/d8/9d/murray-canyon-trail.jpg"}]
[{"category": "spot", "review_count": "40", "title": "Palm Springs Historical Society, Palm Springs", "rating_string": "4.5", "address": "221 South Palm Canyon Drive, 92262, Palm Springs, CA", "review_list": ["\nwas booked in advance as they only do it on Friday, Very detailed and informative tour of the neighborhood of the stars with pictures as well as architect information, construction and selling costs, who lived where and when.\nMany tours offered by the Historical Society on different days of the week at most reasonable prices.\n", "\nMy wife and walked the tour with docent Roger. He was interesting, informative, and kept our attention with lots of facts, photos, and houses. We enjoyed the tour and look forward to learning about other historical tidbits of Palm Springs through the other tours.\n", "\nThe P.S. Historical Society started walking tours 6 years ago and they are all excellent.\nYou can go online to book them now that they have a web site. All the tours cover the history, movie stars and architecture. Really a great deal for only $20.00, plus you are supporting a non-profit organization.\nThey are now doing lectures once a...\n\n\nMore  \n\n\n", "\nGreat place to explore all the Palm Springs history...\nLots of old pics....free..\nGreat walking tours to explore celebrity PS\n", "\nThey have about 8 different tours. We went on tour #7 the Movie Colony walking tour on a Friday morning. Everyone meets up at a location in the area and the tour begins and runs for about two hours. There were 36 people, so they divided it up into two groups Our guide toured us about the area, pointed out...\n\n\nMore  \n\n\n", "\nPSHS offers 7 different walking tours in various neighborhoods of the city. We've been on two of them and have found both to be excellent. Informative docents armed with plenty of information and some celebrity gossip, and the good luck to be able to get a sneak peek into the occasional home make for a wonderful couple of hours.\nBring...\n\n\nMore  \n\n\n", "\nThis is one of seven walking tours around downtown Palm Springs offered by the PS Historical society. It starts mid morning and runs until noon. The tour went about an hour longer than advertised and we could have gone another hour because we were having a great time.\nThe guide Don was a natural and had his facts down. We...\n\n\nMore  \n\n\n", "\nThis is such a cute little museum! There's a lot of interesting items on display and there's more to be learned here than I imagined- about the history of the area, etc. Well-worth a visit!\n", "\nThe best part of the house museum is learning about the courageous sisters who were pioneers in Palm Springs. An inspiring story. Skip the grocery store but do stop at the exhibit about the native Americans who were there first.\n", "\nWe took 2 of their walking tours. Docents lead the tours which are about 2 hours long. They are very knowledgeable, and the tours cost $20 per person, which is the best price around. I think the walking tours allow you to take in the sights in a much more complete and leisurely manner than riding around on a bus...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/08/01/12/05/palm-springs-historical.jpg"}]
[{"category": "spot", "review_count": "62", "title": "Camelot Theatres, Palm Springs", "rating_string": "4.5", "address": "2300 E Baristo Road, Palm Springs, CA 92262", "review_list": ["\nThe cinema floor is nicely slopped so there are no bad seats. The seats are comfortable with soft chairs and plenty of leg room. We have seen a number of films here over the course of the PSFF and like this venue.\n", "\nThis theater is from another decade, no stadium seating, an actual stage. The film selection are first run, independent type films which is a nice break from the \"shootem up\" noisy big budget films. Located a mile from downtown PS on the side of what appears to be an abandoned shopping mall, there is lots of parking just outside the...\n\n\nMore  \n\n\n", "\nIf you like really GOOD movies, documentary's, film noir, independent movies. You have found the right place.\n", "\nMake sure you sign up for the newsletter from the web site for this theatre. Some extremely good thought provoking films shown here, and some films not on general release or perhaps a little hard to find in the main stream theatres.\n", "\nThis is a very special theater. They show very different films. It is a throw back in time. They have great popcorn!\n", "\nWonderful screens and sound. Very comfortable even the smaller theaters. Many foreign and independent films.\n", "\nwe just went last night. screen was enormous. sound was good, air conditioning was just right. a great theatre that is underutilized unless it is a film festival. they have a cafe and parking is plentiful.\n", "\nold fashioned 3 screen theater, only cinema showing Birdman, typical pricing of tickets and concessions, ok but for the same money I much prefer the modern cinemas with high back reclining seating,\n", "\nPalm Springs and the Coachella Valley are blessed with some excellent, state-of-the-art venues for independent and foreign-language film, but few theaters excel the Camelot for sheer moviegoing pleasure. Along with the Annenberg Auditorium at the Palm Springs Art Museum and the auditorium at Palm Springs High School, it's one of the three best places to see films at the annual...\n\n\nMore  \n\n\n", "\nIt is a terrific venue for thoughtful, less well-known films that rarely make the more commercial theaters. Known for the diversity of films they show, it also has a lovely restaurant upstairs and it's OK to take food and drinks into the theaters, too.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "156", "title": "Wet 'n' Wild Palm Springs, Palm Springs", "rating_string": "3.5", "address": "1500 S Gene Autry Trail, Palm Springs, CA 92264", "review_list": ["\nHave been talking the kids here for years. Very clean, great people work here. All different type of water activities for every age. Hard to get the kids to leave (no matter what the age).\n", "\nTook ,y family wife and 4 kids. The kids had fun but this is an older facility and needs to do some renovations. The rides are old and fairly run down. But when its 114 degrees in the desert who doesn't like t o go to a water park.\n", "\nMy kids went here for a two for one special. They lines were not bad, they did all the rides they wanted to do in three hours and we're back at the hotel by lunch! They said it wasn't the largest park, but still fun.\n", "\nThis is a great experience, especially for kids. some of the rides are really thrilling. I must admit though, that the slides, that almost drop horizontally, are a bit scary... meaning I almost felt like tumbling over. Not too sure about the safety here. But other than that, a fun day out for the whole family.\n", "\nIf you go for the rides you are all good!\nAs soon as the staff looking over the rides get involved be prepared to want to retaliate or just grin your teeth to keep having fun.\n1) The person working at the Lazy river took the inter-tube from me as I was exiting. Then tried to hand it back to...\n\n\nMore  \n\n\n", "\nIf you want to waste your money - go here! The sun chairs were so dirty - yukk! Staff to lazy to jet wash them? Carpet by them was filthy and not been cleaned. Changing rooms and toilets - clearly not been updated since the 80's. Wave machine very intermittent and the rides were managed very poorly by staff who...\n\n\nMore  \n\n\n", "\nThis is a great waterpark to enjoy in the summer months. I usually take my nephew here and he really enjoys it. They have an awesome lazy river.\n", "\nA great way to escape the summer heat. During the week it is not crowded but weekends can get pretty busy. Food is overpriced. Typical of any water park.\n", "\nPalm Springs is hot, very hot. WnW is a great place to have fun and stay cool. Very clean, with good facilities. Great fun and good value. Take your own towels - they do not rent. And a pair of flip flops is essential - you cannot walk on the tarmac. We hired a cabana, which I strongly recommend. Shade,...\n\n\nMore  \n\n\n", "\nHad an amazing time here ! Not too crowded and not too big that our group would lose each other. Kids area was very nice and they had some areas with decent shade but get there before they open to guarantee a shaded spot. You can bring in a cooler and we brought snacks in without any issues. Had a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/6d/32/bf/knott-s-soak-city.jpg"}]
[{"category": "spot", "review_count": "73", "title": "Annenberg Theatre, Palm Springs", "rating_string": "4.5", "address": "101 Museum Drive at Tahquitz, Palm Springs, CA 92262", "review_list": ["\nWe've been here many times and last night we went to hear Maureen McGovern. This is a perfect venue to showcase HER voice because the audio acoustics are excellent.\nThe theater is a 433-seat venue and it is plush, beautiful and a delightful place to visit. It is behind the Palm Springs Art Museum but still part of the building...\n\n\nMore  \n\n\n", "\nThe less known venue has far superior performances then the McCallum. It is always sold out.\nThe demographic of course is aging, so they will need to reinvent themselves with productions that appeal to a new generation, or they will fizzle out over time.\nThe theatre is excellent, seats comfortable, leg room nice. Parking can be difficult so give yourself...\n\n\nMore  \n\n\n", "\nAmazing and beautiful, filled with the history of presidential visits and negotiations. Great vibe and very informative.\n", "\nWe were there for a couple of movies during the film festival and since the theatre was designed by Williams I was excited to see it. I wasn't disappointed.\nIt's smaller than I anticipated (no balcony) but had some interesting features. I liked how the sides of the seating areas were built out for quick exit and emptying. That seems...\n\n\nMore  \n\n\n", "\nThis is a great venue for the Arts in general...you can see a film, live production, lecture or other event that may be scheduled during the yer - including the screening of many films during the annual Palm Springs International Film Festival. Schedules change but are always an interesting mix of productions & films. And spend time in the Museum...\n\n\nMore  \n\n\n", "\nWe took the tour of Sunnylands---where the Annenberg Theatre is located. This is a tour not to miss. It is an impressive home featuring a wonderful collection of art work. Worth the money and time!\n", "\nThey updated it several years ago, keeping the Orange color\nOf the seats. (Not my preference of color). You get quality performances. Pricing tends to be almost on par to the McCallum\nTheatre in Palm Desert so many attractions to go to in our desert.\nCheck all venues even the shows at the various casinos to compare\n", "\nInside the Art Museum and a lovely comfortable venue but Palm Springs cannot draw top drawer talent unless they are \"over the hill\" or has beens.\n", "\nSmall theatre, maybe 3,000 max. Extremely varied performers. Check online close to the show date: we got tix in the 3rd row for Lord of the Dance; probably a patron that released their seats. The balcony is not good for shows like the B-52's because gays dance facing backwards.\n", "\nSaw two plays here and enjoyed them both immensely. Acting/directing/sets were excellent - very lovely venue and professional all around.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "33", "title": "Agua Caliente Cultural Museum, Palm Springs", "rating_string": "4.5", "address": "219 South Palm Canyon Drive, Palm Springs, CA", "review_list": ["\nThe government 's treatment of the native peoples is, of course, notorious. This museum gives the history over the past century of how the Supreme Court finally allowed the Cahuilla Band of the Aguascalientes Caliente to gain economic control over their own destiny. It explains much about the fragmented land development of central Palm Springs. Very intriguing.\n", "\nThis small museum is very helpful in understanding the history of this area and the Aqua Caliente people. The museum offers free admission but there is opportunity to leave a donation. There is also a small garden area with some plant species. I recommend dropping by this little museum. It is well worth the time.\n", "\nPlease go visit the museum. It was so interesting to learn the history of the native Americans to this area and how they are using the areas natural beauty to support themselves and share with others.\n", "\nWe enjoyed reading and looking at the displayed. Very informative regarding the earlier land and its inhabitants.\nTools, how the Canyons formed villages, and interesting history of food collecting and storage.\n", "\nThe museum is dedicated to preserving the history of the Agua Caliente Band. Although it is small, it is well worth visiting. It is FREE to visit, but a donation is appreciated. The museum is well renowned, and is affiliated with the Smithsonian National Museum. Their current exhibit \"Section 14 - The Other Palm Springs\", is a thought provoking and...\n\n\nMore  \n\n\n", "\nSmall, but essential to understanding the Agua Caliente Indians in the history of the development of Palm Springs. Not a pretty story. The museum is free, has a small outdoor garden of native plants, and books, postcards, and jewelry for sale. Recommended.\n", "\nYou get a lot of information about the Agua Caliente Native American history over the past 5,000 years, culminating in the 1980 land disputes. An interesting, but in many ways disturbing, history lesson on Palm Springs. It really is a must see to understand the town of today.\n", "\nThis is such a fascinating museum. It's relatively small, but it's free and definitely worth checking out if you are walking through Palm Springs. The Agua Caliente band of the Cahuilla Indian history behind the area is definitely worth learning about. Walk through and be sure to leave a donation. They'll need it for the amazing building which they hope...\n\n\nMore  \n\n\n", "\nEven after many visits to Palm Springs, I never really knew the history of the\nvillage and its native people. Not a pretty story, but a good ending to a long land\nbattle.\n", "\nI cannot believe I have been coming to Palm Springs for so many years and NEVER went here! Hidden just steps away from candy and coffee is this beautiful place filled with great surprises and history. Go, you will not be disappointed.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/08/1a/ad/fetishes.jpg"}]
[{"category": "spot", "review_count": "100", "title": "Palm Springs Celebrity Tours, Palm Springs", "rating_string": "4.5", "address": "67-555 East Palm Canyon Dr. Ste C-110, Palm Springs, CA 92234", "review_list": ["\nWe booked a three hour Sinatra Celebrity tour online and appreciated the detailed info. Be sure to get there 15 minutes ahead of time to confirm your spots. We had a great tour guide Jeff who had a great amount of celebrity information to share with us. We heard about many celebrities who called Palm Springs home but the focus...\n\n\nMore  \n\n\n", "\nI love to get the low down on the cities I visit. Palm Springs has such a storied past that to hear it from someone who has lived there & can relate so much information made the past come alive. I felt like I would see Bob Hope or Sinatra driving out of one if the many houses they owned...\n\n\nMore  \n\n\n", "\nOur amazing tour guide, Jeff, was a fountain of knowledge about the stars that once lived in Palm Springs and the life styles they led. We also learned a lot about Palm Springs today and were treated to a delicious date shake. Jeff was glad to customise the tour to the interests of our group and made the tour great...\n\n\nMore  \n\n\n", "\nThe tour takes you by the homes where the older stars lived. You can't see a lot of detail because of fences and landscaping but the guides provide a lot of information about the homes and the history of the area. When they said a date shake was included we expected a small cup at a tourist trap. The date...\n\n\nMore  \n\n\n", "\nPalm Springs is home of many celebrities, and this tour is an opportunity to step back in time and see the homes where many of the old timers used to live. Each tour is unique, not scripted, and the guests can let the driver know which celebrities/homes they are interested in seeing. Most of the homes we drove by used...\n\n\nMore  \n\n\n", "\nI have been coming to the Palm Springs/Palm Desert area for a number of years, and am glad I did take this tour. It is a bit pricey, but worth it. Ann, our guide and driver, was very knowledgeable about the Palm Springs area, as well as nearby communities. She pointed out homes of celebrities, as well as their transitions...\n\n\nMore  \n\n\n", "\nMy bride and I wanted to see some things that we had not seen in previous visits and this was just the perfect way to see those things. Ann was a great driver with great stories and great inside information. I was not aware that so many celebrities, both current and past, have called The Springs home at one time...\n\n\nMore  \n\n\n", "\nWe did two tours, the Windmills and Palm Springs. We had the same guide both days, he was very informative, knowledgeable, humorous and entertaining. My husband and I enjoyed both!\n", "\nAnn, our tour guide kept our group in stitches as she regaled us with tales of the Hollywood stars of the past. She knows a million stories and we were a captive audience. It's little hard to see behind the hedges and gates of the homes that used to house the stars, but somehow you feel like you're rubbing elbows...\n\n\nMore  \n\n\n", "\nThe glamourous days of Hollywood, right in Palm Springs is amazing. We couldn't believe how many stars had homes here, altho' they were here many years ago, and some did not stay long. We saw lovely estates, and tiny houses... all belonging to the Rich and Famous, of Old. It was very interesting, altho' it said for us to wear...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/30/03/e7/the-celebrity-tour-office.jpg"}]
[{"category": "spot", "review_count": "48", "title": "Palm Springs Windmill Tours, Palm Springs", "rating_string": "4.5", "address": "62950 20th Ave, Palm Springs, CA 92262", "review_list": ["\nIt was neat getting a close up look at some of the operating windmills and hearing some of the background info, but it's a little overpriced. The actual tour is an hour or less. The first 45 minutes or more are an introduction and history of wind development in and around the double wide trailer where the tour begins. The...\n\n\nMore  \n\n\n", "\nWe had Randy as our tour guide and he made the trip interesting and informative. He is incredibly knowledgeable about the history and the industry. Our family loved getting up close to the windmills and learning the history of the valley and wind energy. Randy was open to any and all questions and made the trip richer for it. The...\n\n\nMore  \n\n\n", "\nWonderful tour, full of information about wind turbines. Our guide Randy covered the history of wind power generation and the local history of this wind power generation farm. We had a hands on walk through a collection of older wind turbines and learned a lot about the problems of various turbine designs. We toured the farm in a very comfortable...\n\n\nMore  \n\n\n", "\nI have lived in Palm Springs for 15 years and have always admired and been intrigued by the thousands of wind turbines at the entrance to our valley. Recently I had a friend visiting from England who is buying property with a wind turbine on it. I thought it might be interesting for us to go on the windmill tour...\n\n\nMore  \n\n\n", "\nI enjoyed seeing the windmills up close, and getting my questions answered, such as why there is such a variety of windmills, and why some windmills spin and some don't when they are right next to each other. The thing I strongly suggest that they change: they start out with a presentation about history. Members of the audience follow the...\n\n\nMore  \n\n\n", "\nThe sight of a couple thousand windmills in this pass is mesmerizing. This 1.5 to 2.0-hour tour explains the history and facts behind this massive wind farm, America's first large installation. You will hear about wind machines that failed -- and those that succeeded (and still do, obviously). You will see photos of failed machines. And you will be able...\n\n\nMore  \n\n\n", "\nMany years ago, I took a windmill tour and I don't think this is the same company or they have vastly improved! The gentleman (unfortunately, I don't remember his name) who led the tour knew windmills historically and mechanically. He satisfied those who had a thirst for details about engines, electricity, solar and wind power but was able to make...\n\n\nMore  \n\n\n", "\nThis was an EXTREMELY interesting and informative tour of the most recent iteration of wind energy. It captures the \"history\" of wind turbines from the original Edison attempt in the late 1970's to the current 3 megawatt behemoths by Vesta. The tour guide (Randy) was superb. Well worth my time and effort and even the bus tour through the wind...\n\n\nMore  \n\n\n", "\nThis was a very educational tour that the adults and teen loved and even my 11 year old daughter was very interested. We did the tour in August on a \"screaming hot\" 114 degree day. Most of the history of windfarms was given in the air conditioned office so that helped. They even had cold bottled water to take in...\n\n\nMore  \n\n\n", "\nI can't say whether this is the best way to see the windmills, but I can say it is the only way I would want to see them. For starters, at the time of our visit, this was the one tour where you actually wind your way in places among the windmills. The introductory presentation, with photos, is a bit...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/20/23/4e/palm-springs-windmill.jpg"}]
[{"category": "spot", "review_count": "41", "title": "Palm Springs Modern Tours, Palm Springs", "rating_string": "5.0", "address": "2901 North Palm Canyon Drive, Palm Spring Visitors Center, Palm Springs, CA 92262", "review_list": ["\nWe were in the Palm Springs area to look at it for possible future retirement plans. We knew really nothing before the tour and learned so much about the neighborhoods and the styles of architecture and design. The tour guide Robert had so much passion about the area and was really interesting and told great details and stories. I would...\n\n\nMore  \n\n\n", "\nWe booked a tour 2 weeks in advance and confirmed our spot for our visit. We had travelled from another country and only had 4 days in PS, and decided to dedicate a morning to this tour to gain as much knowledge about the city and the architecture as possible. We arrived 15 minutes early to the Visitor Centre as...\n\n\nMore  \n\n\n", "\nIt cost $85 US and you reserve ahead, meet up at the specified time at the Palm Springs visitor center. You guide (we had Robert) gives you a brief introduction about the tour and then you're off in his air conditioned van. You cover 35 miles in 3 hours. We learned a lot about the area, the architects, the neighborhoods,...\n\n\nMore  \n\n\n", "\nTrevor will drive 5 guests around in his minivan for 3 hrs telling you all about how Palm Springs came to be what it is today, and a good \"external\" look at the modernist homes built over the decades.\nYou can't beat having someone tell you all about the homes, the history, and how they came to be. If travelling...\n\n\nMore  \n\n\n", "\nMy husband and I took a highly informative and humorous tour with Robert this morning. His passion for the architecture and preservation in PS came through from the start. He was so knowledgeable about the area, environment, history and interesting home details the three hours flew by. I would absolutely recommend it to MCM lovers, architecture lovers, first time visitors...\n\n\nMore  \n\n\n", "\nI cannot recommend Robert and his tour highly enough! Robert has a passion not only for Mid Century Modern architects and their houses, but for the area in general. That passion flows out in a wealth of knowledge and joy that makes three hours fly by. He is a true Palm Springs treasure with the scope of knowledge that only...\n\n\nMore  \n\n\n", "\nWe love visiting the California Desert. Our normal visit is to hike in Joshua Tree Nat Park and stay in Desert Hot Springs.\nAfter our tour with Robert, we found more reasons to love the area. Following his excellent presentation, we took his advice and hiked thru Palm Canyon. He is very knowledgeable about Palm Springs and is enthusiastic about...\n\n\nMore  \n\n\n", "\nMy husband and I had such a great time driving around with Robert learning about the mid-century modern philosophy and all of the personalities of the movement. If you really want to learn and care about preservation, you must take this tour. My husband didn't think he could last three hours, but he was totally engrossed.\n", "\nRobert so clearly loves his city and his topic that it is a joy to discover new areas of interest in our well-loved Palm Springs with him. Great history, great esthetics, great recommendations. We were still talking about it hours later. Well worth the price; we've already talked about taking it again and this time we'll take something to take...\n\n\nMore  \n\n\n", "\nHaving been on several tours of different styles this was one of the best. Robert was informative as well as personable/knowledgeable. He revealed a picture of Palm Springs that we had missed on our own and sparked so much interest that we will drive again this week revisiting what he showed us to linger a little longer with camera in...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/06/b3/23/bc/palm-springs-modern-tours.jpg"}]
[{"category": "spot", "review_count": "157", "title": "Indian Canyons Golf Resort, Palm Springs", "rating_string": "4.5", "address": "1097 E. Murray Canyon Dr., Palm Springs, CA", "review_list": ["\nPanoramic views every where you looked! Course was in superb condition.\nStaff accommodating and friendly, which depending on the golf course , is not\nalways true.\nPace of play was reasonable, not to many delays.\nThis is where my wife received acknowledgement for Her first Hole-in-One!\nThis time she had a 5! This is a fun golf course, and certainly...\n\n\nMore  \n\n\n", "\nCourse was in excellent condition. Tee off times were well spaced, not hold ups at any hole. Staff were extremely helpful in solving an issue with our reservation & still got us out on the course.\n", "\nThey tout being the only wind free course in the valley and I am a believer. Had a lovely day of golf enjoying the look of the homes built in the day of old Palm Springs. Enjoy the Disney fountain in the lake between holes 9 and 18.\n", "\nExcellent course. Greens roll very nice. Well maintained. Lots of challenges from different tee decks. Panoramic views. Service is very good. Got online rate of $84. Play the south course.\n", "\nFor a couple of senior duffers we loved the classic layout in a box canyon with plenty of mountain views and no wind (there had been a recent cold wintry day blow in a few days before we played). The fairways and greens were in great shape after the winter reseeding. However, we caught the last day of the mandatory...\n\n\nMore  \n\n\n", "\nSee my Dec 2014 review - not much has changed! They still charge $30 for a rider, which is ridiculous. Course is in pretty good shape; greens in great shape. Only about 1/2 the bunkers were well maintained. There are some sparse areas/washes, but that's ok - drought takes over. Again, it was a good deal on Golf Now, but...\n\n\nMore  \n\n\n", "\nThe course is a classic resort style course surrounded by homes except the fairways are considerably wider and more forgiving. The homes are spectacular if you enjoy modern mid century architecture. Greens are true and in very very good shape. Booked through a golf service fantastic and received reduced green fees - fantastic value for a course of this calibre....\n\n\nMore  \n\n\n", "\nIndian Canyons South Course is a beautiful layout and in great condition, even though they had just completed the winter overseeding. From the guy who came to our car to pick up our clubs, to the club house staff and starter, everyone at the course was friendly and welcoming!\n", "\nWe have played here 3 times since arriving in Palm Springs. We knew from their website that until Dec 1 carts had to stay on the path and the sandtraps were not totally rebuilt. This meant that it was quiet and we enjoyed our leisurely rounds.\nLast Wednesday (Dec 2) we only saw some golfers around the club house and...\n\n\nMore  \n\n\n", "\nYou are met at your car by the bag pickup person and taken to pro shop for sign in. The course and greens were in perfect condition. Played on a Thursday in three hours\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/68/47/51/filename-img-1227-jpg.jpg"}]
[{"category": "spot", "review_count": "225", "title": "Escena Golf Club, Palm Springs", "rating_string": "4.5", "address": "1100 Clubhouse View Drive, (entrance on Vista Chino), Palm Springs, CA 92262", "review_list": ["\nPlayed golf on a beautiful Friday morning. My clubs were running behind with ship stix so they moved me back and fit me in. The staff was awesome. My clubs arrived 5 mins before the tee time and we hit the immaculate Nick design. Greens were as pure as they get. Will be back for sure the next time I'm...\n\n\nMore  \n\n\n", "\nGreat golf value for Feb in the Palm Springs golf community. Course was in excellent shape, green smooth and fast. Grill was great, overlooking course and mountains.\n", "\nMy wife, father-in-law, and I went to this golf course on 2/12/16. The staff were friendly and helpful. The course was beautifully maintained and it was worth every penny.\nBring a water bottle and be sure to fill it up whenever you see a cooler. You can get easily dehydrated in the desert sun.\nI'm a 16 handicapper and my...\n\n\nMore  \n\n\n", "\nThis course is a real treat. Every golfer should play here at one time or another. Wonderful design, every hole should make you consider your options if you're good enough to have options. If not, just keep it the middle as best you can -- unless you see bunkers, or water, or desert waste area. Then, just hit it. If...\n\n\nMore  \n\n\n", "\nIf you like 5 1/2 hour rounds and little to no service, you've come to the right place. And it's too bad because the layout itself is fine. But two days in a row of snail's pace golf is too much.\nI've got an idea for them and won't charge for it. Eliminate at least one tee time per hour...\n\n\nMore  \n\n\n", "\nA good solid course with gorgeous views. It was a good challenge but had forgivingly wide fairways. I felt the staff was a little snooty touting their Jack Nicklaus design courses. I didn't find it to be worth their rack rate - make sure and get a deal.\n", "\nOn the way home after a great palm springs weekend. Last stop for brunch at Escena C.C. Sitting outside with views of the lake, the course and the mountains covered with snow was one of the best experiences of the weekend. I will make this one of my stops the next time I come out. I have to try the...\n\n\nMore  \n\n\n", "\nFrom the pro shop to starter to marshals. Everyone was a true professional and a customer centric representative of their organization. The golf course is one of the most impressive course I have ever played - and I have played all over the world.\n", "\nEscena is a very scenic golf course,located near Palm Springs Airport.Designed by Nicklaus design,the course features well manicured tee,s fairway,s and green,s,all surrounded by natural waste areas,full of the local desert vegetation.Throw in a few well placed water hazards,and you have an appealing golf course.\nWhilst not at the very top of Palm Springs golf,the course is challenging for all...\n\n\nMore  \n\n\n", "\nFirst the good, course conditions are very good and the greens are quick. Just bad management. We waited on 14 of 18 tees! The Marshall was there but obviously did not do anything or communicate with us. The wait started on the second hole! Finally called the pro shop on 15 and they did send the Marshall out, but he...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/05/83/d4/2d/escena-golf-club.jpg"}]
[{"category": "spot", "review_count": "93", "title": "Tahquitz Creek Golf Resort, Palm Springs", "rating_string": "4.0", "address": "1885 Golf Club Dr, Palm Springs, CA 92264-3860", "review_list": ["\nMy husband and I have golfed Tahquitz several times this month. If you obtain a Palm Springs resident card, you get a substantially reduced rate. It's worth looking into.\nThe staff is very friendly and helpful. The course was in good shape. We think it is a good course for the average golfer. It was relatively easy to get bookings....\n\n\nMore  \n\n\n", "\nWe were visiting palm springs on vacation and picked this course while in town. They had something I had never tried before called a golfboard (like a surfboard on wheels) that I was able to rent (my clubs strap to the front). You rent the golfboard for an additional fee but it was well worth the fun! The golfboard is...\n\n\nMore  \n\n\n", "\nI should start this review by explaining I am not a good golfer and am learning. I played 9 holes yesterday with a friend who is of the same level as I am--beginner. You can go on line and get a tee-time or call. We paid $59/each & they give you a receipt for a drink at the end of...\n\n\nMore  \n\n\n", "\n6 of us golfed here. Reasonable price for golf including the cart and enjoyed a delicious buffet lunch for $10. Would come here again except for the rain storm this week, which they probably need.\n", "\nMy wife and I golfed this course while vacationing in Palm Springs. They pushed our t time back by 45 minutes because they ran out of carts. They were rude when I enquired about this. This 45 minute delay made it impossible to complete our round before dark. Then our cart died and I had to push it back to...\n\n\nMore  \n\n\n", "\nPlayed this course with some Palm Spring friends. $67 for 18 holes with cart, breakfast, and lunch with wine and beer. The course is good - nothing spectacular - but for a course open to the public in good shape. Nice views of Bob Hope's house. We played mid-week and had a just over 4 hour round, so what is...\n\n\nMore  \n\n\n", "\nWe played in our industry tournament last Tuesday and it was the first round played since they had been closed for over seeding. The tee boxes were like the rough and the greens were slower than I have ever played. Despite all that the views were so nice it seemed like a picture hole every time I turned around. If...\n\n\nMore  \n\n\n", "\nCourse in good condition. Great deal which included Breakfast, lunch and two drinks. Only negative issues was cart path only which slowed play.\n", "\nIf this course was ready for play, you wouldn't know it from the ragged fairways and shaggy tee boxes. No warning about cart-path only left my aching plantar faceitis begging for relief. I would have expected greens fees of about $19 for a course in this condition. My advice: wait until January. Maybe by then you can find your ball...\n\n\nMore  \n\n\n", "\nMid day is a good time to play if you can get Golfnow rates. Course does not discount much and so rates are high if booked online or by phone. Golf Now has good rates for this course later day.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/df/19/78/tahquitz-creek-golf-resort.jpg"}]
[{"category": "spot", "review_count": "85", "title": "Palm Springs Walk of Stars, Palm Springs", "rating_string": "3.5", "address": "Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nMy boyfriend and I had a night in Palm Springs and really looked forward to a great exercise walk in the morning, especially since we had a 9 hour drive ahead of us that day! Stayed at the darling Casa Cody B&B and 2 blocks from that location put us on the Palm Springs Walk of Stars. With a tasty...\n\n\nMore  \n\n\n", "\nI was fortunate enough to see the giant \"Marilyn\" while in Palm Springs in 2014. It was sheer awesome! Although she is gone now, there are many \"stars\" to see on the Walk of Stars. It's very fun to stroll down Palm Canyon and read the names.\n", "\nI didn't recognize the so-called \"stars\" and they included philanthropists and plastic surgeons. Weird. Maybe if there was a description of what they had done it would be more interesting.\n", "\nThe walk is a nice stroll and gives you an easy walk. It was a great early morning activity while I was on a business trip that allowed me to get some time outside.\n", "\nThis is a very interesting thing to see, but can get a little congested with people trying to look at all the names on the walkway. Suggest early morning to avoid the crowds.\n", "\nWe walked over these names many times during the Palm Springs International Film Festival and some of them were pretty obscure...but on researching a few it's clear they made a contribution to Palm Springs in it's Hollywood retreat heyday. Saw the amazing documentary 'Women he's undressed' about 3 time Oscar winner, costume designer to the stars Orry-Kelly...it's clear there are...\n\n\nMore  \n\n\n", "\nIt was a surprise to see stars for Plastic Surgeons, but then we did see some people in town that walked extremely slowly but had tight facial features.... The stars alternate in each direction on the sidewalk so you must do a turn every second star. Lots of humanitarians with stars, so it is nice to see people recognized for...\n\n\nMore  \n\n\n", "\nWas great to see this - B great celeb stars :) much cleaner and nicer than the one in Hollywood. Palm Springs is worth the drive\n", "\nI always love walking around DT Palm Springs, but wandering around and checking out the stars is a lot of fun- seeing how many stars worked and visited here. Some names I knew, and others well before my time, but still interesting. I do miss Marilyn though and wish she was still here, but was lucky enough to see her...\n\n\nMore  \n\n\n", "\nIt is nice walking around and trying to figure out what name belongs to the star on the ground but many names are not necessarily \"stars\". However, it is a nice walk and some funny stuff one can find in the stores does take your attention away from the stars listed on the ground.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/ab/23/9c/walk-of-fame.jpg"}]
[{"category": "spot", "review_count": "46", "title": "Windmill Farm, Palm Springs", "rating_string": "4.0", "address": "20th Ave. north of I-10, Palm Springs, CA", "review_list": ["\nOne of the worst eyesores you will see anywhere. I know the greenies love wind power but we find this to be an environmental embarrassment. They have ruined miles and miles of desert.\n", "\nAmazing collection of all kinds of wind turbines spinning away in the constant wind in the pass along I10. Not a sound to be heard but thousands of turbines everywhere. We did not take the tour but just drove around ourselves on Indian Canyon Rd. Took lots of photos and videos.\n", "\nLocals despise these eyesores. They are not worth your time to photograph. Suggest you head towards the mountains and enjoy the flora.\n", "\nAbout all I can say is there are windmills every size and describtion for miles. You can see them at a distinct, quite lovely.\n", "\nWhat impressed us, was the number of windmill. there were so many and so close together. We just haven't seen as many before. I would recommend a drive by just to see the cluster. the #10 has great views\n", "\nI enjoyed learning about how they work. Windmills sure have come a long way! While I don't really like the looking at the windmill farms they are effective at harnessing wind for power.\n", "\nhave always been impressed by the windmills and there ability to produce electricity. the tour is definitely for those that have an inquisitve mind. very informative\n", "\nIn the hill area just before one gets to the downtown area of Palm Springs, one finds the windmill farm. Sometimes it is very windy through this area. I find it awesome to see them. They are a source of alternative energy.\nIn this area, I find them an interesting feature, In other areas of the country where I have...\n\n\nMore  \n\n\n", "\nIt's always nice to see how things work and give energy here they give you a chance to see it up close so cool definitely interesting.\n", "\nThe windmill farm seems to be biggest in california. It must be providing sufficient elecrtical,power to palm spring region. It is felt that poluutuon is minimul in this area. One feel very happy to see such use of nonconventional energy.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/d0/d0/6a/the-windfarm.jpg"}]
[{"category": "spot", "review_count": "27", "title": "Palm Springs Art Museum Architecture and Design Center, Palm Springs", "rating_string": "4.0", "address": "300 S Palm Canyon Dr, Palm Springs, CA 92264", "review_list": ["\nI stopped by on my way home after shopping to tour the museum and was underwhelmed. There are photos of buildings and blueprints and a few building models, along with a gift shop, but I didn't see the attraction.\n", "\nWalked in just in time for a docent-led tour. Very informative. The gift store is a lot of fun! A staff member even came outside to offer a dog we were watching a drink of water!\n", "\nA real treat for those who love architecture from the modernism era. Beautiful & informative in its simplicity.\nAdmission was free.\n", "\nEarlier in the week, my wife and I did a Desert Modernism Tour. The guide also talked about Modernism Week which started the following Thursday and that if we were still in town should consider taking advantage of. But alas, we were leaving the next day. On our return trip to LA, our son said we should arrive at their...\n\n\nMore  \n\n\n", "\nThere is a little Indian art but most of the museum is modern art and you have to have a good imagination. There are docent tours to help u est and better.\n", "\nThe museum is quite small with really not so very distinguishable collection ... the building is mildly interesting except the docents will tell you it is designed by somebody famous... used to be a bank..\n", "\nRotating exhibits plus the permanent ones....always something of interest in this beautiful building. Great gift shop, too.\n", "\nI was home and got antsy to get out of the house. I started on a bike ride and wound up at the Art Museum of Architect and Design. I hit it on the free Sunday, how could I resist!\nI did not know what to expect. I started off in the museum gift shop, which was full of an...\n\n\nMore  \n\n\n", "\nEven though I'm a member of the art museum (which is incredibly good for a city/area this size) it took me a long time to get to the Architecture and Design Center. As a fan of Palm Springs architecture, I was really looking forward to learning more about it and its history. Alas, more than 90% of the items exhibited...\n\n\nMore  \n\n\n", "\nLove the idea of converting a savings and loan building into a museum! Small collection of a variety of modern art pieces in different mediums. Excellent museum shop with beautiful items for sale.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/09/2c/de/fc/palm-springs-art-museum.jpg"}]
[{"category": "spot", "review_count": "31", "title": "Statue of Lucille Ball, Palm Springs", "rating_string": "4.0", "address": "100 N. Palm Canyon Dr, Palm Springs, CA 92262", "review_list": ["\nYou might walk right past this if you're not looking for it. Sit next to Lucy, take a pic! It's part of the delightful charm of kitschy and fun Palm Springs Village.\n", "\nHad fun taking pictures with Lucy! We visited her the evening we went to the Thursday night street fair.\n", "\nNot a really good likeness but fun to take a picture with. I had to look close and we had to debate if it was her or not\n", "\nIt is a statue of Lucille Ball set up for tourists to take a photo. The statue is arranged to allow seating on either side of Lucille which makes for great photos. If you were a Lucy fan it is a must stop. Be careful as the statue can get really hot in the sun.\n", "\nGreat Place--Worth seeing-- A must see if you are interested in architecture--Building itself is beautiful! Highly recommend!!\n", "\nShe was an icon in Palm Springs. pu can sit next to her and take your photos in front of a coffee house . She probably loved coffee !\n", "\nIt's a statue. Have your picture taken with Lucy. Enjoy the coffeehouse next door or Pinocchio for breakfast.\n", "\nThis is a very fun \"resting place\" near cafes, eating establishments and shopping. Of course, I have pictures of family sitting alongside \"Mrs. Ricky Ricardo\" - everyone looking relaxed during the holiday in Palm Springs!\n", "\nLovely bronze bench \"statue\" of Lucy offers a fun photo op in downtown Palm Springs. Not right on the main drag so was a nice surprise when I came upon this.\n", "\nComing upon this statue is somewhat of a surprise, since there are no signs or other indications that it's there on the street. Most people simply just happen upon it by accident as they're walking down Palm Canyon Drive in Downtown Palm Springs (actually, it's slightly off the street).\nThe statue is a life-size bronze likeness of Lucille Ball (who...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/08/22/9d/d9/lucy-taking-a-break.jpg"}]
[{"category": "spot", "review_count": "11", "title": "North Lykken Trail, Palm Springs", "rating_string": "5.0", "address": "Ramon Road, Palm Springs, CA 92262", "review_list": ["\nLast year, we noticed people walking up the mountain when we were sitting at our hotel pool. We looked into the trails this year and we were not disappointed.\nWe spent 3 hours hiking on this trail. It begins on Ramon Street, which is very close to downtown Palm Springs. The trail started up very steep and then wound its...\n\n\nMore  \n\n\n", "\nWent here for exercise and something different. It's a good hike up the hill not for the unfit. That said, I'd say the average age of people we saw on the hill was over 50. It was about 45 minutes to the top and a little quicker coming down but need to be more careful. Great views of the Coachella...\n\n\nMore  \n\n\n", "\nI have been hiking this trail since first coming to Palm Springs. It is a moderately challenging trail offering spectacular panoramic views of the Coachella Valley. There is about a 900 foot elevation gain. The trail head, at the end of Ramon Road, is easily accessible and just minutes from anywhere in Palm Springs. The trail is not particularly well...\n\n\nMore  \n\n\n", "\nI have hiked both the North and South Lykken trails and enjoy the view from the elevation and the continually changing desert scenes. Make sure you take plenty of water with you and are protected from the sun.\n", "\nIf you are new to the are and would like a reasonable hike to see panoramic views of Palm Springs and the valley, this is the hike for you. You can drive to the trailhead at the end of Ramon where there is parking. No water is available so be prepared. This trail start out on the steep side but...\n\n\nMore  \n\n\n", "\nWe didn't do the full hike as it was an insane hot day and we got off to a late start. 8AM.Wished we had started a bit earlier.Next time.Such great views even though we didn't get to do the whole thing\n", "\nThis is a really enjoyable hike with spectacular views directly west and above Downtown Palm Springs. The trail is well maintained and easy to follow; most of the path is relatively smooth, although several sections could be described as steep and rocky. Also, the trail can easily be lost in the descent toward the Museum side of the hike. The...\n\n\nMore  \n\n\n", "\nIf you start at the south end of the trail, it is steep, but once up the mountain it is easy. Fabulous view of P.S. There are other trails at the south end of Palm Springs that are great.\n", "\nNo matter your age, you must take this hike; if only for ten minutes or eight hours. From the parking area at the far west end of Ramon you are quickly on your way up to great views of the valley, and if you are really fit and eager, you can continue up, even to the top of the Palm...\n\n\nMore  \n\n\n", "\nStarted this one at the crack of dawn and I only had an hour to spend so I am unable to give a thorough review. Make sure you find the correct trail head otherwise you will and up on a paths that peter out after a short distance and will end up scrambling up the face of the mountain (like...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/83/55/c4/gonna-get-hot.jpg"}]
[{"category": "spot", "review_count": "34", "title": "Lake Hemet, Palm Springs", "rating_string": "4.0", "address": "About 50 miles southwest of Palm Springs. Take Highway 111 to Highway 74, Palm Springs, CA", "review_list": ["\nJust a 45 min drive from Palm Springs. Great for nature lovers, so beautiful up there. There are picnic tables for a great picnic as well\n", "\nMy family has been going there for years. Great for fishing, boating, or walking. Lots to see and do. Boat rental is fair priced. Camping over a large area. If you want to walk or fish from the bank you can. go on a paved road to the north of the lake. some parking.\n", "\nThis is a wonderful place to get away during the summer months in Palm Springs. It is a wonderful place to take your RV and your family. You can rent little mortar boats, kayaks and fish.\n", "\nWe own a trailer home up in the mountains ( lake Hemet Campground) this we bought from an old couple 3 years ago. It's a nice place to go camping. You could rent fishing boats and kayaks to enjoy the lake or you could bring your own boat like we do. Summer is warm and winter is chilly up there....\n\n\nMore  \n\n\n", "\nStayed 7/03-07/05\nOkay...where do I begin.\nPros: The staff at the marina were incredibly helpful and nice. Gave us tips on times to come for boat rentals for the busy Fourth of July weekend. The staff also gave us some direction to the best fishing spots...which proved worthy...we caught a trout and a crappie...had lots of bites and an amazing...\n\n\nMore  \n\n\n", "\nWent there to fish and look at the new water park. First of all the lake is drying up and the park had more employees working then people in campsites. They have the older group that lives there. It's run down and it was 15.00 a day for two for day. The funny thing is the water park was in...\n\n\nMore  \n\n\n", "\nStopped at the small park here on our trip to the pines. Signs all over no canoes, no entering water, etc. Fishing -boating allowed. Area was clean and was peaceful. Just past the park is a parking area where you need a adventure pass & hiking trails. Locals told us new people have taken over the market/ campground. We did...\n\n\nMore  \n\n\n", "\nA very old campground, with probably 75% of the vehicles full timers, their rigs were not only old, but Many were trashy. There are no 50 amp's, only 30 amp. No cable. We had two couples join us for lunch and they had to pay $25 for a day pass ($5 per person to get into the park, plus $5...\n\n\nMore  \n\n\n", "\nLake Hemet has been a favorite birding stop for me in February for several years. This year I was hoping the birds had rebounded from the fire several years ago, but still, fewer species are found here now than pre-fire. Nevertheless, it is a good place to bird. The lake may have pelicans, several species of ducks, and coots are...\n\n\nMore  \n\n\n", "\nWe went up there with our 4 year old to spend Sunday and Monday.it wasn't too bad good amount of space for your tent and car.They have a fire ring and picnic table at every site great for night campfires.When we got there Saturday night it was all booked and crowded,but majority of people left on Sunday morning.Only couple of...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/5a/5a/be/lake-hemet.jpg"}]
[{"category": "spot", "review_count": "14", "title": "Las Palmas, Palm Springs", "rating_string": "4.5", "address": "Palm Springs, CA", "review_list": ["\nStayed in a really cool rental in old last palmas. Quiet location with wonderful saltwater pool and spa. Beautiful landscaping and modern architecture. Fruit trees on property. Lovely caretaker who kept us informed and safe. I would seek this location again.\n", "\nif your interested in architecture and especially mid century this is not to be missed. probably one of the best if not the best collection of modern architecture I have ever seen in one neighborhood. you can take a tour or do it on your own with a map. allow at least a few hours and get ready to walk...\n\n\nMore  \n\n\n", "\nThis was the original upscale residential district of Palm Springs. Has homes owned by Rock Hudson, Zsa Zsa Gabor, Liberace. Emphasis on privacy for residences. For observant Jews most of Las Palmas is within walking distance of Temple Isaiah Jewish Community Center\n", "\nNo frills. No fees. Just get your bearings, maybe grab a coffee at Koffi, and walk. Now it does enhance the experience if you do a liitle research so you know when you're strolling past Liberace's recently remodeled hideaway, the still cool home of Clark Gable and Carol Lombard, or Cher's place. But really, the charm is all the many...\n\n\nMore  \n\n\n", "\nGreat area to drive around at night for mid-century modern aficionados. I really appreciated the well preserved historical style of home and perfect summer gardenescapes. Architects, designers, landscapers, and architectural lighting designer will enjoy.\n", "\nYou will be a,aged as to who lived here and who built this area, one of the original quarters of Palm Springs and still very upbeat today. No street lights at night as Hollywood came here to see the stars in the sky !\n", "\nThis residential area was home to movie stars. Lots of estates that range from 2 to 4 acres of land. The historical society offers two walking tours of this area that are fabulous. The tours are called the Golden Era of Hollywood Homes on Wed. and the Rat Pack Neighborhood on Tues. They are loaded with tons of fun information...\n\n\nMore  \n\n\n", "\nThis is our second-favorite neighborhood in Palm Springs.\nThe grand old Spanish homes on huge lots probably date back to the 30's and 40's. It is quite traditional. Some of these homes sit on larger lots and are more grand than those in the Tennis Club District. It is quite far from the main strip action on Palm Canyon Drive....\n\n\nMore  \n\n\n", "\nGreat place for a walk. Unfortunately, many homes are hidden. By Very.High.Hedges. Kinda ruins the \"great place for a walk\" vibe.\n", "\nThe Las Palmas neighborhood is a good reminder that, in Palm Springs' case, \"playground of the stars\" was once taken literally. Nestled beneath the mountain in a lush garden of palm trees, jacaranda and bougainvillea, the neighborhood is a treasure-trove of lovely Spanish and mid-century homes that were the weekend getaways of Hollywood A-Listers in the halcyon days of the...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/7a/ff/49/filename-mid-century3.jpg"}]
[{"category": "spot", "review_count": "46", "title": "Palm Springs Visitor Information, Palm Springs", "rating_string": "4.0", "address": "Palm Springs, CA", "review_list": ["\nI didn't realize that this was also a library, so I was surprised to see a sign saying to keep voices low. It was very small, but there were a lot of computers for people to use. They did have some info about Palm Springs. There aren't any restrooms, but the woman working there told me that the Coffee Bean...\n\n\nMore  \n\n\n", "\nWhen the iconic statue was here in Palm Springs many people came to see her. Interesting, she was sent here from Chicago, stayed here for six month, now she's in Japan. Good luck Marilyn.\n", "\nThere's a lot to pick from in the Palm Springs area so a visit here to the visitor information center is advised! You'll come away with all the pamphlets, advice and directions you'll need. It's conveniently located at the foot of the tramway road.\n", "\nMy husband has been very pleased with the info and help he receives when he visits this visitor center. He hikes all different trails when we visit. He gets great info from this visitor center.\n", "\nI went in to ask for directions to the Palm Mountain Resort and Spa. The woman was rather terse and made a comment: \"Oh yeah that is one of those time shares. Then she directed me to the wrong place. It is ironic that the only rudeness and I mean only rudeness we experienced in a week stay was from...\n\n\nMore  \n\n\n", "\nDropped in for some information about Palm Springs, the guy we were speaking with was very nice and told us everything we need.\n", "\nMy wide was looking forward to seeing the statue, the pictures of it need to be removed since the statue has been removed.\n", "\nMarilyn Monroe's statue is not there anymore. Palm springs is just a town in the middle (or close ) too a desert, its very hot in July and everything (attractions, malls, Los Angeles etc) is too far away\n", "\nThere is no Marilyn. Something I really wanted to see. They need to take the picture down.Not really happy about the false advertising.\n", "\nRecently opened in the Welwood Murray Library. Located right in the middle of town on Tahquitz and Palm Canyon. Beautifully restored 1940's building. Friendly staff and a great help. Pick up your BUZZ pass there to get free \"swipe and win\" prizes when you ride the bus. P.S. Historical Society is part of this new location.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/14/da/df/the-girl.jpg"}]
[{"category": "spot", "review_count": "23", "title": "Desert Memorial Park, Palm Springs", "rating_string": "4.0", "address": "Palm Springs, CA", "review_list": ["\nNot sure why this is considered an attraction? Unless you were related to some of these deceased souls, why would you go?\n", "\nFinal resting place of Frank Sinatra, Sonny Bono and a few other stars. Final resting place of my spouse. Bought plot next to him. Only negative is that, being a public facility, it does not maintain separate sections by religious denominations as does Forest Lawn next door. Staff and burial crews courteous and respectful but must pay $150 extra to...\n\n\nMore  \n\n\n", "\nHad to pay our respects to the wonderful Mr Frank Sinatra who rests in this beautiful area. A place he lived and loved\n", "\nIf you like visiting cemeteries or you were a fan of Frank Sinatra go! Otherwise don´t waste time. It looks like a typical cemetery in the US.\n", "\nMany movie stars are buried here. Frank Sinatra is one. Pick up a map to locate stars. Frank Sinatra's grave is just a plaque and some people leave small bottles of Jack Daniels there. His best friend Jilly is buried next to him. Also his mother Dolly.\nTake the P.S. Historical Walking Tour on Friday's 9:30 and hear more about...\n\n\nMore  \n\n\n", "\nAlthough there are many famous people buried here such as Frank Sinatra and Sunny Bono this is a park for the locals where they place flowers . Al the flowers are taken off the tombs every Wednesday evening so Thursday is a day many locals gomthere\n", "\nAlthough I go primarily to visit a loved one that is interned, I am distrubed by some of the markers I see from other grave sites. I don't know if it is the material of the marker or the lack of maintenance. I would think that someone would show some caring by making them presentable. I took a couple of...\n\n\nMore  \n\n\n", "\nClean kept cemetery and so very peaceful! There are many famous people buried out here including Frank Sinatra and Sony Bono. Go inside the main office and they will be happy to give you a chart as to who is buried where. It is such a nice walk to find those you remember. We will be back and thank you...\n\n\nMore  \n\n\n", "\nWe stopped at Desert Memorial Park to pay our respects to Ole Blue Eyes Frankie Sinatra and I've Got You Babe Sonny Bono. Beautiful, peaceful resting place.\n", "\n... and in a quiet, beautiful memorial park, we were able to find Frank Sinatra's grave site along with his parents and other celebrities. [Frederick Loewe of the Broadway musical team: Lerner and Loewe.]\nWe found the gps coordinates on line and followed them right to the memorial park. We were surprised how easy it was to locate and how...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/22/26/bf/grave-of-frank-sinatra.jpg"}]
[{"category": "spot", "review_count": "21", "title": "Palm Springs Open Air Market, Palm Springs", "rating_string": "3.5", "address": "450 N Indian Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nA great night out for eclectic shopping & street food. Lively & interesting with lots of local street musicians, bakeries, farmer fresh vegee & fruits, art crafts & artists works, fabrics, paintings, sculpture, fireplaces, inexpensive stuff displayed for sale & very rich as well ...YOU NAME IT! Stroll along the street for blocks & blocks, even if you just want...\n\n\nMore  \n\n\n", "\nWe go down town to the Village Fest each trip to Palm Springs. Currently (10/15) there is some construction going on which takes away from the atmosphere only slightly. There are vendors for crafts, jewelry, pottery, and produce. We like to pick up some dates, breads and jerky for our stay. There are entertainers and artists. This visit I purchased...\n\n\nMore  \n\n\n", "\nThe Thursday night market downtown is always a great evening. Combined with dinner, in one of the many restaurants on the strip and it is even better. From gadgets to beautiful pottery and clothing, there is something for everyone. Now, once you have done this before, it is pretty much a no-surprise event but still, we would totally recommend it...\n\n\nMore  \n\n\n", "\nIt’s your typical street fair/open market, no different from what you would find in any small city or town. Maybe, for the locals, it is fun to get out and support their community. As return out of town visitors, and done in conjunction with dinner, walking the entire length of vendor booths consisting of arts, crafts, and food products one...\n\n\nMore  \n\n\n", "\nFinding parking can be a problem as the main car parks close to the Market fill up quickly & street closures frustrate the Sat Nav, we parked for free in the multi story car park opposite the Art Museum & walked 5 minutes to the top of the market area. The market seems to be divided into thee main areas,...\n\n\nMore  \n\n\n", "\nI guess this is their way to lure people out on hot desert nights but after visiting once, I wouldn't go back. Although they had some nice art and crafts and limited food there was little to get excited about. Sorry, but I'll stay indoors to shop and eat next time. Other cities get more support from vendors and customers...\n\n\nMore  \n\n\n", "\nIf you are not use to desert weather, you may not want to come out during the day. You also don't see many people walking around because it is so hot. This night market reminds you there are a lot of people who come out in the evening when it is a little more bearable. Lots of food booths. Some...\n\n\nMore  \n\n\n", "\nYes there are a lot of people but it's great that local artisans have a good showcase for their products, many of which are inventive and cool as well as the soap etc guys. You are in Palm Springs, it's Thursday, you only have to walk 300m max from your hotel, go and have a wander.\n", "\nIf you're looking for a peaceful little evening stroll looking at quaint crafty things this isn't it! Mobs of people, greasy food smells, noise and junky type articles for sale.\n", "\nWe stayed a Thursday night in Palm Springs so we could visit the market. I am glad we did , it was a really enjoyable way to spend an evening . I don!t know why someone else said it was 5 dollars to get in as I can not see how it would be possible to charge.I think they were...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/09/67/75/b7/palm-springs-open-air.jpg"}]
[{"category": "spot", "review_count": "10", "title": "Tennis Club District, Palm Springs", "rating_string": "4.5", "address": "Palm Springs, CA", "review_list": ["\nFun to bicycle through this neighborhood with hotels from the 1930s (Ingleside Inn is our fave) and homes that are tasteful, not McMansions. Finish with a hike up North Lykken trail and look down on the same area.\n", "\nCan' help but feel the rat pack is hanging out here. Quiet neighbourhood with funky hotels and boutique hideaways\n", "\nThis area is abuts the downtown district and has many small boutique hotels. Really nice to come in early December for the Inn walk when the hotels are open and you can see the unique rooms.\n", "\nWalking distance to Palm canyon drive, near three different museums (art, architecture & design, and historical) and lots of mid century buildings. We have a timeshare at the tennis club and look forward to our visit to the area every year.\n", "\nWe stayed at the time share section of the tennis club and had a great room close to the pool. Everything is well kept up and maintained, the front desk was very helpful to us and it is close to down town Palm Springs\n", "\nWe have stayed at boutique hotels in the Tennis Club District and absolutely LOVE this location! It is quiet, safe, and easy walking distance to the restaurant/shopping area. It is also walking distance to great hiking trails, Museums, Thursday night street fair, etc. etc. We went to Palm Desert, and some of the other outlaying towns during our visit, and...\n\n\nMore  \n\n\n", "\nSo much history here in the Tennis Club area. One of the largest concentration of Bed and Breakfast. There are over 20! Great examples of modernism….one of the largest concentrations in the whole USA. If you take the Palm Springs Historical Society tour on Thursday at 9:30 called the Exclusive Tennis Club Enclave, you will learn the history. Call 760.323.8297...\n\n\nMore  \n\n\n", "\nBaristo Road pretty much marks the beginning of the best part of this \"historic\" tennis club district. Walking in a southerly direction, the true beauty of these lovingly restored and painstakingly maintained huge estates reveals itself. Back in the day, when the great old-time stars walked this area (making it their playground), this was where it all happened. This is...\n\n\nMore  \n\n\n", "\nIf you just want to walk or drive around beautiful houses and neighborhoods in Palm Springs, this is the place. What a beautiful view right up against the mountain with many historic homes and the amazing Tennis Club.\n", "\nit is a very nice neighborhood especially because the Old Ranch Inn is located in it. It is near town so you can walk there easily. The Tennis District is nice to walk around and admire many different styles of homes.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "12", "title": "Palm Canyon Trail, Palm Springs", "rating_string": "4.5", "address": "Palm Springs, CA", "review_list": ["\nWe drove up here after hiking the Murray Canyon Trail in the early morning. At 10a it was PACKED. I don't think that I would recommend this trail if you are looking to have it to yourself! Murray was much quieter and had great landscape changes!\n", "\nwell well worth a visit , the park ranger was amazing , we forgot our water and he supplied us with a few bottles and tonnes of information , interesting and stunningly beautiful , a must go and see for sure\n", "\nA nice trail for most ability levels. Easy to extend your hike to the 6 or 9 mile loops. The longer routes take you to many variations of land and flora.\n", "\nThis hike in the Indian Canyon ($7 per senior and $9 for adults) is quite beautiful and fairly easy. You could go on for about 15 miles one way, but it starts getting fairly difficult after about 11/2 miles one way. I always hike this beautiful canyon and love the many, many palms. They give nice shade when the day...\n\n\nMore  \n\n\n", "\nWe went to Joshua Tree National Park and we paid $15.00 per car to go through . Here at Indian Canyon because it is on Indian Land we paid $7.00 (senior rate) per person to hike.\nI loved this trail we did the entire circle and it is forever changing. Not a difficult trail but lots of variety. A bit...\n\n\nMore  \n\n\n", "\nI'm not sure why the apparent difference in pricing from the previous review, but I was there in late December 2014, and the cost to park in the campgrounds at the Palm Canyon trailhead, was $8.00 for the car, not per person. The trail is fairly easy until you get close to the palm oasis, where you'll start scrambling over...\n\n\nMore  \n\n\n", "\nThis trail was so highly touted that I was excited to see for myself. What a disappointment! It is on tribal land, so there is a $9 per person entrance fee. Not per car . . . per person. After passing through a few palm groves, it is miles of nothingness. Just a dirt trail surrounded by varying shades of...\n\n\nMore  \n\n\n", "\nGreat trail. Easy to moderate. Trail through the palm trees was unexpectedly awesome. Best of the hiking we did over several days\n", "\nLoved the unusual walk among giant- PALMS! cool and mysterious, unlike any other hike we've been on.\n", "\nThe largest and most impressive of the \"Indian Canyons\" south of downtown Palm Springs, Palm Canyon is the largest natural oasis of desert fan palms in the United States and home to the \"Palm Springs\" which give the nearby town its name. There is a vistor center, a refreshment stand and a gift shop at the top of the slope...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/18/f4/80/breathtaking-stone-pools.jpg"}]
[{"category": "spot", "review_count": "69", "title": "Boomers! Palm Springs, Palm Springs", "rating_string": "3.0", "address": "67-700 E. Palm Canyon Dr., Palm Springs, CA 92234", "review_list": ["\nThis place is a joke. Prices are near the same as scandia, but with none of the benefits. Most things are in disrepair and not working, and the things that do work aren't worth the price. So honestly, take the hour trip out to scandia, you'll have a significantly better time.\n", "\nWe stopped in for a quick family race after shopping at Trader Joes. The karts and track are well maintained and they do give you considerable time to race. The karts aren't super fast, but go fast enough to slightly drift on the tighter corners.\n", "\nThe title says it all. It's not bad if you're in the desert looking for something quick to do. They need to improve their establishment. It's dirty and could use some cleaning up.\n", "\nBeen visiting this place since 2010 & it's gone downhill fast.\nDue to the heat during the day we tend to come to play mini golf at night, big mistake! A significant number of the lights weren't working making the course pretty difficult to navigate although it did make for some interesting poses (including \"the flamingo\" where I was stood...\n\n\nMore  \n\n\n", "\nGo carting was the best part of the visit...taught my son to drive the curves as well as race him head to head before we left...he won! Bumper Boats were fun to beat the heat. Arcade was load and older games.Place was fun to pass the time away but overall feeling is that the place needs a refresh.\n", "\nThey need a big time makeover and update. Defiantly short on staff. My boys did the race car track and their cars broke down. Lighting is poor.\n", "\nWe went to drive the go carts and they had to be the slowest carts I have ever been on. Geared great for the family birthday party scene. Loads of arcade machines to play on, great that you don't need and coins or tokens. One price pays for use of all the park activities.\n", "\nI have been to many Boomers and this one by far was the worst. We went at night because Palm Springs is so hot and all along the course the lights were out so you couldn't see where to hit the ball to make it in the hole also the green along the course was torn in place. Don't waste...\n\n\nMore  \n\n\n", "\nMini golf and karts. A little tired and not the most attentive staff. Good fun but so very hot. Not enough shade waiting for the karts or on the mini golf courses. Have been going to Boomers for years every time we visit. Make sure you go when they have deals on. $15 unlimited rides. Wouldn't pay full price for...\n\n\nMore  \n\n\n", "\nCouple of suggestions...a larger awning over the go-kart line, misting sprays (the drought can handle a little misting here and there), UPSCALE the prizes (Golf Land in Sunnyvale has the best by far...), and pay the staff who have to stand in the heat and fumes of the go-kart's a ton of money because it's inhumane to have them in...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/4e/9e/48/mini-golf-course.jpg"}]
[{"category": "spot", "review_count": "8", "title": "The Mountain Station, Palm Springs", "rating_string": "5.0", "address": "Palm Springs, CA", "review_list": ["\nStunning views of valley and mountains. Nice walking path.\nSledding available in winter. 2 movies about San Jacinto Mountains and building the tram and replacing it with the new tram very interesting. Busy restaurant area with indoors and outdoor seating or you can bring your own food.\n", "\nAt the top of the Palm Springs Aerial Tram you are at 8516 feet above sea level, and as you exit the tram car you are at Mountain Station. The aerial tramway is the world's largest rotating tram car making one complete rotation as it climbs from the base station in Palm Springs at 2643' taking approximately 10 minutes to...\n\n\nMore  \n\n\n", "\nThe Palm Springs Aerial Tram is one of the highlights of Palm Springs. Built in 1963 and designed by a famous Palm Springs Architect. You will travel thru several climate zones to get to the top. The temperature will be 30 degrees cooler from the bottom to the top….so make sure you wear the correct clothes. There is a restaurant,...\n\n\nMore  \n\n\n", "\nThe temperature in the tram parking lot was 120F. We caught the tram and it was a comfortable 73F at the top. There are over 50 miles of trails at the top ranging from easy to steep. We took a moderate 5 mile loop. The return stretch, from the ranger station to the tram, is steep - we had to...\n\n\nMore  \n\n\n", "\nIt was great the tram was fun and once you get to the top you can hike around and the view is just breath-taking!! A must-do!!\n", "\nWell if drove all the way out to the tram, you might as well ride it up and spend a moment at Stewart Williams' wonderful Mountain station. It needs some restoration, but you can see the beauty of the bones and enjoy the spectacular views of the Coachella valley beyond, and savor the multiple opportunities for hiking in the cool...\n\n\nMore  \n\n\n", "\nIn a few short minutes and seven or so ecosystems later, you're at the top of the tram, 9,500 feet above the floor of the Coachella Valley. The mid-20th century architecture by noted area architect E. Stewart Williams is cool, with blazing fireplaces in winter.\nA series of easy day hiking opportunities are within a short, moderately strenuous walk (the...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/05/74/60/f3/beautiful-view-from-the.jpg"}]
[{"category": "spot", "review_count": "13", "title": "Demuth Park, Palm Springs", "rating_string": "4.0", "address": "4365 Mesquite Ave, Palm Springs, CA", "review_list": ["\n8 pickle ball courts and the regulars were warm and welcoming. Convenient location. Several other activities as well.\n", "\nBe careful of the homeless and the dog poop. This park is not pretty and even the tennis courts are not good. It is public and free and under man trees in the summer.\n", "\nDemuth Park offers pickle ball for everyone-whether your fancy is indoor pickleball or out-of-doors pickleball. USAPA pickle ball has come to Palm Springs! Monday through Friday pickle ball can be played at the Demuth Gym from 7:00AM-10:00 AM. Play is on badminton courts with ASAPA approved nets. Music sets a fun vibe. Water is available and there is a roof...\n\n\nMore  \n\n\n", "\nThis is a great park to go watch soccer on Sundays. A large group of Latins congregates and play soccer in this park. But beware of playing tennis as it is behind waste treatment center.\n", "\nA very nice park to enjoy soccer, softball, or playing with the kids. There are nice fields, a snack bar, and clean restrooms. There's always something to do there.\n", "\nThe park itself is not a bad place to be. The kids playground, the tennis courts, the soccer fields are the main entertainments areas of the park. Sometimes, the park smells since the suer plant is not fa away from it.\n", "\nThis park has everything. Tennis Courts, baseball diamonds, soccer fields, play ground equipment. The Palm Springs Animal Shelter is located here. Excellent example of modern architecture.\n", "\nIn addition to the very nice grounds, fields, and play equipment (very extensive open space), there is also a building that houses a basketball gymnasium, restrooms inside, and a very helpful employee who explained to us what services they provide here.\nWe thought the neighborhood older but well maintained and seemed very safe.\n", "\nDumuth Park has somewhat of a bad rep in town, which I really don't understand. I love it for the fact that it contains Palm Springs' only community garden.\n", "\nWe took our 2 1/2 yr old granddaughter there and really enjoyed the kids play area.Her favorite was the stone turtles with a water sprinkler on a timer embeded in its back, safe and fun way to cool off.there are lots of tables for picnicking too. It's close to the airport so it was great seeing the detail on the...\n\n\nMore  \n\n\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "23", "title": "Palm Canyon Theatre, Palm Springs", "rating_string": "3.5", "address": "538 North Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nJust perfect venue size for watching your favorite play or concert. Staff is welcoming. Concession staff was friendly and kept the line moving fast to handle all the traffic. Clean auditorium. They could use an update on the seats.\n", "\nI totally support local live stage shows & theaters, and thoroughly enjoy live performances. This theater is a local gem, roomy and comfortable seating and not a bad seat in the house...the stage is large enough to accommodate most plays/shows and is home to many local stage actors who tackle and perform these live productions.\nWhat a treat to enjoy...\n\n\nMore  \n\n\n", "\nEnjoyed \"Anything Goes\" on our recent visit to Palm Springs. The theater has old charm. And the performance was outstanding...lots of performers on a small stage. Wish I would be there to see their next show, The Full Monty.\n", "\nThis local theatre showcases some of the best talent in the Palm Springs area, as well as from professionals. I have never been disappointed.\n", "\nIt is a great place to catch a great show and enjoy a night in the heart of Palm Springs! The actors are wonderful, and when you visit the theatre, you get a glimpse of history with the architecture of the building. Great people who work there too and very happy to see you! You won't be disappointed!\n", "\nMy wife and I have just returned from seeing The Addams Family musical at PCT and felt compelled to write a review straight away.\nWhen we arrived in Palm Desert we looked at entertainment events to do and decided that this would be a good night out. We really had no expectations of what it would be like so were...\n\n\nMore  \n\n\n", "\nYou will be amazed at the quality of the productions. Actors, scenery, top rated plays, seating, parking and ease of going to the theater. Very professional productions!!! You can park and dine at some of the best restaurants in Palm Springs before the production - Copley's, Birba, Jakes, Trio's, Eight Four Nine. Price of plays are reasonable.\n", "\nHigh school amateurs. The sound was poor and the performances were not noteworthy. It was just not very good.\n", "\nI love local theater as well as professional Theater but I can't understand how a theater with so much history can produce such mediocre productions. I thought maybe it's because they try to do to many shows in a year and don't get enough rehearsal time or maybe it's because when you look in the show program you can often...\n\n\nMore  \n\n\n", "\nHave been to several shows at PCT and most have been pretty good. This one hit a new low. We walked out at intermission. Fortunately we arrived early enough to pull up the synopsis of the book on the iPhone. Without it I'd have had little idea of what was actually happening. I have a feeling there was a lot...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/04/90/98/df/palm-canyon-theatre.jpg"}]
[{"category": "spot", "review_count": "11", "title": "Village Green Heritage Center, Palm Springs", "rating_string": "4.0", "address": "219-223 South Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nThe Village Heritage offered us an easy walk through of Pam Springs History. It is located in the center of town. Easy access while strolling on Palm Canyon Drive.\n", "\nEverything was closed when we stopped by, and there was a dearth of signs/information to explain its significance.\n", "\nLimited amount to see. Easy for people to miss entirely as it is set back from the main street. The outside of it is quite dark making it even easier to miss. Interesting local history, however.\n", "\nIf you like history or knowing more about the area you're visiting then the Village Green has it all for free ($1.00 donations appreciated). The two oldest buildings from the area- refurbished McCallum House (late 1800's), and an authentic adobe with the history of Palm Springs and all the Hollywood visitors, and Rudy's \"store\" with authentic products from the 30's...\n\n\nMore  \n\n\n", "\nIn the heart of Palm Springs is the Village Green home to several historic sites. They include the McCallum Adobe and Cornella White's House, Ruddy's General Store and the Agua Caliente Culture Museum. All four sites are worth some of your time. It is a conglomeration of Palm Springs history and gives great incite to Palm Spring's early development. In...\n\n\nMore  \n\n\n", "\nThe Village Green has two of the oldest houses in P.S. and the headquarters of the Palm Spring Historical Society. McCallum Adobe has a museum and the White House is a replica of life in the early days. Historical Walking Tours can be booked here. 760.323.8297.\n", "\nThere is one little furnished house you can go into. A small museaum and a grocery store where they charge $1 to get in. Not impressed.\n", "\nLoved it! Three small museums right downtown illustrate early life in Palm Springs. The Agua Caliente Cultural Museum shows the culture and history of the Cahuilla tribe. (Free) The McCallum Adobe has great photos, a video, and memorabilia gathered by Palm Springs Historical Society. Rudy's General Store Museum is a re-creation of a 1930s general store with all authentic merchandise....\n\n\nMore  \n\n\n", "\nThe volunteers here were extremely helpful with information about the area. A good stop to help you focus your touring.\n", "\nthis is a great place to start to learn just how P.S. came into being and how it developed with the assistance of Hollywood. i'd recommend that you take one or more of their very worthwhile walking tours, given by volunteers, ($15, quite reasonable).\nwe particularly enjoyed Vicki's tour on saturday morning, as she was born and raised in P.S....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/94/7f/1f/village-green-heritage.jpg"}]
[{"category": "spot", "review_count": "7", "title": "Palm Springs Swim Center, Palm Springs", "rating_string": "4.5", "address": "405 S. Pavilion at Baristo Road, Palm Springs, CA", "review_list": ["\nVacationing here 3X a year, and I can always count on the hidden jewel. Each day an workout that can not rival the indoor pool that I use in Boston. You must try this poll, it is so convenient. Outside swimming is best, the views are amazing.\n", "\nThis pool is open to the public during the summer. You can buy passes to swim laps for exercises. They have lockers and restrooms. Built in the 1970's and designed by local architect Hugh Kaptur.\n", "\nMountains. Palm Trees. Mountains. Palm Trees. (these were the views as I breathed left/right during my 45 minute outdoor swim) Ahhhhh.\nMy husband and I are regular (indoor) lap swimmers and the pool at the PS Swim Center is AMAZING! Clear. Warm. WOW! What a resource Palm Springs has...for a $5 guest fee you will not go wrong for some...\n\n\nMore  \n\n\n", "\nThis City pool is Olympic Sized and hosts many swim meets where our local Piranha Swim Team meets. It boasts a very nice deck with ample changing and showering facilities.\n", "\nwe as a family have used this facility for over 25 yrs now - love the place - have had kids take lessons here - kids have had parties here - i have taken excercise classes here - you can do early morning laps as well\n", "\nThe outdoor pool access is at the very end of Pavilion Dr; good free parking available in nearby lot. Non-residents pay $5. They post the pool temperature at the entrance before you go in.\nThe change area is open to the sky with a small roof to provide some shade or protection from occasional rain. Bring your own lock if...\n\n\nMore  \n\n\n", "\nBeautiful lap pool, which was very uncrowded during the day. Since I was on vacation, this worked. They also have early morning lap swim hours. Lots of shade as well.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "5", "title": "Antique Galleries of Palm Springs, Palm Springs", "rating_string": "4.5", "address": "505 E Industrial Pl, Palm Springs, CA 92264", "review_list": ["\nGreat variety, great prices. Near a bunch of other antique stores. Eat at Townie Bagels near by. Nice sales staff. Clean and orderly. Great for men and women. Eclectic galleries.\n", "\nBeautiful antiques around every corner and helpful friendly workers with a wealth of knowledge regarding their wares.\n", "\nWhat a great find. This is not your run of the mill antique store. Tons of mid century items. Huge selection. Must see for anyone who enjoys vintage shopping.\n", "\nWe heard of this area near our hotel. The shops are very interesting and you can spend hours walking through them. There are new shops opening up soon and the area will attract more visitors . The parking in the area is good and easy to walk to all the shops.\n", "\nAntique Galleries of Palm Springs is the keystone for the new area, the Shops of Sunny Dunes West. This area has slowly over the years attracted small independent shops. The new Antique Galleries has really given weight and presence to this formally under the radar neighborhood.\nThe galleries offer a variety, they are individually owned, of items both new and...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/0a/05/6e/b9/antique-galleries-of.jpg"}]
[{"category": "spot", "review_count": "51", "title": "PS Architecture Tours, Palm Springs", "rating_string": "5.0", "address": "901 N. Palm Canyon Dr., Palm Springs, CA 92262", "review_list": ["\nTrevor was a great guy to lead our group of six. We learned about the history of Palm Springs, and why it is the world leader in mid-century modern architecture. I never knew I would like architecture so much. Learning should always be this fun.\n", "\nfor anyone visiting Palm Springs and interested in its history, and for everyone with any interest in 20th century architecture. My husband and I are retired, well educated, world travelers. We have been taking tours throughout the world for the last 45 years. When I say this tour was just about the best tour ever taken, I do not make...\n\n\nMore  \n\n\n", "\nTrevor's wealth of knowledge and love of Palm Springs architecture was infectious. We had so much fun hearing his stories and antidotes of the modernist architects and the architectural evolution in the area. His tour wasn't rushed. He took time to answer all questions and allowed for great picture shots.. And a plus=great air conditioned van!\n", "\nI was in Palm Springs lat week. I have beeing going there for years, but have never taken a Modernism Tour. I'm so glad I found PS Architecture Tour. Trevor O'Donnel really knows his stuff and he is so excited to share his knowledge and enthusiam for Modernism. His style is converstional and fun. I never felt that we would...\n\n\nMore  \n\n\n", "\nI highly recommend spending the morning with Trevor O'Donnell and seeing Palm Springs through the eyes of one so knowledgeable, friendly and passionate about architecture. Fortunately, I took the tour with PS Architecture Tours at the beginning of my visit to Palm Springs. It set the stage for the rest of my trip and I appreciated having knowledge about local...\n\n\nMore  \n\n\n", "\nWhat a fabulous way to see Palm Springs in 3 hrs - a must for anyone interested in Modernism - its history, the present and future....\nI've been coming to PS for 6 years but this was my first tour with Trevor. He was so knowledgeable and so much fun. The tour went by so quickly it was hard to...\n\n\nMore  \n\n\n", "\nThe highest praise for Trevor and the tour he gives of Palm Springs architecture, focusing on the mid-century/modernist residences for which Palm Springs is known. Trevor's knowledge is encyclopedic but his delivery is easy, conversational, grounded in wonderful stories of the architects and the owners. The 3 hours flew by and when i came home I was inspired to learn...\n\n\nMore  \n\n\n", "\nVery Informative. Very Interesting.\nHistory brought to life.\nGreat way for us to start our first experience to Palm Springs.\nOur guide, Trevor, shared his knowledge and passion for the history and current events of Palm Springs.\nWe had 4 people in our three hour mini van tour around Palm Springs neighborhoods. Lots of pictures, conversation, Questions/answers and a few...\n\n\nMore  \n\n\n", "\nI just enjoyed a Modernism tour of Palm Springs with PS Architecture. The knowledgeable owner, Trevor O'Donnell, provided insight and highlights of the unique Mid-Century architecture. This 3 hour tour was the high point of my trip to Palm Springs. I highly recommend this tour for anyone visiting the desert!\n", "\nWe took a very nice tour on our last day in the Valley. I had a lot of questions for him and he had good, detailed answers for all of them, and wasn't afraid to say it when he didn't know. I also learned that there are many really interesting places to stay and see in PS that I wouldn't...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/9e/de/70/ps-architecture-tours.jpg"}]
[{"category": "spot", "review_count": "16", "title": "Palm Springs Mod Squad, Palm Springs", "rating_string": "5.0", "address": "1800 East Palm Canyon, Entrance of the Saguaro Hotel, Palm Springs, CA 92264", "review_list": ["\nWe specifically planned a few days in Palm Springs to sample its Mid-Century architecture and reviewed several of the tours on TripAdvisor. This is the one that worked for our schedule and what a treat it was.\nOur guide, Kurt, picked us up promptly at the Saguaro Hotel at 11:00 AM. There was one other couple and we all got...\n\n\nMore  \n\n\n", "\nI am SO GLAD I took this tour. With only two nights in Palm Springs and a passion for mid-century modern and desert architecture I needed help to get value out of the short time.\nThe reviews on TripAdvisor do not lie.\nKurt is clearly passionate about architecture and design, he was a wealth of knowledge and historical context. This...\n\n\nMore  \n\n\n", "\nKurt and the PSModSquad are amazing. We did an architectural van tour and I loved every second. Kurt is personable, funny, and insanely knowledgable. I loved learning about the history of old Hollywood and Palm Springs and even the current events happening. From local starchitects and famous homes of celebrities to new construction beauties, Kurt showed us everything in 1.5...\n\n\nMore  \n\n\n", "\nWe took the Essential Palm Springs Tour which consisted of a 90 minute van tour viewing important mid century landmark buildings and residences. Kurt's extensive knowledge of the architects, their buildings and the people that lived and worked in them was exceptionally informative and entertaining. By the end of the tour we had a deeper understanding and appreciation of this...\n\n\nMore  \n\n\n", "\nMy girlfriend and I did the Interiors Tour and it was the highlight of our trip to Palm Springs. Our tour guide, Kurt, took us into three mid century houses dotted in various neighborhoods throughout the city, all while providing a fascinating narrative about the history of the homes, the architects involved, and the design elements used. In addition to...\n\n\nMore  \n\n\n", "\nWe were in Palm Springs celebrating my Mother's 85th birthday. We booked a tour for four of us and Kurt was so accommodating.\nThe tour was amazing! He knowledge and enthusiasm is unsurpassed. We learned so much. Some of us were fans of Post Modern architecture and some weren't but by the end of the tour, we all had such...\n\n\nMore  \n\n\n", "\nVery informative and interesting tour - really easy to arrange and an awesome way to get an overview of the amazing architecture in Palm Springs. Thank you Kurt!\n", "\nWe took our tour with Kurt to see old Palm Springs and the mid-century modern architecture we love. We got so much more! Kurt took us all over Palm Springs-up into the hills, downtown, to the mid-century modern we love and all along he spoke giving us a history lesson, architecture lesson and city information. He is so knowledgeable! We...\n\n\nMore  \n\n\n", "\nIf you love architecture and/or mid century modern and/or Palm Springs, then take the Mod Squad tour. In 90 minutes, you'll learn about the much of the city's architectural history and so much more.\nKurt, your tour guide, is knowledgable, friendly, and drives very safely.\nTake this tour. You'll thank me later.\n", "\nKurt has so much knowledge to share of mid century modern architecture of Palm Springs. Our tour was stretched longer then planned travelling driving around the different neighbourhoods in the area in his comfortable van. You'll be sure to enjoy this tour as Kurt has lots to share of the celebrities that made Palm Springs their home or vacation getaways!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/08/23/30/6c/palm-springs-mod-squad.jpg"}]
[{"category": "spot", "review_count": "97", "title": "Smoke Tree Stables, Palm Springs", "rating_string": "4.5", "address": "2500 Toledo Avenue, Palm Springs, CA 92264", "review_list": ["\nExcellent experience. We are a family of 4 and booked a 3pm 1 hour ride. It was just us and a very nice ranch hand called Tony 'Blue'. Lovely gentle horses and great desert scenery. Highly recommended.\n", "\nSafe, friendly, and fun describe our Stables' experience. Manager, wranglers, and guide asked us often if we felt comfortable and were enjoying the ride on our respective horses. All four of us adults did.\n", "\nThree generations, five in all: three adults and two children aged ten and twelve, booked a private ride for 8:30 in the morning ahead of the crowds we thought. Only our ten year old had ridden regularly for the past five years. The rest of us were experienced only in our imaginations.\nSaddled up we headed out to ride the...\n\n\nMore  \n\n\n", "\nGood introduction for a novice. Gentle, well trained horses. Of course they are used to walking in line with strangers on their backs. Overall, great guide and run ride. The one hour ride is basically in the wash, but is quite and calm. The staff are very attentive to new riders and make sure they are comfortable throughout.\n", "\nMy husband and I had planned a day trip to the Palm Springs area specifically to go riding. Me being an experienced equestrian wanted something where I could actually ride and not be a \"passenger\" yet still safe for my beginner husband. Great desert views (can't find anything like it in MIchigan!) our guide Sal was great, the horses were...\n\n\nMore  \n\n\n", "\nWe really enjoyed our 2 hour trail ride in Indian Canyon. The guide, Alex, was friendly and informative. The horses were very gentle. We are not experienced riders but felt safe and relaxed. It was wonderful getting so close to the desert and hills.\n", "\nI had wanted to go horseback riding in Palm Springs and Smoke Tree Stables was recommended to us by our hotel. From my husband's first telephone inquiry, every part of the experience was excellent. They are very thorough about vetting the riders by age and experience and pairing them with the appropriate horses. Our guide, Buck, was very patient, obviously...\n\n\nMore  \n\n\n", "\nHad an amazing time on the canyon ride with a great guide. The highlight of the ride was seeing three bighorn sheep up in the mountains!\n", "\nOur entire experience with everyone (including the horses and dogs) was fantastic. My wife and I hadn't been horseback riding in years and wanted to see more of the desert around Pam Springs. The horses were gentle and easy to work with. And our guide gave us a terrific tour of the canyon, noting the plants and animals we saw...\n\n\nMore  \n\n\n", "\nThis is by far the best way to see the canyons, the staff and guide were amazing and very knowledgable about the area pointing out thing of interest you wouldn't see on your own.\nThe horses were very well trained and appeared to be well looked after and most of all happy, only having ridden a horse once before I...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/3b/bb/eb/the-stables.jpg"}]
[{"category": "spot", "review_count": "127", "title": "Spa Resort Casino, Palm Springs", "rating_string": "3.5", "address": "100 N. Canyon Drive, Palm Springs, CA 10021", "review_list": ["\nEverytime I'm in Palm Springs I make sure to spend some time here. The casino is located 1 block from downtown PS. The restaurant food is excellent and the employee's helpful and polite. It's too bad the old Spa Resort Hotel was torn down because this was the place to stay. Hopefully the hotel will be re-built.\n", "\nNo $5.00 blackjack tables, no carp tables and very crowed atmosphere with to many video machines to close together. It is designed to be very noisy. People are smoking and the odor is apparent.\n", "\nFood and Beverage employees come to work sick-if not they receive points against them for calling off. Handling food with the flu is risky for a fun vacation time!!! The points encourage spread of illness and disease. The Spa Resort Casino is a tiny casino, not loose slots and not very good food options. Children were not allowed in the...\n\n\nMore  \n\n\n", "\nWe were entertained with the machines but they don't pay out much, so be careful not to loose more than you can handle, hoping to win. Points don't ad up fast, so don't count on points either. We settled on having the Lunch Buffet there & it had a great selection of food. My husband & I enjoyed the atmosphere...\n\n\nMore  \n\n\n", "\nThis casino no longer has the hotel, but it's super clean, very well kept up and tends to pay out on the slot machines better than any other casino I've been too - plus it's convenient and a lot of fun,\n", "\nSpent a few fun filled hours at this casino dident win anything though it was very nice and had a good restaurant we just had some snacks so don't really know what food is like fun time.\n", "\nThe casino is very pretty. The woman's bathroom is beautiful and clean. But the big problem for us was the smoking. We couldn't stay very long. The staff were friendly.\n", "\nMany machines to play, b,ack jack tables, roulette and the restaurants are so good. There is a huge buffet several days a week !\n", "\nI really enjoyed this casino it is not so huge that you get lost it is beautifully decorated although a bit smoky. I won enough to buy new pair of shoes so I was happy.\n", "\nTheir slots machines are stupid and we dealt with a very mean, power-hungry pit boss, but the cashiers were very nice. Most of us made a little money.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/01/53/e6/36/spa-resort-casino.jpg"}]
[{"category": "spot", "review_count": "23", "title": "The Spa at the Andreas, Palm Springs", "rating_string": "4.5", "address": "227 N. Indian Canyon Drive, Andreas Hotel & Spa, Palm Springs, CA 92262", "review_list": ["\nFirst let me say that all the spa technicians were awesome! But that is it. I have been to many first rate spas in many locations and never have I been so disappointed with a spa. It is very small; as one of the other reviewers stated the changing area alone should have been the tip off. We had the...\n\n\nMore  \n\n\n", "\nI had such an enjoyable day at the Andreas Hotel and Spa. We spent the day relaxing in the jacuzzi, eating wonderful food and drinking champagne by the fireplace. I had a great massage from Angel and would highly recommend the 60 min facial from Lorena! We were treated very well by Lynne and all the staff!!\n", "\nI rarely get a massage at a hotel spa as I question value and experience; but was completely surprised at the Andreas in Palm Springs. My masseuse was so qualified and talented and in just an hour massage transformed my body for the day. She was among the best I have ever had. Don't hesitate to try this spa. #88388\n", "\nSmall tucked away spa that aims to please. We did a couples massage which had champagne for starters. The room had a fireplace by the jacuzzi with fruit plate, juice and water. After our excellent massages by Marcy and Angele who were both very skilled and very professional, we had chocolate covered strawberries!! It was a nice pampering to our...\n\n\nMore  \n\n\n", "\nWe're really glad we found this place - great combination of old style Palm Springs but newly renovated; really close to downtown PS, but pretty quiet; and a small resort with very friendly staff that caters to you and gets to know you by name. The Queen room was just big enough with large bathroom, well furnished, clean and cozy....\n\n\nMore  \n\n\n", "\nThe girls and I had a spa day at Andreas Hotel and Spa. We were treated like Queens. It was a wonderful relaxing experience. Blair and Xenia were amazing. The hot tub between sessions was relaxing. The food was amazing. Thankyou Lynne. To sum it up it was the best spa day ever. Thankyou for the wonderful experience :)\n", "\nI scheduled a getaway for my wife and I and surprised her with a massage at the Hotel's on premises spa. Turned out to be a fabulous choice. Not only was it convenient, the staff at the spa were wonderful - from the greeter, to the masseuse, to the General Manager we had the chance to meet, all treated my...\n\n\nMore  \n\n\n", "\nMy husband gave me spa time as Christmas present, and I chose mini package (60min Aroma therapy Massage and 30min facial).\nI had high expectation from all great review on Tripadvisor, but realized now that those good reviews are for mostly \"couple massage\"\nMy first impression(s):\nWhen I enter the hotel, lady at front desk who was vacuuming floor, I...\n\n\nMore  \n\n\n", "\nWithin 2 hours of arriving in town the good folks were able to accommodate a couples massage. Angel & Marcie took care of us and of my gosh it was so very heavenly. We HIGHLY recommend them\n", "\nThis spa is everything you could ask for. Warm friendly staff, relaxing atmosphere, pleasant scents in the air, perfect!\nWhen getting a massage, ask for Marcy, she is amazing. She applied the perfect amount of pressure, was very professional and personalized the massage to my needs. Thank you Marcy!\nThe massage room was quiet and delightfully decorated. Though I only...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/27/0c/e5/the-spa-at-the-andreas.jpg"}]
[{"category": "spot", "review_count": "21", "title": "Studio M Salon and Spa, Palm Springs", "rating_string": "4.5", "address": "2465 E Palm Canyon Dr #1025, Palm Springs, CA 92264", "review_list": ["\nI recommend Natalie LY for the best pedicure and manicure you can get in Palm Springs! She is amazing and very thorough! From the right atmosphere, to the massage... a wonderful experience.\n", "\nBoth my wife and I had one hour massages which were very good. Masseuse's were both very experienced and professional. Also had a hair cut and again the stylist was attentive and professional. What would have made this is greater experience would be a different ambience and setting. The \"spa\" lacked the decor of the high end spa's such as...\n\n\nMore  \n\n\n", "\nJaysein gave me a quick blowout in a 1/2 hour and it looked great! I have pretty long, frizzy hair and it can be quite a workout for an inexperienced stylist. Our family was just on vacation in Palm Springs, but if I ever visit the area again, I will define try go back! He was very friendly too and...\n\n\nMore  \n\n\n", "\nStudio M was recommended by our hotel and they were very accommodating about fitting us in. My partner had a deep tissue massage and I had Swedish massage by Kim (I think her name was). She was just excellent and clearly very experienced. Afterwards we both said it was the best massage we've had.\nIt has a good welcoming vibe...\n\n\nMore  \n\n\n", "\nI was given a spa day for my birthday at Studio M and was extremely pleased. The facial was relaxing and I looked years younger. The highest quality of organic solutions was used. Then on to a manicure and pedicure from Natalie. Well, I have had many mani/pedis, but this one was by far the best ever. Done with extreme...\n\n\nMore  \n\n\n", "\nI booked an appointment with Alex Dunn for my color. She really did an amazing job on my base color and so I have booked another appointment to go back for Balayage next week. The salon is beautiful, very clean and organized. I took a little tour of the Salon and the spa area also looks amazing. I can't wait...\n\n\nMore  \n\n\n", "\nI cannot say enough good things about Studio M. I had a facial by Mallory and my hair cut and colored by Miguel. I also got a 90 minute massage. I can't remember the massage therapists' name but she was also excellent. Studio M has a very relaxing ambiance, and all the staff seems eager to help make your visit...\n\n\nMore  \n\n\n", "\nStudio M is centrally located and the space is very upscale, even posh. The facility is spotless and well staffed, if a little impersonal. I got a great and attentive facial, massage too, but I thought the manicure/pedicure could have been better.\n", "\nSelected this salon because it was close to where I was staying but a little disappointed in the overall experience! I have short hair and wanted a trim with a few highlights and my roots colored. Selected a junior apprentice thinking it would be less expensive and not needing a big change. Startled when finished and my charge was $222.00....\n\n\nMore  \n\n\n", "\n...the quiet ambiance and the quality of the work done on you. I have been 3 time and each type of service (massage, manicure, pedicure, facial) I have received was one of the best ever. A friend referred me, and now I am highly recommending it. You will leave refreshed and renewed.\nPS: they have an excellent line of organic...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/59/06/d9/studio-m-salon-and-spa.jpg"}]
[{"category": "spot", "review_count": "58", "title": "Hadley Fruit Orchards, Palm Springs", "rating_string": "4.0", "address": "48-980 Seminol Drive, Palm Springs, CA", "review_list": ["\nWe stopped here for a sandwich on our way into town. The woman behind the counter forgot to place our order, so 20 minutes later she came to our table to ask for it again. When our sandwich arrived, the bread was in pieces, the tuna salad was dripping with mayo, and none of it seemed fresh. Hadley's famous market...\n\n\nMore  \n\n\n", "\nMy Mother loved Dates and whenever we were within driving distance to Hadley's even if it meant going a bit out of our way we always stopped had a delicious date shake, purchased fresh nuts and she always got her holiday baking ingredients here. Currants, fruits, nuts and especially all types of wonderful dates. Don't miss the opportunity. A must...\n\n\nMore  \n\n\n", "\nHadleys has been in that location for over 40 years, long before the eyesore casino, pre-dating the nightmare outlets and fitting in nicely with the dinos. The old fruit stand and wine tasting room was plywood shack and slowly evolved. They have a lot of dried fruit and nut varieties, but their prices have become non-competitive with such outlets as...\n\n\nMore  \n\n\n", "\nHadley's is really something special. In a world where everything brand new is valued, it is unusual that a place that's been around so long is still appreciated. They're definitely doing something right. They sell endless types of dried fruits, nuts, jams, butters, etc. Their dates are fantastic. I have been going since I was a baby, and my dad...\n\n\nMore  \n\n\n", "\nI remember when Hadley's was the only thing out here...in the middle of nowhere. Yes, there\nwas a time before casinos and outlet mall's. This is a great place if you love fruit and nuts. They sell a great selection of gift items and you can also get yourself a date shake.\n", "\nI'll start by saying Hadley's date shakes are the best! We have to stop there at least once when we're in the area. It's hasn't been remodeled in forever, but that's another thing I like. Change is overrated! I love wandering down the aisles in the store area, looking at all the different dried fruits, nuts, and snacks they sell,...\n\n\nMore  \n\n\n", "\nSo glad Hadley's still there...think one of the ladies said been there since the early 1930's. Great shopping for dates & other dried products, even some fresh veggies there.. Had to try their date shakes that we remembered from years ago. Tasty with bits if dates in them...yummy. Saw them making sandwiches & they looked very tasty with nice bread....\n\n\nMore  \n\n\n", "\nSure Hadley sells every nut, trail mix and dried fruit known to man, but the real draw is the made to order shakes. The date shake is the best!\n", "\nWhen you are at a loss as to what to bring, stop in at Hadley's. Their products are great-tasting, and nutritious. Since many of their products are to be eaten, they will not need dusting,storing, or displaying. They will be devoured and your gifts will be well-received. They also have a wide selection of unique items that will add to...\n\n\nMore  \n\n\n", "\nStopped off here on our way to Palm Springs, interesting to say the least...over heard people talking about the DATE SHAKE....not my cup of tea. Wife and I spent an hour or so looking at the fruit, nuts, and other bits. Elvis stands behind the bar area. This place looks like it belongs in the past, but well done to...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/23/4a/95/hadley-highway-sign.jpg"}]
[{"category": "spot", "review_count": "16", "title": "Crystal Fantasy, Palm Springs", "rating_string": "4.5", "address": "268 N. Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nSpent a pretty penny in here, but so worth it. Got some great gifts from a great selection of items. Tarot readers on hand as well if you are interested\n", "\nExtremely disappointed. Lack of energy throughout the store.\nSelection and variety very limited.\nI hear there are usually \"events\". Which may make up for the lack of merchandise for some. But I went to shop found nothing I was looking for. Back to shopping on line for me.\n", "\nWe were recently in Palm Springs for the birthday of my BFF, and rather than do a spa morning, we decided to get a psychic or other reading. A friend had recommend Crystal Fantasy, and it was perfect! On Saturdays they have 4-6 different readers and you can just sign-in at the front desk and get on the list for...\n\n\nMore  \n\n\n", "\nCrystal Fantasy has unique, one of a kind gifts; beautiful jewelry; gemstones; cards; candles and incense. It's a family-owned store and everyone who works there is knowlegeable and so friendly. They also have lots of fun events - palm reading, psychics, tarot card readings, etc.\n", "\nI am a Reiki Energy Healer and always keeping my eyes and ears open in hopes of finding a store like the one you have. I love how I feel at home in your beautiful store. The jewelry, crystals, books, wall art, Angels and the Spiritual Sampler Weeekends you offer make your store one of the best!! Many blessings to...\n\n\nMore  \n\n\n", "\nLOVE THIS STORE!! Great selection of things to purchase and great customer service!!! Definitely a place you must visit while in Palm Springs! !\n", "\nThis store has everything! My kids loved it and I got lost in all the beautiful gems, trinkets and hand made jewelry. A MUST STOP!\n", "\nGifts galore! My favorite store in downtown Palm Springs! Love the people and the shopping. Always a great place to stop.\n", "\nI love. this. store! have been shopping here for several years, great gifts...for me and others! Always something new and interesting...and all if the physical readers and healers are amazing. Joy and Scott Meredith (owners) along with their daughter Sarah are just wonderful people to know...you should definitely stop in...\n", "\nI love the store. I think it really brings positive energy. Whenever I enter the store I feel so happy. I've only been in that store twice but I've got to say it really is a master piece. And I know that I got six things from there and every time I look at the crystals it reminds me of...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/84/e3/16/crystal-fantasy.jpg"}]
[{"category": "spot", "review_count": "11", "title": "Estate Sale Co., Palm Springs", "rating_string": "4.5", "address": "4185 E. Palm Canyon Drive, Palm Springs, CA", "review_list": ["\nMy husband and I enjoyed walking through this cluster of buildings filled with high end furniture, pottery, pictures, lawn furniture and lots more. Everything from mid century modern, French country, traditional and really anything you want. The condition was very good, and the prices were very cheap. The HGTV and TLC programs would love this place. Sure wish this was...\n\n\nMore  \n\n\n", "\nNext time I'll rent a van/truck to get everything home (AZ). Spectacular variety, quality, prices and don't miss the fact there are 3 buildings! I only saw one at first and almost missed the rest of the wonderful experience. I'll go back every time I'm in town.\n", "\nThe buildings have so much to offer: furniture, artwork, paintings, outdoor furnishings, whimsical pieces (like the driftwood sculpture horse selling for $7,000+ and worth every penny), fiesta dish ware, really nice glassware, and you-name-it. It is all here.\nEvery visit we make to the desert is incomplete if we don't stop here. Their merchandise (consignments) are mostly very top-notch. The...\n\n\nMore  \n\n\n", "\nFantastic buys and I procrastinate and my opportunity passes me by as the items are tagged for sold to another customer. We have had this happen more than once. True, this place is addicting. Locals decorators and designers tend to shop here week days. Tourists shop the weekends. The daughter Misty has a shop of her own in Rancho Mirage....\n\n\nMore  \n\n\n", "\nWhat a great spot. I'm from LA. The prices and quality of merchandise is amazing. Which I had needed to furnish my place. Loved what I saw. Staff is wonderful too. Each building is slightly different.\n", "\nWe have been visiting the Estate Sale Co. In Palm Springs for years. The family owned business is always full of nicely priced pieces, big and small. I recommend a walk-through if you have the time.\n", "\nWe heard so much about this place and we were really looking forward to going--in fact we reserved a whole morning for it. Unfortunately it was a huge disappointment. Most of the furniture is fairly new and of the type and style purchased for vacation homes by people with very little taste and a whole lot of money. We saw...\n\n\nMore  \n\n\n", "\nMy friend and I visited Palm Springs a few weeks ago and were doing the normal Palm Canyon store hopping. We took Palm Canyon out of downtown and drove past Estate Sale Co; I remembered seeing it listed on a website so we pulled over and decided to browse. We were here for a few hours, completely amazed by all...\n\n\nMore  \n\n\n", "\nWe have been going to Palm Springs for years as a vacation spot. This year we thought we'd take a look, and to our surprise, it turned out to be one of the greatest stores of it's kind. We're from the New York area, and nowhere, and I mean nowhere in our vicinity is there anything like it. Incredible merchandise,...\n\n\nMore  \n\n\n", "\nI just recently moved here from Los Angeles and was truly impressed by this company and it's staff. The experience of working, trading, buying and just plain conversation is terrific. You are treated like \"good people\" would treat one another and the care, interest and beautilful array of items presented in the store is the best find ever, not just...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/05/6d/77/fd/looking-to-see-what-these.jpg"}]
[{"category": "spot", "review_count": "57", "title": "Trail Discovery Hiking Tours, Palm Springs", "rating_string": "5.0", "address": "P O Box 554, Palm Springs, CA 92263", "review_list": ["\nAwesome! Enjoyed a great hike to Indian Canyons and Palm Canyon with Scott from Trail Discovery Tours. I was travelling solo and he was kind enough to fit me in with 3 other lovely ladies. He is very informative and is willing to accommodate your hiking experience to your wish list. Overall a great experience and would love to do...\n\n\nMore  \n\n\n", "\nMy wife and I were looking for a challenging \"fitness\" hike on our Palm Springs vacation. Scott took us on one of his favorite loops in the Indian Canyons, which included 6 hours / 8-9 miles of good climbs, scrambling and cross-country travel. A couple of adrenaline-filled moments for sure! It was exactly the challenge we were looking for! In...\n\n\nMore  \n\n\n", "\nMy wife and I visited Palm Springs recently. We are avid hikers, and often use a guide. We are so glad that we did this time. Scott is simply amazing. Early in our correspondence, he discussed options, assessed our fitness levels, and laid out a detailed plan for our 4 days of hiking. He took us to incredible areas that...\n\n\nMore  \n\n\n", "\nAwesome!!! Great hiking experience with Scott Scott. Fun girlfriend trip to Palm Springs included a 3hr hike with Scott in beautiful Joshua Tree Nat'l Park. He met us equipped with packs water snacks hats.We were given the choice between two hikes. We took the less challenging and still a great work out.Scott is so fun and personable you don't even...\n\n\nMore  \n\n\n", "\nTotally amazing!!! This was our second hike with Scott and it was really great to meet up with him again. We met Scott and he made sure we were properly kitted out for the hike with the correct gear, plenty of water and snacks. Scott's knowledge of the desert/area is excellent and he made the desert so interesting that we...\n\n\nMore  \n\n\n", "\nMy partner and I recently did a hike abs dome rock scrambling in the Joshua Tree National Park. Our guide Scott was amazing and so helpful. It's a must do experience when you are in the area. We started early to avoid the afternoon heat, but it still gets very hot. Scott had lots of water and snacks for day....\n\n\nMore  \n\n\n", "\nFor a couple of novice hikers Scott had my boyfriend & I covered with his knowledge of the area and general friendly, chatty banter. Scott shares his stories & expertise as he takes you through the Canyon. He gives you a profound appreciation for hiking and adventure seeking. He will provide you with appropriate hats, as well as hiking fanny...\n\n\nMore  \n\n\n", "\nI've done two hikes with Trail Discovery and Scott really makes the experience an enjoyable one. He is knowledgable, friendly, competent, fun to be around and provides a fabulous experience. Last year, we hiked from the top of the tram with him into the wilderness area, great views! Yesterday, we hiked Painted and Ladder Canyons, an outstanding outing that we...\n\n\nMore  \n\n\n", "\nThank you Scott for another awesome hike! Your willingness to share your knowledge and history of the trails along with your passion for adventure is what makes hiking with you a unique experience. However, I am most grateful for your intuitiveness and watchful eye. The coiled and hissing red diamond back rattler was exciting, but i\"m glad you were in...\n\n\nMore  \n\n\n", "\nEnjoyed hiking the Palm Springs canyons and surrounding mountains with thanks to Scott! Traveling on my own, i needed some guidance and \"company\" in venturing into the wilderness...\nFeeling very fortunate to have been welcomed to join different groups that Scott was taking out.\nHe made those little side adventures possible, fun and really enjoyable... Thanks Scott for your stories,...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/5f/42/c0/trail-discovery-hiking.jpg"}]
[{"category": "spot", "review_count": "16", "title": "Desert Adventures Red Jeep Tours, Palm Springs", "rating_string": "4.5", "address": "200 S. Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWent on the desert tour with Lane as our tour guide. This was a first class tour. Lane was extremely knowledgable about all aspects of the desert as well as the surrounding area. We had a lot of fun visiting an oasis and climbing through the rocks that were cut away by the flash flooding that occurs from time to...\n\n\nMore  \n\n\n", "\nWe did the sunset & stargazing tour which we really did enjoy. Our tour guide Teri was extremely knowledgeable and knew a lot about the area and the history which we found fascinating. It's a small personal tour (max 6ppl) which is nice. It does go for a while though and I'm glad we had a large late lunch first...\n\n\nMore  \n\n\n", "\nOur naturalist guide, Jeri, gave us a super tour of the private Metate preserve starting at 8am with just one other family. We were pleased to learn so much about the native Cahuilla people, geology, flora and fauna from Jeri. She had excellent teaching tools like maps, graphs, palm berry, mesquite bean, lifesize village reproductions, arrowheads, etc. which enhanced 3...\n\n\nMore  \n\n\n", "\nWe just took a several hour tour of Palm Springs via jeep with Morgan. It was one of the most informative and fun experiences I have had on vacation for a long time. Morgan has encyclopedic knowledge of the region! We had fun both in and out of the jeep. Would recommend this activity for people who really want to...\n\n\nMore  \n\n\n", "\nWe took this tour with our guide, Tom. We saw some beautiful landscape, learned quite a lot from the very interesting and informative information imparted by our guide. He was a well of knowledge and pretty funny to boot. Got some fantastic photos of the fault zone, the variety of foliage and lastly some night time views at the stargazing...\n\n\nMore  \n\n\n", "\nVery pleasant guide gave an informative tour of a nice but tiny property which included a tiny reconstruction of an historic native village. The tour mostly consisted of small stops with educational discussions connected by a couple minutes of driving. The overall effect was that of a lame school tour.\nNo adventure sadly.\n", "\nDe was great tour guide full of info of the land\nsaw a beautiful Oasis two rattler snakes\nGreat time great pictures thank you De\n", "\nOur guide was very knowledgeable about the area, problem was, it just wasn't that interesting. Saw 3 hours of desert; unfortunately you face inward at the other travelers sitting across from you, instead of out where you could enjoy the view. Not special enough to support the price.\n", "\nFor 3 hours Dick, our guide, shared his knowledge and love of the desert. He was a great story teller and we all thoroughly enjoyed\nourselves. The fault line was very\ncool and we even saw 3\nrattlesnakes! It was a great adventure! Thanks so much Dick.\n", "\nReally enjoyed. Very informative!\nBeautiful sites, interesting facts on local vegetation, native people and the geography of area. Darrell was a great host and very knowledgeable.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/06/0f/a9/86/desert-adventures-eco.jpg"}]
[{"category": "spot", "review_count": "23", "title": "Streetbar, Palm Springs", "rating_string": "4.5", "address": "224 East Arenas Road, Palm Springs, CA", "review_list": ["\nLocated right on the \"gay strip\" of Palm Springs, this little place is cozy. Friendly staff and good drinks make it an easy place to hang out. I went on karaoke night and had several very cold beers while watching locals sing their hearts out. Only downside is that they take cash only.\n", "\nFriendly customers, friendly staff, strong drinks, fun music and atmosphere. What more do you need in a pub?\n", "\nAlways a must go to bar when visiting Palm Springs. StreetBar is your local neighborhood establishment. No attitude, lots of men, great staff and just a really fun place to go and meet people and have some drinks.\n", "\nA classic gay bar but great music. Rather older crowd but nice and easy to talk to. Drinks are not,pricy\n", "\nHad a very good time at Streetbar and I end up meeting a lot of great guys and had one good night and I did not want the night to end.\n", "\nFriendly bar along the Palm Springs strip. Good bar service but they don't take cards which is a real shame as we would have spent more/stayed longer.\n", "\nI visit Palm Springs a minimum of 3 times a year. I am not a person that frequents bars too often but I treat myself to a drink now and then especially when I'm out of town. Street Bar is always the bar I visit. It is a local hangout with lots of fun and friendly people. The staff are...\n\n\nMore  \n\n\n", "\nWay too costly cocktails . Many other fun spots to go for better scenery and cheaper drinks .\nMostly old queens and I'm 52!\nLol. Service so so slow lots of attitude mostly bad. Check all the other places out before spending money here.\n", "\nThere is a robust middle age group here early evenings enjoying the inexpensive drinks $3.50 or $1.50 for beer these prices of course are until only 7 pm it is amazing how many people take advantage of the happy hours at the different Palm Springs watering holes\nMusic is kinda loud but centers on the show tunes and the 70s...\n\n\nMore  \n\n\n", "\nVideo bar with very fun atmosphere.....seemed to be the place the locals met at.\nLots of Fun, VISIT!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/00/1b/9d/37/haskamp-pointing-the.jpg"}]
[{"category": "spot", "review_count": "20", "title": "Hunter's Video Bar & Dance Theater, Palm Springs", "rating_string": "4.0", "address": "302 East Arenas Road, Palm Springs, CA", "review_list": ["\nI don't get why women think a bachelorette party is more fun in a gay bar. Hint to the management…….those of us who aren't a part of those parities….who are in your bar often and actually drink there regularly don't enjoy them. Rant over. The DJ's are fun the music great to dance to and the drinks strong.\n", "\nAmazing drink, great entertainment and lovely people! Went there for the white party so there was loads of people... we even nearly missed the actual white party just to stay here that night :)\n", "\nWe had fun at Hunter's. It's probably the busiest bar in town, with a mixes crowd of young and old. We visited on Karaoke night and had great fun.\n", "\nHunter's is that one Gay bar you want to go in when you are with friends and since I was alone I was not going to go in and be by myself. Well I went in and before I knew it I was ordering a drink at the bar and the next thing I knew I was dancing and drinking...\n\n\nMore  \n\n\n", "\nLarge friendly bar for a drink with friends. We like Fur Friday which runs during the happy hour 5pm to 7pm every week. Place is packed for $2 beers!\n", "\nGreat local place, awesome music, even better staff. Everyone is welcome, but if you cum don't hate the Gays as this is our place.\n", "\nWhat ever your age, whatever your looking for, Hunters is the place to be. The bartenders are great and really know how to handle a big crowd on the biggest weekend of the Year; Gay Pride. The D J's play great beats to endlessly dance away to. My friends and I have been here many other weekends and it is...\n\n\nMore  \n\n\n", "\nGreat place for night life! Indoor and outdoor seating, go go boys, and large dance floor. Perfect location.\n", "\nHad to fight my way through bachelorette parties to hear the DJ talk over the music on the dance floor.\nNot sure happened, but the Whitney megamix was the highlight of my evening.\n", "\nMost nights easy parking either on Arenas rd itself or on Indian canyon dr. An easy walk over.\nDrinks are inexpensive before 7pm are only$ 3.50 then jump to $6.50\nThere is a cab stand next door in case you drink too much so don't worry about that.\nIt is easy to bar hop in this town because there are...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/da/26/ba/hunter-s-video-bar-dance.jpg"}]
[{"category": "spot", "review_count": "11", "title": "Toucans Tiki Lounge, Palm Springs", "rating_string": "4.0", "address": "2100 North Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nSuper fun drag show with 'dragleberty's' Delta Work & & Morgan McMichael's. HOT HOT HOT! Definitely reserve your seating & tickets prior via their website.\n", "\nI always have a great time here when I visit Palm Springs. The small dance floor is cozy and fun because the music is current and fun with some old remixes as well. The bar is easy to cruise because it basically is a large circle. The guys are cute and to me it has a bit of an exclusive...\n\n\nMore  \n\n\n", "\nReally cool venue. We were there for a party. The drinks were excellent. The staff had great personalities. The décor was islandish, which was fun. Good food. Our only regret was that we couldn't come back later in the night to see the show. Will definitely do it on our next trip!\n", "\nHave been here many time and do enjoy the drag shows. I do not like how they create the sense of urgency by making people wait in line there are really no people in the bar. I'm sure there's some business reason for this but as a customer who comes here basically every time I visit. Leaves a bitter taste...\n\n\nMore  \n\n\n", "\nThis was my first time here and will be my last. Went to the bar to have a drink and asked the bartender to charge my cell phone with my charger. He said no and had a really bad attitude. The place was empty and there were two of us and only 8 other people in the place. I can...\n\n\nMore  \n\n\n", "\nWe have stayed in Palm Springs several times and had some good nights at Toucans but not any more!\nWe took a $10 taxi to Toucans last night ( the first time we have been this year ) and were stopped at the door by a youth in a baseball cap and asked for ID. This has never happened before...\n\n\nMore  \n\n\n", "\nA fun evening-- but remember to bring a bunch of singles as entertainers strut the area for tips during each song they perform. Sort of wish they were more focused on their performance than collecting their tips.\nBut the place is crowded-- so get there early or reserve a seat.\nEntertainers are mostly fabulous -- but a few could use...\n\n\nMore  \n\n\n", "\nThere is really nothing like the place. The Sunday night show is high energy, entertaining, inclusive and of a very high quality. I saw this show last year as well, and it has been improved. Obviously, the performers care about their audience and their performance. I've seen drag shows that are really terrible - the performance quality here is top...\n\n\nMore  \n\n\n", "\nExcellent location to go to on Tuesdays. Very large crowd of mixed Gay and Straight people. Great value on Tuesdays. Bartenders and staff are very friendly.\n", "\nseveral guest at our hotel suggested we check out the drag shows on Sunday evenings at Toucans. Interesting and entertaining. plenty of what you might expect. I was surprised how crowded it was in the middle of the summer. Definitely a fun vibe - but expect to hear and see the real \"Cher\".\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/bc/04/75/toucans-tiki-lounge.jpg"}]
[{"category": "spot", "review_count": "46", "title": "Offroad Rentals, Palm Springs", "rating_string": "4.5", "address": "59511 U.S. Highway 111, Palm Springs, CA 92262", "review_list": ["\n4 of us went including 11 & 14 year old boys and we had a blast. We got there a little before 10am and temperature was nice. We were the only ones there. They start you off with a safety video, next a hair cover and helmet & safety glasses,next set you up with your own machine and re-explain what...\n\n\nMore  \n\n\n", "\nSo we took our 4 kids to Offroad Rentals - and what a cavalcade of disorganization and overwhelmed staff. No requirement for our children to watch the safety video. No instructions after handing over a hefty $160 to the hefty Aussie lady what to do next in terms of getting gear and/or getting in line. No directions whatsoever and everyone...\n\n\nMore  \n\n\n", "\nHad a great time, worker did great job accommodating us , friendly staff, son absolutely loved it. Highly recommended for family outing, couples, great views of windmills and mountains\n", "\nWe went based on all the glowing reviews and this place did not disappoint. They've been doing this for over 35 years and I don't think they have updated their website since they first built it. They have all new, very safe ATVs. We had 2 adults and 2 teens (14&16) and everyone got the hang of it very quickly....\n\n\nMore  \n\n\n", "\nThrilling fun for the whole family. It was insanely windy but we battled through it. Got 70 minutes of Driving time. Felt quite safe for everyone\n", "\nI am in Palm Springs each year for two weeks. The highlight of my trip is always riding the quads. They just got new equipment. Always a fun activity. My 91 year old Dad goes with us too\n", "\nI don't want to give a shout out to any one specifically as everyone who helped us in the extreme heat of the afternoon was SO helpful and nice. We had three in our party 13, 15 and me... Mom. Had a Great time! QUICK check in- watch a safety video for a few minutes, get fitted for proper safety...\n\n\nMore  \n\n\n", "\nThis was my first time in Palm Springs and it won't be the last that is for sure. The best part however was the atv rides from offroad rentals. This place was the highlight of my trip and I encourage everyone to come out and ride\n", "\nMy husband and I just moved to Indian Wells with our two children. This weekend we decided to check out the local area as well as celebrate my son's birthday. After searching online we came across Offroad Rentals on Yelp! I am so glad we did. We all had a great time riding the quads. The staff was so friendly...\n\n\nMore  \n\n\n", "\nIt was a fun ride with my friend and his kids. They were quick and helpful and had free refreshments. They provide shoes and pants if you forget or don't have a pair. The ATVs were easy to ride for beginners and they give instructions again if you didn't understand. I recommend going there to everyone and even 6 year...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/c5/34/57/my-first-donut.jpg"}]
[{"category": "spot", "review_count": "16", "title": "Desert Adventures Red Jeep Tours, Palm Springs", "rating_string": "4.5", "address": "200 S. Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWent on the desert tour with Lane as our tour guide. This was a first class tour. Lane was extremely knowledgable about all aspects of the desert as well as the surrounding area. We had a lot of fun visiting an oasis and climbing through the rocks that were cut away by the flash flooding that occurs from time to...\n\n\nMore  \n\n\n", "\nWe did the sunset & stargazing tour which we really did enjoy. Our tour guide Teri was extremely knowledgeable and knew a lot about the area and the history which we found fascinating. It's a small personal tour (max 6ppl) which is nice. It does go for a while though and I'm glad we had a large late lunch first...\n\n\nMore  \n\n\n", "\nOur naturalist guide, Jeri, gave us a super tour of the private Metate preserve starting at 8am with just one other family. We were pleased to learn so much about the native Cahuilla people, geology, flora and fauna from Jeri. She had excellent teaching tools like maps, graphs, palm berry, mesquite bean, lifesize village reproductions, arrowheads, etc. which enhanced 3...\n\n\nMore  \n\n\n", "\nWe just took a several hour tour of Palm Springs via jeep with Morgan. It was one of the most informative and fun experiences I have had on vacation for a long time. Morgan has encyclopedic knowledge of the region! We had fun both in and out of the jeep. Would recommend this activity for people who really want to...\n\n\nMore  \n\n\n", "\nWe took this tour with our guide, Tom. We saw some beautiful landscape, learned quite a lot from the very interesting and informative information imparted by our guide. He was a well of knowledge and pretty funny to boot. Got some fantastic photos of the fault zone, the variety of foliage and lastly some night time views at the stargazing...\n\n\nMore  \n\n\n", "\nVery pleasant guide gave an informative tour of a nice but tiny property which included a tiny reconstruction of an historic native village. The tour mostly consisted of small stops with educational discussions connected by a couple minutes of driving. The overall effect was that of a lame school tour.\nNo adventure sadly.\n", "\nDe was great tour guide full of info of the land\nsaw a beautiful Oasis two rattler snakes\nGreat time great pictures thank you De\n", "\nOur guide was very knowledgeable about the area, problem was, it just wasn't that interesting. Saw 3 hours of desert; unfortunately you face inward at the other travelers sitting across from you, instead of out where you could enjoy the view. Not special enough to support the price.\n", "\nFor 3 hours Dick, our guide, shared his knowledge and love of the desert. He was a great story teller and we all thoroughly enjoyed\nourselves. The fault line was very\ncool and we even saw 3\nrattlesnakes! It was a great adventure! Thanks so much Dick.\n", "\nReally enjoyed. Very informative!\nBeautiful sites, interesting facts on local vegetation, native people and the geography of area. Darrell was a great host and very knowledgeable.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/06/0f/a9/86/desert-adventures-eco.jpg"}]
[{"category": "spot", "review_count": "22", "title": "Social Cycle, Palm Springs", "rating_string": "5.0", "address": "Palm Springs, CA", "review_list": ["\nA great time had by all. The meeting place was easy to find. Captain Lou was great! He encouraged us to bring along and play our own music while we peddled through Palm Springs. Group shooters at the last stop were enjoyed by all before a downhill coast ride back to the starting point. If you don't come with your...\n\n\nMore  \n\n\n", "\nGood times with good people! What a way to see Palm Springs! Although it was work, the drinks at each spot were worth it!\n", "\nSo much fun! Meet an awesome group of people and Lou was an amazing guide! Only wish it would have lasted longer\n", "\nMy friend and I went on Social Cycle on a Saturday evening, and had a blast! There were 12 people total, and they were all so much fun! Our driver, Lou, was fantastic! Definitely recommend!!! 👍🏻\n", "\nMy husband and I went on the Social Cycle with nine other strangers who became fast friends. Lou was our very competent Captain. We did get a discount on the tickets so it was very affordable. We stopped at three bars (Hard Rock Café, Hair of the Dog and Tonga Hut). It was a was a lot of fun and...\n\n\nMore  \n\n\n", "\nBooked the Social Cycle to celebrate some big birthdays! 70! 50! 40! We had a group of 13 family & friends! Our son took his IPod loaded w/songs we all knew & could sing along to. Eautiful Palm Springs afternoon, very personable Team Captain, Lou, made for a very enjoyable, memorable time.\n", "\nRecommend to have adjustable seats or pedals for shorter people. Great fun blasting the music and singing along with Lou!\n", "\nMust do - especially with a big group. We had 16 people for a birthday party and it was the highlight of the trip. And a good workout too...\n", "\nMy family and I had a great time on Social Cycle! We did a 5:30 trip that hit 3 bars. Our only complaint was that we stopped at the Hard Rock, which seemed a bit hokey (would have rather done a local bar). Other than that it was a great time that went by very quickly!\n", "\nMy friends and I love to visit Palm Springs! The only thing lacking has been then night life, till now!!!! Thank you Social Cycle for answering our prayers. This crazy cool 15 person pedaling bar on wheels is the best thing to happen to this city. We took the bike out for night of high energy bar hopping and exploring....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/66/2c/1e/social-cycle.jpg"}]
[{"category": "spot", "review_count": "22", "title": "Social Cycle, Palm Springs", "rating_string": "5.0", "address": "Palm Springs, CA", "review_list": ["\nA great time had by all. The meeting place was easy to find. Captain Lou was great! He encouraged us to bring along and play our own music while we peddled through Palm Springs. Group shooters at the last stop were enjoyed by all before a downhill coast ride back to the starting point. If you don't come with your...\n\n\nMore  \n\n\n", "\nGood times with good people! What a way to see Palm Springs! Although it was work, the drinks at each spot were worth it!\n", "\nSo much fun! Meet an awesome group of people and Lou was an amazing guide! Only wish it would have lasted longer\n", "\nMy friend and I went on Social Cycle on a Saturday evening, and had a blast! There were 12 people total, and they were all so much fun! Our driver, Lou, was fantastic! Definitely recommend!!! 👍🏻\n", "\nMy husband and I went on the Social Cycle with nine other strangers who became fast friends. Lou was our very competent Captain. We did get a discount on the tickets so it was very affordable. We stopped at three bars (Hard Rock Café, Hair of the Dog and Tonga Hut). It was a was a lot of fun and...\n\n\nMore  \n\n\n", "\nBooked the Social Cycle to celebrate some big birthdays! 70! 50! 40! We had a group of 13 family & friends! Our son took his IPod loaded w/songs we all knew & could sing along to. Eautiful Palm Springs afternoon, very personable Team Captain, Lou, made for a very enjoyable, memorable time.\n", "\nRecommend to have adjustable seats or pedals for shorter people. Great fun blasting the music and singing along with Lou!\n", "\nMust do - especially with a big group. We had 16 people for a birthday party and it was the highlight of the trip. And a good workout too...\n", "\nMy family and I had a great time on Social Cycle! We did a 5:30 trip that hit 3 bars. Our only complaint was that we stopped at the Hard Rock, which seemed a bit hokey (would have rather done a local bar). Other than that it was a great time that went by very quickly!\n", "\nMy friends and I love to visit Palm Springs! The only thing lacking has been then night life, till now!!!! Thank you Social Cycle for answering our prayers. This crazy cool 15 person pedaling bar on wheels is the best thing to happen to this city. We took the bike out for night of high energy bar hopping and exploring....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/66/2c/1e/social-cycle.jpg"}]
[{"category": "spot", "review_count": "22", "title": "Social Cycle, Palm Springs", "rating_string": "5.0", "address": "Palm Springs, CA", "review_list": ["\nA great time had by all. The meeting place was easy to find. Captain Lou was great! He encouraged us to bring along and play our own music while we peddled through Palm Springs. Group shooters at the last stop were enjoyed by all before a downhill coast ride back to the starting point. If you don't come with your...\n\n\nMore  \n\n\n", "\nGood times with good people! What a way to see Palm Springs! Although it was work, the drinks at each spot were worth it!\n", "\nSo much fun! Meet an awesome group of people and Lou was an amazing guide! Only wish it would have lasted longer\n", "\nMy friend and I went on Social Cycle on a Saturday evening, and had a blast! There were 12 people total, and they were all so much fun! Our driver, Lou, was fantastic! Definitely recommend!!! 👍🏻\n", "\nMy husband and I went on the Social Cycle with nine other strangers who became fast friends. Lou was our very competent Captain. We did get a discount on the tickets so it was very affordable. We stopped at three bars (Hard Rock Café, Hair of the Dog and Tonga Hut). It was a was a lot of fun and...\n\n\nMore  \n\n\n", "\nBooked the Social Cycle to celebrate some big birthdays! 70! 50! 40! We had a group of 13 family & friends! Our son took his IPod loaded w/songs we all knew & could sing along to. Eautiful Palm Springs afternoon, very personable Team Captain, Lou, made for a very enjoyable, memorable time.\n", "\nRecommend to have adjustable seats or pedals for shorter people. Great fun blasting the music and singing along with Lou!\n", "\nMust do - especially with a big group. We had 16 people for a birthday party and it was the highlight of the trip. And a good workout too...\n", "\nMy family and I had a great time on Social Cycle! We did a 5:30 trip that hit 3 bars. Our only complaint was that we stopped at the Hard Rock, which seemed a bit hokey (would have rather done a local bar). Other than that it was a great time that went by very quickly!\n", "\nMy friends and I love to visit Palm Springs! The only thing lacking has been then night life, till now!!!! Thank you Social Cycle for answering our prayers. This crazy cool 15 person pedaling bar on wheels is the best thing to happen to this city. We took the bike out for night of high energy bar hopping and exploring....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/66/2c/1e/social-cycle.jpg"}]
[{"category": "spot", "review_count": "29", "title": "Captain Kirk's Palm Springs Adventure - Day Tours, Palm Springs", "rating_string": "5.0", "address": "515 North Palm Canyon Drive, The Corridor, Palm Springs, CA 92262 ‎", "review_list": ["\nA friend checked this tour out and it came highly recommended so three of us spent a wonderful Saturday morning with Kirk and Patrick. We strolled as we listened to Kirk entertain us with facts and stories of the fabulous homes of numerous stars of now and in the past 90 years. Fascinating. Pleasant pace. Breeze. Sunshine. Pictures galore. Well...\n\n\nMore  \n\n\n", "\nThis was our first visit to Palm Springs. I booked a tour with Kirk based on reviews and the fact that it could just be the three of us (not an entire bus) and I also liked the idea of a walking tour. WOW......does he know his history! Kirk covered entire decades of Palm Spring history and brought pictures of...\n\n\nMore  \n\n\n", "\nTook my s-i-l on this tour last Apr. and enjoyed it so much that I did it again with my husband and two friends. Have had a place in this area for 15 years and didn't know some of the interesting history. This is not just a silly celebrity house gawking tour. Kirk knows his history and politics and makes...\n\n\nMore  \n\n\n", "\nWe have been spending winters in the desert for many years, but never knew much about the history and past residents of Palm Springs itself. Kirk does a great job of weaving history and personalities and local politics together with viewing some outstanding properties in a two and a half hour walk that goes way too fast! It was an...\n\n\nMore  \n\n\n", "\nI was shocked, overwhelmed to a faint, and then richly rewarded by the breadth of Kirk’s knowledge about the history of Palm Springs, Old Las Palmas, and the many intricate, behind-the-scenes scandals. We learned more than a few of the personal “exchanges” between celebrities from that Golden Era of Hollywood; the intriguing and enlightening, juicy and salacius tidbits of the...\n\n\nMore  \n\n\n", "\nI booked the tour up through tripadvisor a few months and Kirk was very helpful and advising the best time and day of the week to fit the tour into our schedule. There were four of us on the tour and we all agreed that this was certainly the best way to find out about Palm Springs and it's past...\n\n\nMore  \n\n\n", "\nKIrk led us on a great walking tour of Old Las Palmas. We enjoyed his informative narrative on the history of the homes, personalities and of Palm Springs itself. Highly recommended!\n", "\nMy girlfriend and I had a great tour of this historic part of Old Palm Springs in April of 2015. Kirk was a gentleman and very knowledgeable of the history of Palm Springs as well as the celebrity homes. I was most impressed with the history of which entities drove the financial success through the decades, starting with one families...\n\n\nMore  \n\n\n", "\nMy husband and I visit Palm Springs every year in March to get some sun and spend a day or two at the Indian Wells tennis event. This year we took Captain Kirk's walking tour of the Las Palmas neighborhood, and it was excellent. We met him behind a popular coffee shop/gathering place, along with his adorable and well-behaved dog...\n\n\nMore  \n\n\n", "\nIf you are looking for a slower paced informative walking tour highlighting the whose who of celebrities past and present who hung out in Palm Springs look no further. Simply send Kirk an e-mail and he will get back to you in a timely manner. (Cost $50 per person) His walking tours start in downtown Palm Springs and he provides...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/f8/ab/5e/captain-kirk-s-palm-spring.jpg"}]
[{"category": "spot", "review_count": 0, "title": "P.S. Walk With Me, Palm Springs", "rating_string": 0, "address": "Palm Springs, CA 92262", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "4", "title": "Frey House II, Palm Springs", "rating_string": "5.0", "address": "686 West Palisades Drive, Palm Springs, CA", "review_list": ["\nAlbert Frey came to P.S. in 1939 to live and designed over 200 buildings. This home is only 1200 sq. ft. and has a giant boulder that separates the living room and bedroom. Inside tours are mainly available during modernism in October and February. Take the P.S. Historical Walking Tour -The Exclusive Tennis Club Enclave on Thurs. at 9:30. 760.323.8297...\n\n\nMore  \n\n\n", "\nModernism Week in Palm Springs is a great adventure - and one of the highlights is the rare opportunity to visit Fray House 2, by the brilliant Swiss architect, Albert Frey. Long a local icon, Frey has become a global one as well as recognition of his talent with design and materials has spread. I's a wonderful tour - and...\n\n\nMore  \n\n\n", "\nWhen the time. Rolls around to get tickets to tour the Frey House get in early to nab one\nThe house is 225 feet above town and is only a little ove 820 square feet. But Albert Frey spent a year on the land studying the space, the view, the sun at different times of day before he built this...\n\n\nMore  \n\n\n", "\nAlbert Frey was one of America's foremost 20th century architects, and this, his second home in Palm Springs, is a pocket treat. Built in 1963, and only 1200 sq. ft., the house is worth seeing for the views and, especially, the way Frey integrated his home into the San Jacinto mountainside. Docent tours take approximately 45 minutes. Usually only open...\n\n\nMore  \n\n\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "13", "title": "Sonny Bono Statue, Palm Springs", "rating_string": "3.0", "address": "149 S Palm Canyon Dr, Palm Springs, CA", "review_list": ["\nThe people of Palm Springs do not celebrate Sonny Bono the one time mayor of the city. Locals who've lived here in the valley for an extended time, dismiss anything he supposedly did when he was the mayor as well as his tenure in the Senate As for his statue in the central plaza it is a tourist hang-out. People...\n\n\nMore  \n\n\n", "\nA statue of Sonny Bono that bears no resemblance to him. If you are a Sonny and Cher fan it would be worth a trip but keep your expectations low. There is a fountain behind the statue and it almost seemed like the Sonny Bono statue was a last minute add on.\n", "\nThis statue is great and in the center of the old village which he would have loved as mayor of the town ! They miss him in Palm Springs, even his restaurant has never been reopened.\n", "\nA great spot to walk to as you are out and about. It is an easy site to find and on the walk of starts.\n", "\nA nice tribute to the former Mayor of Palm Springs--but OMG his hands are GIANT!! The rest of the sculpture is a pretty good likeness however.\n", "\nI was a teen in the late 1960’s when Sonny and Cher came on the music scene and their TV comedy show saw me through my 20’s. In the years that followed and Sonny made guest appearances on a variety of shows, his physical features changed very little with age. So how is it that I have walked by this...\n\n\nMore  \n\n\n", "\nSonny Bono was the mayor of Palm Springs. His office was located upstairs where the Italian Restaurant is. If you take the Palm Springs Historical Walking Tour- The Heart of the City…you will hear more about him…..tour is 9:30 Wed and 3:00 Thurs.\n", "\nThis is the worst; at least I think it may be bronze but this statue and face looks nothing like the Sonny Bono I met in person...who allows these things to happen and then leave it for posterity????\n", "\nIts a beautiful statue. We saw so many people taking pictures with Sonny Bono by the fountain. It sits in the middle of a busy intersection and sometimes its hard to walk by.\n", "\nIt's right in the middle of a busy shopping section on the main strip. Saw people taking pictures with it .\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/c7/ad/24/sonny-bono-smile.jpg"}]
[{"category": "spot", "review_count": "6", "title": "McCallum Adobe, Palm Springs", "rating_string": "4.0", "address": "223 South Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nThe sign on the door says it is closed until late October. It shares the address with the Palm Springs Historical Society and it is very close to Ruddy's General Store.\nWe visited June 18, 2015 and will plan to return in peak-season so we can visit the museum.\n", "\nThis is the location of the the Palm Springs Historical Society and is free. Exhibits display the history of Palm Springs. They feature a Hollywood star each year. 2014-15 is Mamie Van Doren who was Desert Circus Queen and Miss Palm Springs. Historical Walking Tours can be booked here.\n", "\nThe McCallum House and Museum offers a window into the life of Pearl McCallum and her huge impact on the early days of Palm Springs. In the house are numerous exhibits and artifacts from old Palm Spring as well as pictures and posters. Leave ample time to review the pictures of old Palm Springs.There are pictures of Pearl McCallum with...\n\n\nMore  \n\n\n", "\nWe visited in March 2013; this attraction is located in a little square just off of South Palm Canyon Drive in Palm Springs; it is part of a collection of small historical sites all located in what is called the Village Green area. Admission is by donation ($1.00) and is by far the most interesting of several exhibits. You will...\n\n\nMore  \n\n\n", "\nThe house had all antique items. I mean the real deal. These were actual items from that era. The home was decorated as if the lady of the house in 1901 had just left for the day. It was very realistic. I was very surprised to know that the original frame and original hard wood floors were still standing and...\n\n\nMore  \n\n\n", "\nInteresting information about the beginning of Palm Springs and its development. We would recommend this.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/66/ec/5a/mccallum-adobe.jpg"}]
[{"category": "spot", "review_count": "3", "title": "Palm Springs Museum Trail, Palm Springs", "rating_string": "4.5", "address": "101 North Museum Drive, Palm Springs, CA 92262", "review_list": ["\nSpectacular views, a challenging hike, easy access and free parking - what more can you ask more. The trail starts behind the Palm Springs Art Museum in Palm Springs and you can park on the street. It is a moderately aggressive climb and you have to pick your steps so it feels like a hike not a walk - a...\n\n\nMore  \n\n\n", "\nThe Museum Trail hike trailhead is located at the far corner of the northern most Palm Springs Art Museum. Hikers should utilize on-street parking or the free parking garage across the street as the parking lot is for the museum guests.\nThis short hike is a mile and a half round trip, but be prepared. Bring water, utilize sunscreen, wear...\n\n\nMore  \n\n\n", "\nIt has been several years since I last did this trail. I chose it specifically for its intensity.\nThe trail head is located in the back of the parking lot for the Palm Springs Art Museum. While the trail is just one mile it is fairly strenuous ascending pretty much vertically up the mountain. It ends at the picnic tables...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/0a/38/ab/a6/view-across-the-valley.jpg"}]
[{"category": "spot", "review_count": "3", "title": "Certified Farmers Markets, Palm Springs", "rating_string": "5.0", "address": "Baristo Road at Camelot Theater, Palm Springs, CA 92262", "review_list": ["\nGreat vendors and wonderful produce. Leisurely Sunday morning coffee or brunch. Quiet setting and walk through the main street -- organic produce and lot's of chances to sample the goodies.\n", "\nGood place to stock up, love the grapefruit. All the products seemed to be organically grown and most by the person selling them. We went to both the Wednesday one in palm desert and Saturday in Palm Springs. About half of the venders were in both.\n", "\nGreat little gem in the dessert! Fresh and organic fruit, veggies, meats, baked goods. I few prepared food stands, a brewery, coffee smelled delicious. Saturday mornings until 12:30 pm.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "9", "title": "Sunrise Park, Palm Springs", "rating_string": "3.0", "address": "East Ramon and Sourth Sunrise Way, Palm Springs, CA 92262", "review_list": ["\nI took my kids several times and it seems a little scary since it looks like a park for homeless people. They sleep in the park and on the slides etc so kids are afraid to go play and sometimes, it smells bad. Wish they could do something about it. Otherwise, its a nice park.\n", "\nSunrise Park is on Sunrise between Ramon Road and Baristo. It is off a busy street and offers the Public Library, which borders it on the north side and a nice place to sit. On the south side sit the Mizell Senior Center and the Boys and Girls Club. The east side offers the public swimming pool and the Pavillion....\n\n\nMore  \n\n\n", "\nSunrise park has several buildings that surround the park. Boys and Girls Club, Palm Springs Library, Palm Spriings Leisure Center and baseball field where the Palm Springs Power Baseball team plays. There are jungle gyms for children to play on. During the season there are concerts in the park during the summer. Palm Spring Opera has an annual free concert...\n\n\nMore  \n\n\n", "\nMost weekends and some holidays there is family entertainment like Opera In The Park, during spring break they had run rides for the kids, a sidewalk chalk art contests, there is live entertainment on most 1st Fridays of the month and more activities.\n", "\nThis is a multi-use park, with the library, a baseball stadium, and lots of green space. Swim Center and Skate Park along one edge. Annual Opera in the Park is enjoyed by all and very popular.\n", "\nThis park was one of my first impressions of Palm Springs as we were renting nearby. I was just blown away by the shear numbers of people with bags full of bottles and cans and lots of bags of stuff laying all around this park. We also saw many of the same people repeatedly as they go around scavenging. I...\n\n\nMore  \n\n\n", "\nHaving spent a couple of evenings strolling around the lovely Ruth Hardy park, we thought we'd stop at Sunrise Park and do the same. We took a stroll around only to see the various homeless encampments and their occupants dotted around, drinking and sleeping. There were a few children playing, but under close supervision. It doesn't feel unsafe, but uncomfortable...\n\n\nMore  \n\n\n", "\nI have been visiting Palm Springs for over 20 years, and I must admit the quality and character of this park is heading downhill. The park is not kept up, and the homeless have set up camp throughout the area.\nThis is no longer a family park as I once remember, and I definitely suggest playing with caution if you...\n\n\nMore  \n\n\n", "\nThis is a beautiful park but it seems like the homeless have made it their own. There are homeless encampments on the grassy areas and homeless people sleeping in various places (some look like they're passed out). There was even a homeless person passed out right in front of the Boys And Girls Club! They do not hesitate to beg...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/04/ab/d3/d3/sunrise-park.jpg"}]
[{"category": "spot", "review_count": "2", "title": "Willis Palms Trail, Palm Springs", "rating_string": "5.0", "address": "1000 Palms Canyon Road, Palm Springs, CA", "review_list": ["\nThe trail is part of the Coachella Valley Preserve. You can make a small loop or walk further to a pond and a vista point over Moon Country. The walk along the Fan Palms is absolutely stunning. It's a unique and different landscape and the furry palm trees look spectacular from every angle. We visited with 3 teenagers who usually...\n\n\nMore  \n\n\n", "\nWe were coming back from a hike in the higher mountains and decided to take what seemed like a scenic route. We ended up at this beautiful location with a hike through the palms to a desert lake. It is real oasis!\nNo charge for entry, but donations are greatfully accepted.This was an unexpected highlight of our visit to the...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/08/30/7d/79/entrance-to-coachella.jpg"}]
[{"category": "spot", "review_count": "2", "title": "Cactus to Clouds, Palm Springs", "rating_string": "5.0", "address": "Palm Springs, CA", "review_list": ["\nGreat hike, but not for the faint of heart. We left at 4:30 am and got back down to the tram at 6:30pm, then took a cab back to our car. The hike is amazing, and the sunrise was beautiful. The last mile going up was a butt-kicker, but we made it. The most difficult part of the hike was...\n\n\nMore  \n\n\n", "\nBut worth it. Don't attempt unless you are in top physical shape and know the route. Do not hike this route during the summer. Make sure you bring around 7lt of water. Upload the gps route so you don't get off track, people have made other short cuts that could cause you some problems. Dont take items from the rescue...\n\n\nMore  \n\n\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "2", "title": "Village Center for The Arts, Palm Springs", "rating_string": "5.0", "address": "538 N. Palm Canyon Drive at Alejo Street, Palm Springs, CA", "review_list": ["\nIf you're in downtown Palm Springs, even if you're not, seriously consider a visit to this little gallery. It features works by art students and instructors, as well as local professional artists, and a great deal of what is on display is truly worth seeing...and purchasing if you're so inclined. The staff are friendly and helpful and you are likely...\n\n\nMore  \n\n\n", "\nKeeping art alive in palm springs; it's a true gem in the middle of the city. The first actual school in Palm Springs; they offer amazing art and dance classes and much more! Amazing teachers and a peaceful safe environment for children! Love It!!!!I It's an active Historic Treasure!\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "2", "title": "Palm Springs Stadium, Palm Springs", "rating_string": "4.5", "address": "1901 E. Baristo Road, Palm Springs, CA", "review_list": ["\nWhat a great way to spend an afternoon. Calf Winter Baseball League. Warm sun cold beer, 1/4 lb hot dog. Cost to get in $2.00. The best value in Plam Springs!!!!!!!\n", "\nWe enjoyed the great American pastime during our summer visit to Palm Springs. With the kids. Great fun for the whole family! Awesome giveaways every Sunday. Dollar beer on Tuesdays, discount tickets on Wednesdays and Thursdays.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "1", "title": "Uprising Rock Climbing Center, Palm Springs", "rating_string": "5.0", "address": "1500 S. Gene Autry Trail, Palm Springs, CA 92262", "review_list": ["\nif your in palm springs and feel like having some fun, go to the rock climbing center, it is awesome, bouldering cave, hard routes, nice people, big pinnacle. i went there twice while i was there, i loved it\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "3", "title": "Oasis Water Resort, Palm Springs", "rating_string": "3.5", "address": "1500 S. Gene Autry Trail, Palm Springs, CA", "review_list": ["\nPalm Springs is hot in the summer and this is the place to take kids. They will never be bored. Lots of water features to entertain them all day. They have concession stands for food, outdoor cabanas to get out of the sun.\nLocals buy passes for the summer. Great place to be.\n", "\n\"Oasis\" Waterpark no longer exists...it was purchased by Knotts several years ago and now has been transformed into a rather expensive place. Check under the listings of \"Wet 'n' Wild Palm Springs.\"\n", "\nCould be a fun place if everything was open but unfortunately not all rides and climbing area were. Kind of a rip off considering the entrance price. And parking is a ridiculous price as well. Lockers are small and expensive, and the bathroom was dirty and all areas were wet making it difficult to change into dry clothing. Don't forget...\n\n\nMore  \n\n\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "8", "title": "Red Earth Casino, Palm Springs", "rating_string": "3.0", "address": "3089 Norm Niver Road, Palm Springs, CA 92274", "review_list": ["\nTis casino is way down valley and should not be listed as Palm Springs. It is very small, with few machines and tables, be sure to check opening days in line.\n", "\nThis slot only casino is not in Palm Springs but down Highway 86 near Salton City. There is a large parking lot. On our visit the place was very busy. They've packed a lot of slot machines into the space so it's crowded and it's smoky. There is no real reason to take a trip here but as a stop...\n\n\nMore  \n\n\n", "\nOne big room filled with slot machines, and nothing else. Not even video poker. No one is smiling or even talking to each other. Half the players are smoking. My drink (in a plastic cup) had a fly in it. The 'sign' to turn off the highway is a painted-over U-Haul truck. Just a sad, poor place.\n", "\nThis is on the way South to Imperial or North to Indio on State Highway 86. A great place for a break. Has RV parking, RV dump and Gas plus a cafe and gift shop. Staff is very friendly and restrooms are clean. Full bar. Good selection of Slot machines. Watch for the old bus on the side of the...\n\n\nMore  \n\n\n", "\nThis place is not in Palm Springs. It is very small with NO table games. Mostly penny slots. Smells like smoke. The bathrooms were very nice and they have a free soda area. Better than I thought it would be but not worth the trip.\n", "\nThis casino is on the highway about a half hour out of Palm Springs. Large signs on the highway so you can't miss it. It is a small casino but has lots of penny machines.\nIf you are a new member you get $5 free play & a coupon for 2 for 1 meal at the restaurant. We tried to...\n\n\nMore  \n\n\n", "\nThis casino is not in Palm Springs. In fact, it isn't located even near Palm Springs; it is down by the Salton Sea. There are several other, nicer casinos much closer.\n", "\nA place to stop with cheap gas, a Subway Restaurant, and some slot machines, $2 shrimp cocktails that are mostly celery. Very tight machines. Near the Salton Sea State Reserve\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/09/a0/72/f4/red-earth-casino.jpg"}]
[{"category": "spot", "review_count": "1", "title": "Frank Bogert Trail, Palm Springs", "rating_string": "4.0", "address": "Andreas Hills Dr, Palm Springs, CA 92264", "review_list": ["\nThe trail is a winding trail into the San Jacinta mountains and across some of the desert. It is a moderate trail and it is quite easy Trail down and it was much steeper and would have been more challenging to climb up, particularly in warm weather. It is worth the hike.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "22", "title": "Social Cycle, Palm Springs", "rating_string": "5.0", "address": "Palm Springs, CA", "review_list": ["\nA great time had by all. The meeting place was easy to find. Captain Lou was great! He encouraged us to bring along and play our own music while we peddled through Palm Springs. Group shooters at the last stop were enjoyed by all before a downhill coast ride back to the starting point. If you don't come with your...\n\n\nMore  \n\n\n", "\nGood times with good people! What a way to see Palm Springs! Although it was work, the drinks at each spot were worth it!\n", "\nSo much fun! Meet an awesome group of people and Lou was an amazing guide! Only wish it would have lasted longer\n", "\nMy friend and I went on Social Cycle on a Saturday evening, and had a blast! There were 12 people total, and they were all so much fun! Our driver, Lou, was fantastic! Definitely recommend!!! 👍🏻\n", "\nMy husband and I went on the Social Cycle with nine other strangers who became fast friends. Lou was our very competent Captain. We did get a discount on the tickets so it was very affordable. We stopped at three bars (Hard Rock Café, Hair of the Dog and Tonga Hut). It was a was a lot of fun and...\n\n\nMore  \n\n\n", "\nBooked the Social Cycle to celebrate some big birthdays! 70! 50! 40! We had a group of 13 family & friends! Our son took his IPod loaded w/songs we all knew & could sing along to. Eautiful Palm Springs afternoon, very personable Team Captain, Lou, made for a very enjoyable, memorable time.\n", "\nRecommend to have adjustable seats or pedals for shorter people. Great fun blasting the music and singing along with Lou!\n", "\nMust do - especially with a big group. We had 16 people for a birthday party and it was the highlight of the trip. And a good workout too...\n", "\nMy family and I had a great time on Social Cycle! We did a 5:30 trip that hit 3 bars. Our only complaint was that we stopped at the Hard Rock, which seemed a bit hokey (would have rather done a local bar). Other than that it was a great time that went by very quickly!\n", "\nMy friends and I love to visit Palm Springs! The only thing lacking has been then night life, till now!!!! Thank you Social Cycle for answering our prayers. This crazy cool 15 person pedaling bar on wheels is the best thing to happen to this city. We took the bike out for night of high energy bar hopping and exploring....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/66/2c/1e/social-cycle.jpg"}]
[{"category": "spot", "review_count": "16", "title": "Desert Adventures Red Jeep Tours, Palm Springs", "rating_string": "4.5", "address": "200 S. Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWent on the desert tour with Lane as our tour guide. This was a first class tour. Lane was extremely knowledgable about all aspects of the desert as well as the surrounding area. We had a lot of fun visiting an oasis and climbing through the rocks that were cut away by the flash flooding that occurs from time to...\n\n\nMore  \n\n\n", "\nWe did the sunset & stargazing tour which we really did enjoy. Our tour guide Teri was extremely knowledgeable and knew a lot about the area and the history which we found fascinating. It's a small personal tour (max 6ppl) which is nice. It does go for a while though and I'm glad we had a large late lunch first...\n\n\nMore  \n\n\n", "\nOur naturalist guide, Jeri, gave us a super tour of the private Metate preserve starting at 8am with just one other family. We were pleased to learn so much about the native Cahuilla people, geology, flora and fauna from Jeri. She had excellent teaching tools like maps, graphs, palm berry, mesquite bean, lifesize village reproductions, arrowheads, etc. which enhanced 3...\n\n\nMore  \n\n\n", "\nWe just took a several hour tour of Palm Springs via jeep with Morgan. It was one of the most informative and fun experiences I have had on vacation for a long time. Morgan has encyclopedic knowledge of the region! We had fun both in and out of the jeep. Would recommend this activity for people who really want to...\n\n\nMore  \n\n\n", "\nWe took this tour with our guide, Tom. We saw some beautiful landscape, learned quite a lot from the very interesting and informative information imparted by our guide. He was a well of knowledge and pretty funny to boot. Got some fantastic photos of the fault zone, the variety of foliage and lastly some night time views at the stargazing...\n\n\nMore  \n\n\n", "\nVery pleasant guide gave an informative tour of a nice but tiny property which included a tiny reconstruction of an historic native village. The tour mostly consisted of small stops with educational discussions connected by a couple minutes of driving. The overall effect was that of a lame school tour.\nNo adventure sadly.\n", "\nDe was great tour guide full of info of the land\nsaw a beautiful Oasis two rattler snakes\nGreat time great pictures thank you De\n", "\nOur guide was very knowledgeable about the area, problem was, it just wasn't that interesting. Saw 3 hours of desert; unfortunately you face inward at the other travelers sitting across from you, instead of out where you could enjoy the view. Not special enough to support the price.\n", "\nFor 3 hours Dick, our guide, shared his knowledge and love of the desert. He was a great story teller and we all thoroughly enjoyed\nourselves. The fault line was very\ncool and we even saw 3\nrattlesnakes! It was a great adventure! Thanks so much Dick.\n", "\nReally enjoyed. Very informative!\nBeautiful sites, interesting facts on local vegetation, native people and the geography of area. Darrell was a great host and very knowledgeable.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/06/0f/a9/86/desert-adventures-eco.jpg"}]
[{"category": "spot", "review_count": "14", "title": "The Modern Tour, Palm Springs", "rating_string": "5.0", "address": "Downtown Palm Springs, Palm Springs, CA 92270", "review_list": ["\nWe expected much more from this rather pricey mid century modern home tour. It was just average and not really worth the $150 per person. There are other tours available that are a far better value for the money. Michael was nice enough and knowledgable but the tour was lacking.\n", "\nThe tour guide, Michael, has literally written and is writing another book about Palm Springs' \"Modern\" architecture. Toss in his video too and you'll learn from him why, what, and how this architecture came to be. As others have said, he's attentive to his guests and his enthusiasm for everything about Palm Springs is contagious.\n", "\nI gave this to my parents for a gift and they loved it. They were very impressed by the guide's knowledge! He was able to make it interesting and fun! I did all the booking via email it couldn't have been easier!\n", "\nMy husband and I are both aficionados of architecture, particularly mid-century and modern. This tour is not to be missed. Michael was very knowledgeable and engaging, and we were able to enjoy not only exterior views all over town, but interior tours of 2 exceptional properties. He limits the tours to 6 people, so the size of the group is...\n\n\nMore  \n\n\n", "\nThis tour is very special because of the amazingly well-informed, friendly, attentive Michael, who has access to interior spaces as well as the beautiful exteriors of Palm Springs residences -- including those designed by some leading American architects, those owned by some leading Hollywood and TV stars and those of historic significance. It is expensive, but well worth the cost....\n\n\nMore  \n\n\n", "\nI enjoy architecture and the mid-century modern movement. I booked the tour via email. It was a bit expensive ($150.00) but it certainly was a good \"investment\".\nOur guide Michael took us on a 3 hour tour, stopping at numerous homes and explaining with great detail the features of the home. He also knew a lot about the history of...\n\n\nMore  \n\n\n", "\nThe highlight of my two days in Palm Springs was the Modern Tour!\nHaving a 4 person tour with our knowledgable guide made it so enjoyable and easily customized for our interests. The stories and experience I had in the first 15 minutes made it worth the price of admission. I'm not an Elvis fan and hearing the detailed stories...\n\n\nMore  \n\n\n", "\nThis tour was expensive but worth the money. It was a private tour with just my husband and I and we were able to go inside some of the homes, including Elvis's honey moon retreat. Michael gave us an extensive overview of some fabulous architecture and Palm Springs itself. I generally don't like tours but this was special. It included...\n\n\nMore  \n\n\n", "\nas our host on this tour. He drove us by many architecturally significant homes and described features we would never have understood. We also were able to go inside two homes, which was fabulous. This was the highlight of our Palm Springs visit. Take this tour.\n", "\nMy husband and I were fortunate to be Mr. Stern's only guests on our tour, and it was a fantastic time. To us, getting to experience the interiors is huge, and we got into four amazing, very diverse homes. We're both huge fans of Mid-century architecture, and have done a fair amount of reading and touring. Listening to Mr. Stern,...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/53/54/ad/the-modern-tour-private.jpg"}]
[{"category": "spot", "review_count": "16", "title": "Desert Adventures Red Jeep Tours, Palm Springs", "rating_string": "4.5", "address": "200 S. Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWent on the desert tour with Lane as our tour guide. This was a first class tour. Lane was extremely knowledgable about all aspects of the desert as well as the surrounding area. We had a lot of fun visiting an oasis and climbing through the rocks that were cut away by the flash flooding that occurs from time to...\n\n\nMore  \n\n\n", "\nWe did the sunset & stargazing tour which we really did enjoy. Our tour guide Teri was extremely knowledgeable and knew a lot about the area and the history which we found fascinating. It's a small personal tour (max 6ppl) which is nice. It does go for a while though and I'm glad we had a large late lunch first...\n\n\nMore  \n\n\n", "\nOur naturalist guide, Jeri, gave us a super tour of the private Metate preserve starting at 8am with just one other family. We were pleased to learn so much about the native Cahuilla people, geology, flora and fauna from Jeri. She had excellent teaching tools like maps, graphs, palm berry, mesquite bean, lifesize village reproductions, arrowheads, etc. which enhanced 3...\n\n\nMore  \n\n\n", "\nWe just took a several hour tour of Palm Springs via jeep with Morgan. It was one of the most informative and fun experiences I have had on vacation for a long time. Morgan has encyclopedic knowledge of the region! We had fun both in and out of the jeep. Would recommend this activity for people who really want to...\n\n\nMore  \n\n\n", "\nWe took this tour with our guide, Tom. We saw some beautiful landscape, learned quite a lot from the very interesting and informative information imparted by our guide. He was a well of knowledge and pretty funny to boot. Got some fantastic photos of the fault zone, the variety of foliage and lastly some night time views at the stargazing...\n\n\nMore  \n\n\n", "\nVery pleasant guide gave an informative tour of a nice but tiny property which included a tiny reconstruction of an historic native village. The tour mostly consisted of small stops with educational discussions connected by a couple minutes of driving. The overall effect was that of a lame school tour.\nNo adventure sadly.\n", "\nDe was great tour guide full of info of the land\nsaw a beautiful Oasis two rattler snakes\nGreat time great pictures thank you De\n", "\nOur guide was very knowledgeable about the area, problem was, it just wasn't that interesting. Saw 3 hours of desert; unfortunately you face inward at the other travelers sitting across from you, instead of out where you could enjoy the view. Not special enough to support the price.\n", "\nFor 3 hours Dick, our guide, shared his knowledge and love of the desert. He was a great story teller and we all thoroughly enjoyed\nourselves. The fault line was very\ncool and we even saw 3\nrattlesnakes! It was a great adventure! Thanks so much Dick.\n", "\nReally enjoyed. Very informative!\nBeautiful sites, interesting facts on local vegetation, native people and the geography of area. Darrell was a great host and very knowledgeable.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/06/0f/a9/86/desert-adventures-eco.jpg"}]
[{"category": "spot", "review_count": "26", "title": "O'Donnell House Historic Tour, Palm Springs", "rating_string": "5.0", "address": "412 W. Tahquitz, The Willows Historic Palm Springs Inn, Palm Springs, CA 92262", "review_list": ["\nIf you can afford it, you frequent Palm Springs, you love golf and you rent downtown Palm Springs, you should consider joining. The course will not disappoint you. The setting is glorious. The restaurant (old O'Donnell house) is superb. Service unparalleled. I've played here now four times and I luv it. My friend joined and she takes me with her....\n\n\nMore  \n\n\n", "\nOne of the most amazing vistas in Palm Springs. Great, architecturally significant property that is a must see.\n", "\nJust took this tour with Steve as our guide. Steve initially told us that this place was \"magical\" and that's just how I felt about it. I had no idea about the history of this place and surrounding area and Steve explained it all in a wonderful storytelling manner. There is no place in the Palm Springs area with this...\n\n\nMore  \n\n\n", "\nWe did the O'Donnell House historic tour last March (2014) and were very impressed. We reserved a few days in advance and ended up being the only others on the tours, we we had a private 2 hour tour. Our guide was very knowledgeable and we very much enjoyed hearing not only about Mr O'Donnell's story but also of the...\n\n\nMore  \n\n\n", "\nWe booked this tour via phone call to Steve~ the Tour Guide~ about two weeks ahead of our travel date. He can be reached at (760) 320-0771 or (800) 966-9597. The cost is $45.00 per person.\nSteve was very accomodating and a terrific story teller!\nThe house was beautiful inside & out and the tales of the owner & his...\n\n\nMore  \n\n\n", "\nThis was our first trip to the Palm Springs area, and we decided to begin our stay with a tour of the O'Donnell House based on previous reviews of the tour and its guide, Steve. From the minute we spoke with Steve to arrange the tour, we knew that we would not be disappointed. HE makes the tour! Engaging, entertaining,...\n\n\nMore  \n\n\n", "\nSteve was well studied and personable. The house has a lovely view, probably the best view, over downtown Palm Springs and the whole valley. As Steve said, a 180 degree view.\nHe explained that the house was designed by a painter/artist, not a architect, which accounts for it's beauty. He was able to bring some of the historic founders of...\n\n\nMore  \n\n\n", "\nSteve, our guide, was incredible!. He described the history of the O'Donnell House with so much knowledge. He is an excellent story teller. He gave us lots of history of Palm Springs in this tour. I did not tune out as I sometimes do with tour guides. It was fantastic! The house is used for weddings and I can see...\n\n\nMore  \n\n\n", "\nThere is a lot of history on this tour of the most unusual architecture and breathtaking views. Explaining much about the residence and grounds would spoil it for you.\nBut the guide himself - Steve - needs reviewing. He came to the valley only a year and a half ago to write a book on the story of the property....\n\n\nMore  \n\n\n", "\nThis private tour was led by our extremely knowledgeable guide Steve who met us right along the side of the Palm Springs Art Museum. He gave us an overview of the area, the history of Tom O'Donnell which also included the adjoining golf club. We then headed up the hill in a golf cart past the stacked rock walls where...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/04/ab/b0/0f/o-donnell-house-historic.jpg"}]
[{"category": "spot", "review_count": 0, "title": "P.S. Walk With Me, Palm Springs", "rating_string": 0, "address": "Palm Springs, CA 92262", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "46", "title": "BIKE palm springs, Palm Springs", "rating_string": "5.0", "address": "625 North Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nBald, middle aged, short, owner? snapped at us when we pointed out problems with his bikes telling us to find one that worked. Should have left then as bike we chose did not shift right and brakes stuck. Helmets were filthy so had to wear hats underneath.\n", "\nWe opured Palm Springs on bicycles that we rented from BIKE Palm Springs. It is a fantastic way to see the city, stopping every once in a while to enjoy the beautiful vistas while capitalizing on the weather which was perfect for cycling.\nThe bike experts at the shop were most accommodating in all ways. We chose premium bikes which...\n\n\nMore  \n\n\n", "\nWe enjoyed the opportunity to rent bikes at a reasonable price. The staff was very friendly and helpful. And the bikes were of good quality and condition. Be sure to bring extra water. It's hot out there!\n", "\nWhile my husband was at a\nConference I decided to take an uber downtown and rent a bike. The staff was super helpful and suggested places to ride. The area is extremely bike friendly. Just biking through the old Palm Springs neighborhoods is worth it. The architecture is awesome and the scenery is beautiful! Even if you ride for an...\n\n\nMore  \n\n\n", "\nWhat an awesome way to explore and move about Palm Springs. The staff was extremely helpful with suggesting routes and things to do in town.\n", "\nA friend suggested we get some bikes and ride around the great neighborhoods. What fun! We got Townies and they were easy to ride and safe. Stay away from the main drags but otherwise it's a great time. Head to Old Las Palmas for most enjoyable ride. Staff was nice and price was reasonable.\n", "\nStaff at Bike PS are really friendly. I exchanged my bike 3 times for size/comfort and they seemed as happy to see me the third time as the first. Palm Springs is flat and mostly bikeable - some downtown streets signed as \"bicycle routes\" and listed on the bike map Bike PS give you do get busy, but there are...\n\n\nMore  \n\n\n", "\nGrab a book on stars houses and get yourself a bike here. We rented bikes twice from here. Got great Townie bikes, which are perfect for seeing the city. They had baskets and locks. It's fairly flat if you stay away from the mountains. Plenty of amazing neighborhoods to check out. Movie Colony, Las Palmas--grab a guide book and peddle...\n\n\nMore  \n\n\n", "\nWe booked 8 bikes to be delivered to our home for the second weekend of Coachella. The morning of the delivery two people in our party had an emergency and had to fly home. The folks at Bike Palm Springs were understanding and helpful in resolving any issues we had. The bikes were then picked up on Monday when discussed....\n\n\nMore  \n\n\n", "\nI rented a bike with BIKE Palm Springs to go to Coachella by bike. The bike was delivered and picked up at my motel and they even swapped my bike when I had a flat tier on day 2. That is what I call excellent service! Bike was also good.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/51/80/cc/the-mountains-above-palm.jpg"}]
[{"category": "spot", "review_count": "6", "title": "EagleRider Motorcycle Rentals, Palm Springs", "rating_string": "5.0", "address": "74855 Country Club Drive, Palm Springs, CA 92260", "review_list": ["\nCame into town for a business conference and was told a few guys from the conference were going for a ride. I joined in and was overwhelming pleased. Jeremy the manager did a great job taking us on a tour of Southern California. We put on 284 miles! Lot of seat time but we also did hit some sight seeing...\n\n\nMore  \n\n\n", "\nI had an awesome time riding the back way thru Box Canyon into Joshua Tree National park. It felt great to ride a beautiful Harley Davidson all day. The staff set me up with a well maintained ride that looked great. I have since joined a Eagle rider club which allows me to rent a bike a month for a...\n\n\nMore  \n\n\n", "\nMy partner and I rented a Street Glide for a day from Eagle Rider and took up an offer from Will Huffor to act as our guide for the day. The bike was cool, unlike the 106 degrees in the valley, but we had a great time, especially as Will led us up to Idyllwild which was a cool place...\n\n\nMore  \n\n\n", "\nWe set up our reservation almost a week in advance knowng that we were in the busy season for motorcycle rentals (this is highly recommended to be sure you get what you want in the way of a ride). We have rented bikes through Eaglerider for several years and in many locations. The experience has been great all but once...\n\n\nMore  \n\n\n", "\nKoodo to the guys from LA too Palm Springs. With the weather back home being what it is , this trip could not have been done without y'all. The in dash gps really made it easy. Anytime we wondered we could just punch in the address and put it in gear. Lots of fun just riding and then putting the...\n\n\nMore  \n\n\n", "\nHave rented bikes about every year I come here from PS Eaglerider for 10 years now and have never been disappointed. Bikes are generally new and well maintained, staff is cool and fun to deal with. They take pre-riding safety and technical instructions serious and give you valuable hints as to where to go or what to do in the...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/05/db/ba/9f/eaglerider-motorcycle.jpg"}]
[{"category": "spot", "review_count": "1", "title": "Try a Bike, Palm Springs", "rating_string": "4.0", "address": "70-053 Highway 111 between Country Club and Frank Sinatra, Palm Springs, CA", "review_list": ["\nwe pd $20 each and had the bikes for 4 hrs ..took the biggest loop on the map.. only one hill\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "24", "title": "Fame Wine & Cigar Lounge, Palm Springs", "rating_string": "4.5", "address": "155 S Palm Canyon Dr, Palm Springs, CA 92262", "review_list": ["\nGreat spot to sit and sip some good wines. People watching is great on the patio and the backroom has fun art, comfy chairs and great atmosphere. I'm not into cigars but my friend loved the variety and quality. we visited 4 times in 6 days. Knowledgeable staff.\n", "\nFame is an over-priced place where the woman who owns the joint is not only sour and anti social she's money hungry. The cigars are marked up higher than any place in town and if you take your own cigars and drink wine or beer they charge you $10.00 per cigar! Even when you buy their cigars at the high...\n\n\nMore  \n\n\n", "\nThis is a great place to grab a glass of wine and set on the patio and people watch. Frankie is the bomb!\nGreat wine selection and if you’re into cigars they know their stuff.\n", "\nNot your run on the mill cigar shop. With a huge humidor and a great selection of cigars and smoking accessories. Close to downtown.\n", "\nI went here to purchase some cigars for my husband back in Texas. The selection was surprising quite nice. Prices were I'd say normal for what you would expect in a \"tourist town\". Wine selection is very good. Loved all the empty wine crates of Opus One that were on their shelves. Will bring my husband next time. He would...\n\n\nMore  \n\n\n", "\nI stopped here everyday after diner to make a purchase and then sit outside and enjoy the aroma of a crisp fine cigar. The Staff were able to answer all the questions and help me make a satisfying selection. I also purchased some cigars to bring home that you cant find where I live. The salesperson was able to pack...\n\n\nMore  \n\n\n", "\nSomething for everyone. ... Cigars, craft beers, wine. Inside and outside seating. Friendly, helpful staff. Music was too loud, we couldn't hear each other talk. We ordered 3 glasses of white wine. Each a different variety. When server brought them she wasn't sure which was which. We had to taste then trade to get it right. She also had a...\n\n\nMore  \n\n\n", "\nIf you enjoy your cigar perfect place sit outside and have a lovely glass of wine and watch all go by, nice and relaxing and nice staff\n", "\nDid a drive-by to get a bottle of wine to drink at the hotel. I don't smoke, so I won't get into the hermetically-sealed-cigar-room aspect of things. By the time I paid and got back to the car, I smelled like smoke. Notwithstanding, they have chilled bottles to take out.\n", "\nVery clean store, and staff was helpful knowledgeable on products. The smoking room (cigars only) was a relief to have a glass of wine in to get out of the sun, and my husband was able to puff on his freshly bought cigar while having a game of chess. The bar has a 1 drink minimum, but it was a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/5f/de/c0/filename-img-4442-jpg.jpg"}]
[{"category": "spot", "review_count": "16", "title": "Desert Adventures Red Jeep Tours, Palm Springs", "rating_string": "4.5", "address": "200 S. Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWent on the desert tour with Lane as our tour guide. This was a first class tour. Lane was extremely knowledgable about all aspects of the desert as well as the surrounding area. We had a lot of fun visiting an oasis and climbing through the rocks that were cut away by the flash flooding that occurs from time to...\n\n\nMore  \n\n\n", "\nWe did the sunset & stargazing tour which we really did enjoy. Our tour guide Teri was extremely knowledgeable and knew a lot about the area and the history which we found fascinating. It's a small personal tour (max 6ppl) which is nice. It does go for a while though and I'm glad we had a large late lunch first...\n\n\nMore  \n\n\n", "\nOur naturalist guide, Jeri, gave us a super tour of the private Metate preserve starting at 8am with just one other family. We were pleased to learn so much about the native Cahuilla people, geology, flora and fauna from Jeri. She had excellent teaching tools like maps, graphs, palm berry, mesquite bean, lifesize village reproductions, arrowheads, etc. which enhanced 3...\n\n\nMore  \n\n\n", "\nWe just took a several hour tour of Palm Springs via jeep with Morgan. It was one of the most informative and fun experiences I have had on vacation for a long time. Morgan has encyclopedic knowledge of the region! We had fun both in and out of the jeep. Would recommend this activity for people who really want to...\n\n\nMore  \n\n\n", "\nWe took this tour with our guide, Tom. We saw some beautiful landscape, learned quite a lot from the very interesting and informative information imparted by our guide. He was a well of knowledge and pretty funny to boot. Got some fantastic photos of the fault zone, the variety of foliage and lastly some night time views at the stargazing...\n\n\nMore  \n\n\n", "\nVery pleasant guide gave an informative tour of a nice but tiny property which included a tiny reconstruction of an historic native village. The tour mostly consisted of small stops with educational discussions connected by a couple minutes of driving. The overall effect was that of a lame school tour.\nNo adventure sadly.\n", "\nDe was great tour guide full of info of the land\nsaw a beautiful Oasis two rattler snakes\nGreat time great pictures thank you De\n", "\nOur guide was very knowledgeable about the area, problem was, it just wasn't that interesting. Saw 3 hours of desert; unfortunately you face inward at the other travelers sitting across from you, instead of out where you could enjoy the view. Not special enough to support the price.\n", "\nFor 3 hours Dick, our guide, shared his knowledge and love of the desert. He was a great story teller and we all thoroughly enjoyed\nourselves. The fault line was very\ncool and we even saw 3\nrattlesnakes! It was a great adventure! Thanks so much Dick.\n", "\nReally enjoyed. Very informative!\nBeautiful sites, interesting facts on local vegetation, native people and the geography of area. Darrell was a great host and very knowledgeable.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/06/0f/a9/86/desert-adventures-eco.jpg"}]
[{"category": "spot", "review_count": "15", "title": "WorkOUT Gym, Palm Springs", "rating_string": "4.5", "address": "2100 N Palm Canyon Drive, Suite C100, Palm Springs, CA 92262", "review_list": ["\nNot big but everything you need and more. All new and clean. Sauna and large showers. Free bar. Attractive and friendly crowd. Nice staff 😉\n", "\nThis is a small, very poorly equipped hive of 3 or 4 rooms calling itself a gym. They attempt to cater to the gay community, but the attitude of the desk staff is beyond rude. There is a shirts optional policy, and it is not uncommon to see specimens flaunting physiques which are not what one would hope to see....\n\n\nMore  \n\n\n", "\nThis is a gem in the desert.\nI'm here for two months and am SO glad I joined when I arrived. It's a small space, but has all the equipment and sauna you need, and the staff couldn't be friendlier. The locker room is tight (as are the showers), but it works well.\n", "\nI much prefer this to the more popular Worlds Gym. All the machines one could want, and the staff very friendly and accommodating.\n", "\nI was the second review for this great local gym but given incomplete construction I couldn't quite justify the full 5 stars. Now that everything is complete, and judging by how many cars are now in the parking lot at 10AM on a weekday word is OUT!\nAnd what's truly amazing is that despite change in ownership - it feels...\n\n\nMore  \n\n\n", "\nThis is a great gym if you want to go when have a great workout and leave. It's mostly older gay man. It's a very nice, clean and well-kept gym.\n", "\nOn my visits to Palm Springs, I always choose WorkOUT gym. The weight training equipment is good, there's a good range of free weights, good cardio equipment and a stretching area.\nThe gym is rarely crowded and the clientele friendly.\nIn addition, the gym is spotlessly clean, the staff are friendly and helpful and there's a range of free snacks,...\n\n\nMore  \n\n\n", "\nI'm spoiled; I admit it. Back in the middle of nowhere, where I live, we have Lifetime Fitness, which is more a mall than a gym. And it's that large and fully stocked gym, which, unfortunately, colors my judgment about other gyms.\nPalm Springs is an enigma to me: so many gay men, so concerned with their health and actively...\n\n\nMore  \n\n\n", "\nGreat place. It has everything you need for great workouts. Good music,, friendly, coffee and snacks too, all included. Great deal all the way around. l\nlove it there !!\n", "\nOn a recent trip to Palm Springs I used this gym whilst staying at the excellent nearby Ivy Resort and Spa. I was very and pleasantly surprised. I expected a very mediocre gym but found it to offer everything I wanted in a gym. Good equipment and very friendly staff. I recommend it.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/39/76/80/workout-gym.jpg"}]
[{"category": "spot", "review_count": "1", "title": "Ecore Fitness, Palm Springs", "rating_string": "5.0", "address": "285 South Palm Canyon Drive Suite D6, Palm Springs, CA 92262", "review_list": ["\nSean and his team at Ecore Fitness are not only the best in Palm Springs, but thanks to the incredible amount of experience, sheer hard work to be the best and most of all passion for what they do, I would say they're pushing new limits for excellence on a global platform.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "1", "title": "Palm Springs Fitness, Palm Springs", "rating_string": "4.0", "address": "Sunrise Way, Palm Springs, CA", "review_list": ["\nAfter visiting a few gyms in California I struggled to find one in Palm Springs. This one is great for the serious fitness person.\nIt's a little expensive on day rate fees $15 a day were others are usually $10. The extra fee does not mean better in this circumstance. Good CV machines and a good mix of weights, stations...\n\n\nMore  \n\n\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "3", "title": "Bikram Yoga University Village, Palm Springs", "rating_string": "5.0", "address": "36939 Cook Street, Suite 101, Palm Springs, CA 92211", "review_list": ["\nThis place is so nice. The ladies I've met who work here are so kind and welcoming and it's not intimidating at all. I've noticed people of a variety of levels/age/health come here. The facilities are clean and seem new. The state of the locker room/showers are well above your standard gym. They provide the little extras that make it...\n\n\nMore  \n\n\n", "\nWords fail me trying to describe the intensity of feelings Bikram Yoga brings to me each and every visit...it's hard work, it's intense, it's deeply richly fulfilling and satisfying.\nThis is a fine studio in every way with recent addition of new class offerings, hot and cooler..... Go if you can. Worth every penny and more.\n.\n", "\nIt's not just about yoga at Bikram Yoga University Village. It is about life, and specifically, your individual life. One is welcomed with open arms by mindful instructors who lead you to healing your body, mind and spirit through the 26 movements and positions. My 75 minutes of open eyed meditation always gives me inspiration to make my day a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/08/89/d4/64/getlstd-property-photo.jpg"}]
[{"category": "spot", "review_count": "2", "title": "Yoga in the Park by Power Yoga, Palm Springs", "rating_string": "5.0", "address": "333 N Palm Canyon Dr, # 214, Palm Springs, CA", "review_list": ["\nI was visiting from out of town and went to Power Yoga based on yelp review\nI was staying at Hyatt and it is next to it...3 minute walk. Great experience and very relaxing.\n", "\nWe come to Palm Springs at least once a year and this is the first time I've gotten up the nerve to visit a yoga class or two away from home.\n1. Power Yoga Palm Springs: beautiful studio, great classes, love the teachers!!!\n2. Yoga in the park: what fun! 8am isn't too hot yet, and the park is gorgeous!...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/06/c8/ee/5d/yoga-in-the-park-by-power.jpg"}]
[{"category": "spot", "review_count": "1", "title": "Urban Yoga Center, Palm Springs", "rating_string": "5.0", "address": "458 South Palm Canyon Dr, Palm Springs, CA 92262", "review_list": ["\nIf you like to practice yoga when you travel, check out Urban Yoga. You'll love the authentic atmosphere...this is not a gym, not a brand yoga, this is the real thing. A real sense of family and welcoming to all. Regulars and visitors love the great teachers and warmth of the studio. There is a boutique, too, if you want...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/07/84/80/c4/urban-yoga-center.jpg"}]
[{"category": "spot", "review_count": "6", "title": "Carnival Cabaret, Palm Springs", "rating_string": "5.0", "address": "125 E Tahquitz Canyon Way, Oscar's Cafe & Bar, Palm Springs, CA 92262", "review_list": ["\nWe arrived at the airport in Palm Springs and discovered a restaurant nearby called Oscars. Not only was our lunch great, but the waiter enthusiastically told us of other offerings there. One attraction was the Carnival Cabaret. We decided to go back the following night. We were seated in a small, intimate environment. The drinks were perfect and not expensive...\n\n\nMore  \n\n\n", "\nWe were invited by a friend to see this show and did not know exactly what to expect.\nWhat we got was one of the funniest and entertaining evenings that we have had in years.\nThe shows Host James \"Gypsie\" Haake is a longtime entertainer from Hollywood having done many films with stars such as Joan Collins and Mel Brooks...\n\n\nMore  \n\n\n", "\nThe Entertainment is wonderful, this Show star's the grate James \"Gypsy\" Haake who is a very talented actor / artist who has played in many films / TV ? and theater from New York to Hollywood California, he was at the grate \"La Cage\" in Hollywood from the 80's where I saw him 3o years ago, he is still as...\n\n\nMore  \n\n\n", "\nCarnival Cabaret is a really fun celebrity look-alike cabaret show based in Palm Springs. It's so entertaining. Reminiscent of the La Cage show originally in Los Angeles. Host Gypsy is a veteran actor with a biting wit. Fans of Dolly Parton, Lady Gaga, Dionne Warwick, Reba McEntire, Whitney Houston, Bette Midler and many others will definitely be entertained. The dinner...\n\n\nMore  \n\n\n", "\nThe show came recommended from friends and we saw some holiday weekend tickets on Goldstar, so why not. We went in not knowing a lot about it.\n\"Aunt Gypsy\" holds the distinction of being the oldest working female impersonator on the planet at 83, and with all those years comes an experience and a quick wit on interactions with the...\n\n\nMore  \n\n\n", "\nI was searching for something fun to do with my daughter for her 19th birthday. I was enthusiastically happy to find Carnival Cabaret in Palm Springs. I wasn't sure what to expect when we walked in. We were graciously greeted as I explained what we were planning. The show was sold out however they accommodated us by opening one final...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/08/6e/ee/0d/dionne-warwick.jpg"}]
[{"category": "spot", "review_count": 0, "title": "Live It Up Productions, Palm Springs", "rating_string": 0, "address": "787 N Palm Canyon Dr, Palm Springs, CA 92262", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "19", "title": "Zelda's Nightclub, Palm Springs", "rating_string": "3.5", "address": "611 S Palm Canyon Drive, Palm Springs, CA 92264", "review_list": ["\nOur first weekend trip to Palm Spring to see the Hot Air Balloon Festival in Cathedral City, 10 minutes away. We booked a room @ Motel 6 the last minute and drove thru Downtown Palm Spring wondering what to do. Lots of shops and restaurants along Palm Canyon Dr. SPA CASINO RESORT is great place to eat, reasonable prices and...\n\n\nMore  \n\n\n", "\nWe go to Palm Springs every summer and always go to Zelda's. This year the vibe was different, the music was different and even the patrons were different. I didn't enjoy myself as I have in the past.\n", "\nAfter paying 20 for cover it was a slow night i guess,Clean, weak drinks. i didn't feel safe i saw one guy that looked like a thug threaten another who was talking with an employee and him getting kicked out. i cant believe they let the thug stay so we got up and left finding another bar ( the village...\n\n\nMore  \n\n\n", "\nGreat show on Friday night at 10:30. Pick up a card for VIP, no cover charge at hotel desk.Great DJ, lighting, people, and drinks!\n", "\nMy husband and I were charged $20 for entry and another couple of a different ethnic background was charged $10. My husband was frisked before being allowed in. Once inside the club, the bouncer made sure to tell us that the previously unoccupied table where we were sitting belonged to someone else and we'd have to move when the guests...\n\n\nMore  \n\n\n", "\nWe had a blast for my friends batchelorette party!!I called ahead to reserve tables and we had tables right next to the dance floor.They treated us great !!Everyone bartenders,waitress and the men at the door were all so nice and very accomidating.Great dj and music too!!I will definality go back.\n", "\nMy friends and I opted for table service at Zeldas. We were not disappointed. The waitresses were friendly and attentive. Anyone who visits Palm Springs and is looking for fun, look no further!\n", "\nI used to live in Palm Springs and attended the grand opening of Zelda's a long time ago. It was great then....BUT it only took a few years to get a seedy gang-banger/gangsta and Italian mobster-hangout reputation. You had to be very careful who you spoke with & had to walk on eggshells to avoid problems....I quit going.\nBUT NOW...\n\n\nMore  \n\n\n", "\nI have been to the old Zelda's and to be honest it was kinda ghetto. The new club however is like night and day! I am so impressed with the changes that it has gone through. The gangster element is almost nonexistent and it seems that there is a dress code there now that is strictly enforced! So much better!\n", "\nZelda's new place is amazing. They have a great staff and the girls flock there.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "4", "title": "Copa Room, Palm Springs", "rating_string": "3.5", "address": "244 E. Amada Rd., Palm Springs, CA 92262", "review_list": ["\nThe space was poorly designed. The back lounge area is not high enough to see the stage. The material used on the sofas is very hot. There was an odor in the place like the after smell of clean up in a pet salon. It was so strong that it was hard to get past it.\nThe piano for our...\n\n\nMore  \n\n\n", "\nOne evening I was treated to a performer who barely had room to stand up on the silly little platform they call a stage. This place is a physical embarrassment; I've been to dive bars in New York with a better stage for entertainers. The room is pathetic; the acoustics are terrible; the lighting is laughable. The house wine is...\n\n\nMore  \n\n\n", "\nKyle Massey performed last week at the Copa Room. This great looking young man with a gorgeous voice has been a Broadway star and currently can be seen on \"Nashville\" in a recurring roll. His performance included wonderful life stories as well as a variety of music from different genres. The Copa has a list of upcoming performers, and it's...\n\n\nMore  \n\n\n", "\nExperience the Thursday night show, Lipstick with host Bella da Ball. Great performers and lots of fun, starting at 8:00PM. No cover charge. Pizza can be ordered and sent over from the restaurant next door. A fun evening with very talented performers, you won't be sorry you went.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/08/43/fa/4c/copa-room.jpg"}]
[{"category": "spot", "review_count": 0, "title": "Muriel's Supper Club, Palm Springs", "rating_string": 0, "address": "Palm Springs, CA", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "4", "title": "Escape Room Palm Springs, Palm Springs", "rating_string": "5.0", "address": "560 S. Williams Rd, Palm Springs, CA 92264", "review_list": ["\nWe love escape rooms, so we took a day trip to drive out to Palm Springs to play all three games at this company today. It was worth it. Each room is a different theme. The Mystery room is a lot of fun, especially for people that want to play a lighter more upbeat puzzle game with their family. The...\n\n\nMore  \n\n\n", "\nUnusual whole family experience, needed to think but great fun. Team bonding, stress raising,Brain testing, Looked unusual right from the onset but really enjoyed the experience. Great night out for the whole family, young and old. Very friendly people well suited to help you travel through the whole experience searching for secrets and clues to help you effect your escape....\n\n\nMore  \n\n\n", "\nJust did the Dark Shadows es ape room with my family and it was a blast! Game Master Mei was the perfect host! And we solved the mystery first try! Team Sugar rules!\n", "\nI was fortunate enough to get a reservation for one of their pre-launch games, and let me just tell you: it was FANTASTIC! I have played my share of escape and maze rooms in the past, but this one takes the cake (don't eat it though it might contain a key or a clue). These guys have put together a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/09/49/1e/a8/escape-room-palm-springs.jpg"}]
[{"category": "spot", "review_count": "8", "title": "Palm Springs Biplanes, Palm Springs", "rating_string": "4.5", "address": "145 S. Gene Autry Trail, Palm Springs, CA 92262", "review_list": ["\nThe best thing about my flight was definitely the pilot Tom. He is knowledgable about his plane and it's history as well as the areas we overflew. I let him know that I was a student pilot about to take my tests and he shared quite a lot of good flying tips. If you want to know more about Palm...\n\n\nMore  \n\n\n", "\nI really do not like heights! But I challenged myself to take a flight in this wonderful antique plane! What an experience! Kent was excellent and very patient getting us in and out of the plane!\n", "\nStart off by saying this is an informal (in a GOOD way) operation. No big office staff or signing of waivers or half-hour safety orientation or anything like that. We just met Kent at the airplane and away we flew. My son and I did the one-hour flight and really loved it. Best part was flying along the mountains. Palm...\n\n\nMore  \n\n\n", "\nAlways wanted to ride in a biplane and found this opportunity. Interesting to see how pilot manipulates plane to see when taxi\"ing and about to land.\n", "\nI could feel the sand from the wind hitting my face. Very bumpy ride. Very unpleasant to fly in sandy condition.\nAerial tram was much better and only $15 dollars for the whole day.\n", "\nWhat an amazing ride! I thought I knew a lot about the Palm Springs area but you get such a greater perspective from high up! Seeing how many golf courses there truly are here in the valley and their beauty, how can you not want to play that game? Thirty Five minute ride which is perfect. The take off is...\n\n\nMore  \n\n\n", "\nThis is a great outing, in an open cockpit Stearman bi-plane, 1 (or 2) passengers up front, the pilot in the back.\nA unique way to see Palm Springs and surrounding area.\n", "\nIf you've ever seen \"Out of Africa\" or North by Northwest\" this is your opportunity to live the experience. A 1940's Stuerman bi-plane with a professional pilot and you or your loved one. The fee is for the time, not per-person. 30 minutes or 60 minutes you fly like before in an open cockpit plane in front of the pilot,...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/d8/11/c7/palm-springs-biplanes.jpg"}]
[{"category": "spot", "review_count": "10", "title": "Chill Bar Palm Springs, Palm Springs", "rating_string": "3.5", "address": "217 E Arenas Rd, Palm Springs, CA 92262", "review_list": ["\nIf your bar caters to gay men, hire staff that are comfortable and friendly towards gay men. When I go to bar I like bartenders that are friendly, talkative and comfortable in the atmosphere. Most of the male staff here obviously aren't. Makes me feel like I'm back in high school with the jock afraid he was gonna catch the...\n\n\nMore  \n\n\n", "\nStaff at Chill Bar are friendly and make sure your glass is never empty. Nice place to chill out and enjoy a drink.\n", "\nThis is my to go place, visit at least once a week. We always enjoy the lovely staff & more specifically Blake who always welcomes my and my girlfriend with a nice welcoming hug.\n", "\nA bar where you have to ask who I order from when there's 6 people behind the bar ????\nWe sat for 10 minutes while bartenders were putting glasses away Asked if u could order from them they said sure Really ? Obviously they are getting paid enough to not need tips for decent not even good service. Ridiculous.\nGood...\n\n\nMore  \n\n\n", "\nChill is a very nice facility. They did a great job on the remodel.\nHowever for a place that makes its living selling drinks, it's astonishing tough to get a drink. And it's not like they're understaffed. But all off the employees seem to be preoccupied with their friends or talking among themselves. We got so frustrated today that we...\n\n\nMore  \n\n\n", "\nGood all round bar for the boys! Modestly busy place with a very mixed clientele of all ages. Bar prices seem to be reasonable with beer specials. Bar tenders could be a bit friendlier! It was a bit of a local crowd.\n", "\nVery nice friendly gay bar. Bar tenders pay attention to every one not a bunch of bar tenders with their friends only. They really pay attention to everyone. Love the decor and videos and music\n", "\nWe are a straight couple that went bar hopping on Arenas street for 90% of our trip because everyone we met in the bars were so friendly and fun to hang out with. The bar was beautiful and clean, bartender was really attentive, and not more than 15 minutes passed before a group invited us over to drink with them....\n\n\nMore  \n\n\n", "\nChill Bar just opened recently after renovating a closed Nightclub space\nThe bar is large and well staffed. Drinks are reasonable. there is an outside patio area under umbrella's for people watching and socializing. There is a good group of people there and you will not feel out of place if you are a bit older.\n", "\nA new bar has opened at this site of one that had closed\nEverything is new. The Bar is VERY large with 4 sides. Bartenders are very welcoming and skilled. There are special Happy hours daily but give a call to make sure of the times. Inside and outside seating. Frequented by guys from 20-60 so I did see quite...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/08/d4/c6/6c/chill-bar-palm-springs.jpg"}]
[{"category": "spot", "review_count": "4", "title": "Copa Room, Palm Springs", "rating_string": "3.5", "address": "244 E. Amada Rd., Palm Springs, CA 92262", "review_list": ["\nThe space was poorly designed. The back lounge area is not high enough to see the stage. The material used on the sofas is very hot. There was an odor in the place like the after smell of clean up in a pet salon. It was so strong that it was hard to get past it.\nThe piano for our...\n\n\nMore  \n\n\n", "\nOne evening I was treated to a performer who barely had room to stand up on the silly little platform they call a stage. This place is a physical embarrassment; I've been to dive bars in New York with a better stage for entertainers. The room is pathetic; the acoustics are terrible; the lighting is laughable. The house wine is...\n\n\nMore  \n\n\n", "\nKyle Massey performed last week at the Copa Room. This great looking young man with a gorgeous voice has been a Broadway star and currently can be seen on \"Nashville\" in a recurring roll. His performance included wonderful life stories as well as a variety of music from different genres. The Copa has a list of upcoming performers, and it's...\n\n\nMore  \n\n\n", "\nExperience the Thursday night show, Lipstick with host Bella da Ball. Great performers and lots of fun, starting at 8:00PM. No cover charge. Pizza can be ordered and sent over from the restaurant next door. A fun evening with very talented performers, you won't be sorry you went.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/08/43/fa/4c/copa-room.jpg"}]
[{"category": "spot", "review_count": 0, "title": "Keys Dueling Piano Bar, Palm Springs", "rating_string": 0, "address": "2330 North Palm Canyon, Palm Springs, CA 92262", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "1", "title": "Palm Springs Ghost Tours, Palm Springs", "rating_string": "5.0", "address": "Palm Springs, CA", "review_list": ["\nWhile in Palm Springs on a business trip, my coworker and I were looking for something fun to do during the evening, when I came across this tour on the internet and booked it. I was a little worried it would be a \"serious\" ghost tour, let by \"paranormal researchers\" and I wouldn't be able to keep a straight face,...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/02/76/98/12/palm-springs-ghost-tour.jpg"}]
[{"category": "spot", "review_count": "2", "title": "Palm Springs Skate Park, Palm Springs", "rating_string": "4.0", "address": "405 S Pavillion Way, Palm Springs, CA 92262", "review_list": ["\nThis skateboard park is located in Sunrise Park, and provides local kids with a safe - and legal - place to practice their sport. It is seemingly quite popular as it has always been occupied when I pass it.\n", "\nTook grandson Jaxon for a skate. It was very hot outside so I stayed inside in the A/C watching soccer. He had a great time amid looks forward to skating there during the evening.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "1", "title": "Covered Wagon Tours, Palm Springs", "rating_string": "4.0", "address": "Palm Springs, CA", "review_list": ["\nA unique mule driven covered wagon ride into the desert with commentary about the local plants and animals and history of the area. Afterwards, BBQ beef, chicken, coleslaw, beans and garlic bread, ending with apple pie and toasting marshmallows on the fire. Guitar singer with country background. A fun evening for families.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "3", "title": "Saks Fifth Avenue, Palm Springs", "rating_string": "2.5", "address": "201 N. Palm Canyon Drive at Tahquitz Canyon, Palm Springs, CA", "review_list": ["\nThis was the last place still operating in this dead shopping center. It has now been torn down, and all the buildings around it, with a promise of something new and wonderful. Se'll see.\n", "\nThe Saks fifth Avenue store that was here was gone a long time ago...and now the mall that Saks was in has finally been torn down.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "4", "title": "Palm Springs Mall, Palm Springs", "rating_string": "1.5", "address": "2365 E Tahquitz Canyon Way, Palm Springs, CA 92262", "review_list": ["\nMalll? What mall? There was nothing there and we were a bit disappointed. We were looking forward to spending some time in an air conditioned place after walking in the desert sun for so long.\n", "\nLike others quiet mall with not a lot to offer make the drive and visit the outlets in the valley much better deals and sighta\n", "\nOut of curiosity from the previous review, I drove past. At last report, there was only a single GNC still operating. The mall still looks dead, except now one end of it has been leased by some kind of educational facility, with students.\n", "\nThis is like a \"ghost mall\"...all the stores except one (GNC) have closed down. There is even a spooky food court with all the tables gone and food places closed. This mall used to be filled with stores. About 5 years ago, all the stores began to leave. Seriously, the only thing here is a GNC store, a licensing office,...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/04/a5/37/fb/palm-springs-mall.jpg"}]
[{"category": "spot", "review_count": "1", "title": "Camelot Park Family Center, Palm Springs", "rating_string": "1.0", "address": "67-700 E. Palm Canyon Dr., Palm Springs, CA 92234", "review_list": ["\nCamelot Family Fun Park was sold quite some time ago. It is now known as Boomers and judging from TA reviews it's a waste of both time and money.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "Palm Springs art + design gallery, Palm Springs", "rating_string": 0, "address": "383 North Indian canyon drive, Palm Springs, CA 92262", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "Garstin Trail, Palm Springs", "rating_string": 0, "address": "Palm Springs, CA 92264", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "Artize Gallery, Palm Springs", "rating_string": 0, "address": "2600 South Cherokee Way, Backstreet Art District, Palm Springs, CA 92264", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "Studio D, Palm Springs", "rating_string": 0, "address": "4116 Matthew Drive, Palm Springs, CA 92264", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "Reflections of..., Palm Springs", "rating_string": 0, "address": "285 South Palm Canyon Drive, Palm Springs, CA 92262", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "Palapas of Araby Cove, Palm Springs", "rating_string": 0, "address": "3255 East Palm Canyon Drive, Palm Springs, CA 92264", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "Heusso Gallery, Palm Springs", "rating_string": 0, "address": "189 South Palm Canyon Drive, Palm Springs, CA 92262", "review_list": [], "img_url": "http://media-cdn.tripadvisor.com/media/photo-s/03/c9/00/57/iron-skillet-by-donald.jpg"}]
[{"category": "spot", "review_count": 0, "title": "Trashcan Rock, Palm Springs", "rating_string": 0, "address": "Palm Springs, CA", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "El Paseo Collection, Palm Springs", "rating_string": 0, "address": "73-061 El Paseo at Highway 111 South, Palm Springs, CA", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": "1", "title": "Covered Wagon Tours, Palm Springs", "rating_string": "4.0", "address": "Palm Springs, CA", "review_list": ["\nA unique mule driven covered wagon ride into the desert with commentary about the local plants and animals and history of the area. Afterwards, BBQ beef, chicken, coleslaw, beans and garlic bread, ending with apple pie and toasting marshmallows on the fire. Guitar singer with country background. A fun evening for families.\n"], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "Spirit of the King: Elvis Show, Palm Springs", "rating_string": 0, "address": "401 East Amado Road, Spa Resort Hotel and Casino, Palm Springs, CA", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "Desert Tiger Training, Palm Springs", "rating_string": 0, "address": "188-304 W San Rafael Dr, Suite 200, Palm Springs, CA 92262", "review_list": [], "img_url": "Unknown"}]
[{"category": "spot", "review_count": 0, "title": "Keys Dueling Piano Bar, Palm Springs", "rating_string": 0, "address": "2330 North Palm Canyon, Palm Springs, CA 92262", "review_list": [], "img_url": "Unknown"}]
