[{"category": "hotel", "review_count": "103", "title": "Extended Stay America - Palm Springs - Airport Hotel", "rating_string": "3.5", "address": "1400 East Tahquitz Canyon Way, Palm Springs, CA 92262", "review_list": ["\nFrom outside the complex looks amazing. Do not get your hopes up! As soon as you approach the entrance, the picture becomes gloomy. Smoking is allowed outside so you walk through a smoke screen, the first sight on entrance is 2 security guards, rooms are outdated and not clean, breakfast is a shelf opposite check-in desk serving grab and go...\n\n\nMore  \n\n\n", "\nThe bathroom smelled of mold and there were dead ants in the towels. It appears that they fumigated the bathroom right before we got there and it stunk. There were q couple of ants on the toilet.\nThe outside of the hotel is beautiful and the bed was comfy but there was definitely a mold issue and I specifically notified...\n\n\nMore  \n\n\n", "\nHigh priced for what! Not clean, very small rooms and very run down.\nWe were greeted by the woman at the front desk in a conversation of 10 minutes through a wall. She didn't bother to come out until I said I couldn't hear her.\n", "\nThis place was full of cockroaches, Dirty, noisy, outside areas were stinky and there were many homeless and disgusting people living in and around this hotel. Noisy pot smoking people and a horrible experience\n", "\nThe location is central and the room lay out is good with a kitchen at the entry. But otherwise this hotel is shabby. From the broken screen and non-working bathtub plug to the dirty carpet in the front lobby, I join the chorus of very disappointing.\n", "\nI have stayed at several ESAs over the years and this one is terrible. Looks nice from the outside, cheap and run-down from the inside. All the furniture in the room was old,damaged and dirty. Bedsheets were wrinkled and didn't feel fresh.\n", "\nHorrible place! From the outside it look okay, however when you walk in the cigarett smell was overwelming. We had booked a two bedroom and they ended up giving us two seperate bed rooms. My husband and I ended up staying on seperate rooms in order not to leave the kids alone. Lots of pot smoking people there as well....\n\n\nMore  \n\n\n", "\nVery disappointed with this hotel. It appears to be okay from the outside, inside it was dirty, the hallway and room smelled of marijuana upon our arrival, the bed was a double and not a queen as advertised and there was a bug in the kitchenette. Never again!!!\n", "\nI like this property for the location (near downtown), the rooms are clean and they have a kitchen area. A grab and go breakfast. The pool area is smaller and not a \"resort style\" pool rather a basic dip and go. Summer rates are good.\n", "\nWhen I booked the room I had wanted a king size bed, but all that was available was a queen. They put in the notes to switch us if available. We knew there was a small kitchen, so we packed some food, snacks, been and water. When we got there to check in I noticed that there was a piece...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/6e/42/89/swimming-pool.jpg"}]
[{"category": "hotel", "review_count": "2001", "title": "The Riviera Palm Springs, A Tribute Portfolio Resort", "rating_string": "3.5", "address": "1600 North Indian Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nI like HMK24 's review.\nStayed at this resort for a conference. Here is a list of concerns:\n1. Room was not ready at the appointed time. Some people arrived at 12pm and did not get a room until after 4pm. I arrived at 3 my room was ready around 6pm.\n2. the hotel does not have a shuttle to...\n\n\nMore  \n\n\n", "\nMy wife and I booked this hotel on Christmas Eve as a last minute Christmas Day treat for ourselves.\nThe hotel itself was excellent - large room, very comfortable kingsize bed, great 'wetroom' area, all very clean. In addition, the hotel grounds were extensive with a couple of large pools and pleasant landscaped grounds. A couple of fire pits added...\n\n\nMore  \n\n\n", "\nWe were on vacation and went to sightsee the stores on Palm Canyon. Afterwards, we went to the Riviera for lunch, but unfortunately they were only serving at the bar. While walking thru the lovely lobby, I noticed the gift shop. It had beautiful merchandise, from art on the wall and jewelry, to nuts and pop. I could not leave...\n\n\nMore  \n\n\n", "\nI used Priceline's name your own price for this reservation so I didn't pick this hotel. After reading the reviews on tripadvisor we were concerned about what we got ourselves into. We were pleasantly surprised.\nOur check in took 5 min. I really liked the lobby decor. All two bed rooms are in the back. We were in building 5....\n\n\nMore  \n\n\n", "\nThis location is in UTTER disrepair. Everything seems to be chipped, broken, or falls off when you touch it. And I have NEVER had such unprofessional and unorganized service at ANY hotel, much less a Starwood.\nI understand there's a major overhaul in the works, until then avoid this place like the plague.\n", "\nI just wanted to write to you about a vacation that my husband and I took to the Riviera last month, as we just checked our credit card statement, and the charges were wrong. There is ALOT to explain, so please bear with me.\nWe arrived on December 29th, after booking our room online. We requested 2 double beds and...\n\n\nMore  \n\n\n", "\nWhat a nice hotel......Love the rooms, all updated with clean contemporary styling....Service from the front desk to the bell staff, friendly and helpful. Great WiFi.\nThe property is a little spread out which can make for some nice evening walks.\nAll in all, a nice hotel, not within walking distance of downtown Palm Springs but close enough.....\n", "\nBeautiful interior hotel with great views. Modern cool furniture but overpriced. I wasn't in the room enough to validate the cost. The spa looks beautiful. Enjoyed the Agua Caliente hotel better. Newer and great bathroom! Spa was cheaper than the Riviera too. Save your money.\n", "\nThe first time I stayed here was last summer on a girls weekender with a few of my old college classmates. We had the absolute time of our lives, and our 1 bedroom pool view suite was beautifully appointed. Very modern, clean, and comfortable!!! The pool party downstairs was a bit crowded and the 5 of us had to rotate...\n\n\nMore  \n\n\n", "\nSo disappointed. We bought a Groupon and saw a ton of wonderful reviews on tripadvisor so thought why not? Our room was dirty, the tub backed up while trying to shower, the sink and tub weren't even clean from the previous guests, and there weren't enough towels. I asked 3 times for more towels and finally had to go down...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/07/17/92/b6/riviera-resort-spa-palm.jpg"}]
[{"category": "hotel", "review_count": "92", "title": "Palm Mountain Resort & Spa, Palm Springs", "rating_string": "4.0", "address": "155 South Belardo, Palm Springs, CA 92262", "review_list": ["\nThe hotel was centrally located, a block from main street activities. Hotel front desk not especially welcoming and hurried us along. Room could really use an update. Large but sparsely furnished. Room dimly lit. I wouldn't stay unless getting reduced price with groupon.\n", "\nWe love this place for its peaceful, easy ambiance and the lovely mountain view behind the hotel. It has a small, more personal feel, and is set back from the main street so you don't hear traffic noise.\n", "\nMy friends and I stay here every spring for a weekend just to get away for a few days. The rooms are ok, not great. They could definitely use a makeover. The staff was just ok. They have a nice pool that doesn't get super crowded like others in the area during this time of year. It is also located...\n\n\nMore  \n\n\n", "\nthe location is convenient. There are few amenities provided and breakfast vouchers are not included if booked through Priceline or Expedia. Thought I had booked a room with two queen beds but got two full beds instead. Good value but will not return.\n", "\nI cannot say enough great things about this hotel! I have been staying at Palm Mountain Resort and Spa every Christmas since 2011 and it has become my home away from home for the holiday. The staff is superb ... very accommodating and friendly. Rooms are spacious and very clean. Hotel is so well located - everything is within walking...\n\n\nMore  \n\n\n", "\nFive of us stayed at this hotel for several nights while visiting Palm Springs for the first time. It worked out really well.\nPros:\nLocation! The hotel is right across the road from the main drag, so it's within walking distance of restaurants, bars, and shops.\nParking - Free parking, and never a problem finding a spot\nClean - Although...\n\n\nMore  \n\n\n", "\nHotel was great, staff was rude rude rude!font desk staff looked like they wanted to do something else then help me never said hi, never greeted. Other then that, there was no staff around. They were happy to take my credit card.\n", "\nOverall was a pleasant quick one night stay. Awakened at 3am by what sounded like someone banging on metal garbage cans in my room, but turned out to only be the air conditioner. Clean and well maintained, wish I had time to enjoy the pool - but pool and fire-pits looked lovely. Very close to downtown, easy walk to VillageFest....\n\n\nMore  \n\n\n", "\nWe kinda like the place, location is certainly convenient, pretty pool and the hot tub is the \"prerequisite\" 102° at least, maybe 103°...legally most places cannot do the 104°+ that I like.\nThe room was clean except for behind the door, and only the carpet looks \"shabby\". A $150 fix would take care of the 3 different carpet problems in...\n\n\nMore  \n\n\n", "\nDated rooms, old a/c system very noisy. Ceiling fan in the corner not center of room? Small bathroom but the room itself was very large (to large for a King only bed. Needed more furniture to make it feel like a suite. Other than the flat screen I felt like I was back in the 1980's. Bed was comfy though....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/15/9e/40/palm-mountain-resort.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1099", "title": "Caliente Tropics Resort, Palm Springs", "rating_string": "4.0", "address": "411 E. Palm Canyon Dr., Palm Springs, CA 92264", "review_list": ["\nWe visited Caliente Tropics 2nd time.\nRooms i am not too fascinated about, but pool area with the mountain views! Some 5* hotels doesnt have that. Good heated pool and jacuzzi.\nIn regards of rooms, very basic. Can get a bit noisy when you trying to sleep and other guests dragging their luggage on metal strairs.\nDefo be back again.\n", "\nPalm Springs is a beautiful place If you are looking for something to do Go to Palm Springs!! My wife and I like to visit Palm Springs a least twice a year. We both loved hiking and there is a few hiking trails closed to Caliente Tropics. As far as the Hotel Caliente Tropics is one of our favorite places...\n\n\nMore  \n\n\n", "\nThe hotel staff was good and helpful but the noise level was bad all night, you could hear the guest in the rooms next to you. The rooms do need some up grading as well, for the price I paid for the room I would expect a better room.\n", "\nI am not a fan of pet friendly hotels. There were quite a few people with pets and wondered about the wet carpet in the room. Wish they offered rooms that did not allow pets. Room was spacious and bed was OK. No breakfast included, but restaurants near by. Just not a fan of this place.\n", "\nThis hotel I will 3 stars.....the views are breath taking and its right in the heart of palm springs....the pool atmosphere was delightful....and Jonathan at the front desk was very helpful and very insightful.....\n", "\nVery confortable, inexpensive, good opcion in Palm Springs, with gym, supermarkets nearby. Clean, TV wide screen, car parking, good interne, no noise. Perfect shower and bed. Everything ok! Very recommendable!\n", "\nI had made the reservation through Booking.com and the check in process was simple and quick. John the nite front desk staff was polite and shared some information about the area. The bedding was very comfortable and a spacious vanity area. Refrigerator in unit. Had one maintenance issue and Nick was super efficient to correct it. Alexandra at morning front...\n\n\nMore  \n\n\n", "\nWe stayed at this hotel for two nights and we had a bad experience!\nOn the day we checked out, I forgot my sweater and running shorts in the room. I left them hanging on the clothes rack outside the bathroom. I called the hotel about this and had a really terrible customer service experience.\nI first called them a...\n\n\nMore  \n\n\n", "\nI read about this place on TripAdvisor, and was intrigued about a dog-friendly retro-TIKI tropical paradise. Add to that a great rate through this very site, and I was sold.\nThis place is convenient located on the south side, with shuttle service to the main drag, and a short drive to a shopping center with grocery store, burger joint, and...\n\n\nMore  \n\n\n", "\nIf you don't mind mid century style motels it's not bad. The pool and hot tub were great (with the exception of only 2 jets working) and there is a decent grassy area with barbecue. The rooms have been somewhat updated. Granite counter tops around sink and shower were nice. The decorating is kind of cute and in keeping with...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "1179", "title": "Hyatt Palm Springs Hotel", "rating_string": "4.0", "address": "285 North Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nThe rooms have been redone, but it still has the feel of a 3.5*. The bed was comfy, and the rooms are large. The pool is small, but the fire pits are toasty. They are generous with credits when things go wrong. I The room was not bad, but I still prefer the resorts a further drive away.\n", "\nThe Hyatt Palm Springs was a great experience. My husband and I booked it because we had a free night as Gold Passport members, and we really loved it. Robert, the valet, made us feel welcome right away, and Deanna at the front desk couldn't have been more kind and welcoming. The location couldn't have been better, and we were...\n\n\nMore  \n\n\n", "\nWe spent 3 nights at the Hyatt Palm Springs, and we were completely amazed at the fantastic location! We were especially excited about the free shuttle from the airport to the hotel, but we were quickly disappointed when we called for the shuttle upon arrival only to be told that the shuttle was already \"out\" and it would be a...\n\n\nMore  \n\n\n", "\nPros\n1. Good location with walking access to restaurants and other downtown activities\n2. Nicely remodeled rooms\n3. Very friendly and helpful staff\n4. nice pool area and gym\nCons\n1. Valet parking is required which is both an added expense and a bit of a hassle\n2. Resort fees are high. They do include drink coupons but this adds...\n\n\nMore  \n\n\n", "\nWe had, overall a great time. The construction was a problem and the staff in the lobby bar lacked enthusiasm but the room was nice and bigger than expected. Yelp reviews had us leary but we were happy.\n", "\nnice place lots of pool side seating adult and family pools. went to the spa had a couples massage excellent my back hasnt felt this good in a long time only thing that gets me is charging to park at a hotel a common practice but the principle of this is lame. free wifi thoug\n", "\nIf you are looking for a great location near the main action of Downtown Palm Springs, I would recommend this hotel. Great rooms with balconies are so nice and private with awesome views of the mountains are very romantic. Each room has a separate living area and another bedroom, so it is good for a family or just a couples...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/8c/48/5d/hyatt-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "858", "title": "The Saguaro Palm Springs, a Joie de Vivre Hotel Resort", "rating_string": "4.0", "address": "1800 East Palm Canyon Drive, Palm Springs, CA 92264", "review_list": ["\nMy husband and I attended a college reunion at The Saguaro. During our four night stay we enjoyed the pool and ate at the restaurant at least once a day. This is not a four star hotel but we felt it was a good value. The staff was quite friendly and helpful and the restaurant food was good.\nSome minor...\n\n\nMore  \n\n\n", "\nI chose the Saguaro when it popped up as a family friendly spot in Palm Springs. Upon arrival I noted a suggested kid time at the pool. While not strictly enforced, it set the tone for our stay. When bringing the kids I would chose another spot. I also asked and paid for a \"pool view room\" and was placed...\n\n\nMore  \n\n\n", "\nMy partner and I enjoyed our stay at the Saguaro over Christmas. We stayed a week and although it was not very busy around Christmas, it picked up substantially near New Years. The pool and hot tubs were a nice touch and the staff was quite friendly. The food at El Jefe was delish, although we only ate there once....\n\n\nMore  \n\n\n", "\nBooked through Cosmos Western Tour, advertised as a 4 * boutique Hotel, Not anywhere near the standard expected. Arrival at reception late afternoon was a joke. Room not ready ?The hotel was overcrowded ,couldn't get near the pool . There was a disco going on at the poolside,until midnight. We had a ground floor room opposite the pool entrance where...\n\n\nMore  \n\n\n", "\nWe chose this hotel after having stayed at the Saguaro in Scottsdale shortly after it opened. The staff were great in Palm Springs, however the hallways and rooms are very run down. The sound travels between the rooms so much that you can clearly hear everything. Public spaces are nice, however, the bed/room/hallway situation is such that I wouldn't stay...\n\n\nMore  \n\n\n", "\nMy husband, two kids (5 & 7) and I stayed for one night on a Sunday. I chose this hotel for its amenities - the pool and the large space for the kids to play outside. Unfortunately, the pool and hot tubs were the only thing we enjoyed about the place.\nWe checked in at 4:00 and were disappointed to...\n\n\nMore  \n\n\n", "\nthis is a super fun, spiced up motor hotel... a holiday inn that has been painted bright. rooms are alright, wish the A/C worked better.. ask for a pool room on the first floor. there are no elevators and the summer parties are loud!\n", "\nUnfortunately, I had to stay here because it was chosen by a group that we were traveling with. I wish I had known before I agreed to pay that much for this run down 60's motel that has been turned into a circus themed mess. My room was small (think old motel), the paint was chipping on the bright orange...\n\n\nMore  \n\n\n", "\ni had an online reservation which stated the total cost of the room would be $250 with al, the resort fees and taxes. I was charged $320 on my credit card and have no idea why I paid an extra $70 for the night. The place is WAY over priced at $250 during the winter because there was no music,...\n\n\nMore  \n\n\n", "\nCool, hip, modern rooms. After reading some reviews here I was a bit worried, but I enjoyed my stay. The pool noise dies down early, and the rooms are comfortable and quiet. Despite the seemingly simple layout it is quite possible to get lost and not be able to find your room. The lobby área is nice, too.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/e6/3f/e0/the-saguaro-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "1380", "title": "Parker Palm Springs Resort", "rating_string": "4.0", "address": "4200 E Palm Canyon Dr, Palm Springs, CA 92264 (Formerly Le Meridien)", "review_list": ["\nWe met my sister, brother in law, & two nieces here in the lounge for some cocktails for the adults and hot cocoa for the kiddos. It was a chilly rainy day, so we just sat and caught up next to the Parkers Giant inside chimney. The most perfect afternoon. The inside of the Parker is gorgeous it really takes...\n\n\nMore  \n\n\n", "\nI stayed here for two nights while attending business meetings on-site. This was a lovely location with lush greens lining all paths. The facilities were all lovely - we had a catered dinner at the Petanque Courts and lunch in the Palm Court. Meetings were in PSYC. I had breakfast at Norma's. All meals were able to accommodate my vegan...\n\n\nMore  \n\n\n", "\nvery uncomfortable cheap mattress. They describe hotel as recently renovated. Maybe a fresh coat of paint and cool furniture. Loud gardeners outside my window raking at 430am. For spending just under 5k for just three nights I expect better. Will not be returning and would not recommend.\n", "\nGreat Vibe and Atmosphere from the get go. Complimentary Valet Parking. Stylish décor, that is a mix of 70s, MCM, and whatever.... but it works!! Had drinks in the lounge area. Cocktails were served quickly, but I ordered a French Martini and the execution of the drink was poor. I drank it, but it wasn't a proper French Martini. The...\n\n\nMore  \n\n\n", "\nThis was my second stay at the Parker and I would like to move in! Their accommodations are fun and unique with a 70's swanky vibe. The service is fantastic almost unheard of and everyone is friendly.\nWould stay there again and again. We were in town for a Cheer Competition and this would not be the normal stay for...\n\n\nMore  \n\n\n", "\nI stayed at The Parker for two nights in January 2016 and thought it was just perfect. We had an extremely spacious room with two queen beds in the wing overlooking the family pool. Wonderful beds, linen, bath products (Hermes soaps, Bvlgari body lotion etc), gorgeous retro furnishings. Every aspect of the hotel is spotlessly clean and immaculately maintained. We...\n\n\nMore  \n\n\n", "\nThis place was just fabulous. My son and I took a few days' vacation alone to celebrate his college graduation. The hotel is Jonathan Adler-style, mid-century modern, yet it still manages to remain tasteful and extremely relaxing. Beautiful grounds. Great comfy beds and top-of-the-line amenities. Bar can get a bit noisy but you can find a cozy corner for a...\n\n\nMore  \n\n\n", "\nWe had the best time at the Parker. Our first trip to Palm Springs. This was a mother/daughter two night spa trip for us. Jan 12-14 . The hotel is magnificent . We stayed in a room with two beds : 43 North . The decor is full of fun and whimsy designed to inspire and relax. The spa is...\n\n\nMore  \n\n\n", "\nProbably the worst hotel I have stayed at ever! The worst service, could not care less staff, the worst service. Do not stay here if you have money and want great service etc. Old hotel with thin walls and cheap clients. I complained having spent several thousand dollars & They don't just care. I am from London and say steer...\n\n\nMore  \n\n\n", "\nOne of the best experiences you can have, amazing hotel that has so many beatiful things to offer...'Nature', serenity, peace, luxury... not to mention amazing food, service and staff! Cannot wait to come visit again!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/03/8e/9a/db/parker-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "210", "title": "The Monroe Palm Springs Motel", "rating_string": "4.0", "address": "1900 N Palm Canyon Dr, Palm Springs, CA 92262 (Formerly Palm Springs Super 8 Lodge)", "review_list": ["\nMe and my husband decided to stay here for my bday weekend. It was cheap and the reviews weren't bad at all so we gave it a shot. But that turned out to be the decision that ruined my bday weekend.\nRooms felt like hospital rooms, no warm/yellow lights - all were white lights! No bedroom slippers, no toothpaste and...\n\n\nMore  \n\n\n", "\nLike putting,lipstick on a pig! No matter how much new paint it's still a run down old motel with tiny, dark, seedy rooms. Dirty floors, awful linens and NO water pressure. Hard to even brush your teeth let alone shower. Couldn't wait to leave.\n", "\nThe staff was very friendly and helpful, rooms were updated and clean. The only disappointing thing was there inventory for room coffee was very low. The stop for the free bus to downtown Palm Springs was right in front of the hotel.\n", "\nMy boyfriend and I wanted a one night getaway near Los Angeles so we looked on Groupon and found The Monroe. It was wonderful. We checked in early and we were given a room on the second floor with wonderful views of the mountains. The hotel was quiet. The hot tub and pool were lovely. A short .9 mile walk...\n\n\nMore  \n\n\n", "\nOur room had a fridge, microwave, safe, closet, and dresser to unload our clothes. It's everything you need for a few nights stay. We used the hot tub. It was warm and nice on a cool night. The free breakfast is across the street at Rick's diner. We found the amount of food to be quiet filling. We added a...\n\n\nMore  \n\n\n", "\nIt looked great online. However, once we arrived things were different: There is no place to unpack, except for a few hangers. This means your shirts, t-shirts, socks underwear, etc. have to stay in the suitcase. This may be OK for a one night stay, but not at all for several days. The decor was nice but the room was...\n\n\nMore  \n\n\n", "\nThe staff was friendly and professional. The location is great, right between downtown and the aerial tram. The rooms are clean and modern, The price is reasonable. The free breakfast across the street is really good- simple, eggs,toast, coffee and home fries (which were delicious, unlike many places- hotels and restaurants alike.)\nExcellent value.\n", "\nMy friend and I just got back from a great extended weekend at the Monroe~\nNow it was my birthday weekend and the wonderful staff at the Monroe went out of their way to make it special for me. First of all , they upgraded us to a suite with a wonderful view of the mountains. Our suite was great!...\n\n\nMore  \n\n\n", "\nI spoke with Denise this morning about making a weekend reservation for Coachella. Denise was very friendly, extremely knowledgeable, very helpful, and provided me great customer service! I had a lot of different questions about the property, the neighboring surroundings and activities, and Denise answered all of my questions thoroughly and happily. Great customer serviced cannot be overlooked. You can...\n\n\nMore  \n\n\n", "\nIt was a Super 8 at one point. Passed by here 100's of x's. decided, on a whim, to visit palm spurs. I live only 70 miles away (only?) well, Miss Denise was emphatic, about their No Smoking Policy. (I knew that!) She was giving me condesending looks and rolling here eyes, because I smelled like marijuana. And she was...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/04/7a/1a/0d/getlstd-property-photo.jpg"}]
[{"category": "hotel", "review_count": "531", "title": "La Maison Hotel, Palm Springs", "rating_string": "5.0", "address": "1600 E.Palm Canyon Dr., Palm Springs, CA 92264", "review_list": ["\nLa Maison is a perfect oasis in a very convenient location. I cannot say enough about the service and the amenities. Cornelia and Richard are tremendous hosts and their staff are top-notch! My room was beautiful, bed so comfortable with lovely linens and Frette towels and bathrobes with L'Occitane bath and shower amenities. The pool just outside my room was...\n\n\nMore  \n\n\n", "\nWe enjoyed a week at this charming and well-maintained hotel.\nOur only issue was that the room held enough dust to trigger both my husband's and my dust allergies; every morning we'd wake up congested and headachy.\n", "\nThis delightful hotel is truly the south of France in every sense. Quiet understated elegance with the best lattes (free 24-7) in the Cochella Valley. We stayed a week and loved our poolside room and Richard and Cornelia's hospitality. You'll want to return.\n", "\nWe had not planned to arrive in Palm Springs after dark, particularly since we hadn't been there before, but there we were without a reservation anywhere. We found La Maison on another site that we normally don't use for hotels, but it sounded adequate for one night. We started to wonder after we passed the second Motel 6, and in...\n\n\nMore  \n\n\n", "\nWe travelled as a couple in September 2015. Having never been to Palm Springs before, the trip advisor comments were welcoming and all were true. The hosts are lovely; spent part of the morning chatting with them about what to do, where to go and their experience in starting up the B&B. This boutique B&B is beautiful inside and out....\n\n\nMore  \n\n\n", "\nThis was our first visit to Palm Springs for my Sister-in-law's birthday. She choose this place for our visit. The staff was warm and welcoming, the rooms were impeccable. It truly felt that we were in someone's home. The pool \"kitchen\" was stocked with water, coffee, and beer, it also has a popcorn cart that goes all day. In the...\n\n\nMore  \n\n\n", "\nWe booked this place for my birthday weekend. We've stayed many different places in Palm Springs, but this one is by far my favorite now. Beautiful accommodations...quiet and relaxing. I loved the pool, outdoor fire place, lattes in the morning, wine in the evening and all the other small touches, such as chocolates in our room, blankets by the fire,...\n\n\nMore  \n\n\n", "\nBefore I booked my stay here, I was amazed by the fantastic reviews for this small hotel. Now I am able to fully concur with the overwhelmingly positive comments about\nLa Maison. This is a beautiful place and the owners are best of the best. I felt pampered, celebrated and so very content here. I cannot wait to return to...\n\n\nMore  \n\n\n", "\nOn the home from Arizona we drove the Palm Springs area hoping to find a place to stay on a Saturday night. We spent an hour or so looking but everything was either sold out or way too much $$$.\nWe were about to give up when we got a call from a small hotel that we had just checked...\n\n\nMore  \n\n\n", "\nAmazing place to stay- the courtyard and room are beautiful. The owners are on site and have definitely poured their hearts into what they have created. You can keep to yourself or sit outside and socialize with the other patrons- all while sipping lattes in the morning and wine at night. We will definitely return.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/8e/d9/fe/la-maison-hotel.jpg"}]
[{"category": "hotel", "review_count": "953", "title": "Avalon Hotel Palm Springs", "rating_string": "4.0", "address": "415 South Belardo Road, Palm Springs, CA 92262 (Formerly Viceroy Palm Springs)", "review_list": ["\nThe former Viceroy Hotel hasn't changed a bit, and that's not necessarily a bad thing. Whether you are dining poolside, relaxing at the spa or hanging out at one of the villas, its really an enjoyable place. Its a hotel but has a bit of a resort feel. They have a super helpful concierge, a nice restaurant with a creative...\n\n\nMore  \n\n\n", "\nRecently stayed at the Avalon in Palm Springs, CA (Feb 2016). The hotel and grounds are nice and staff and management were great. We loved that our room had a jam box in it, so we can listen to music as we hung out or got ready for our evening, however, there are key issues which should be addressed.\n1)...\n\n\nMore  \n\n\n", "\nIt started out good... But time takes it's toil on everything. The renamed hotel looks the same lemon yellow and stark white decor. The resturant was always good intimate and simple. I like the little bar. You can see everyone who's staying there pass by.\nLet's hope it keeps to it's orginial class.\nOff the main street is good and...\n\n\nMore  \n\n\n", "\nAlso know as the Viceroy, it has a stately feel. Nice upscale without the expense. Nice hideaway:-} Lovely place to have a poolside wedding. Slightly off the main road also lends it to be a quiet venue,\n", "\nWhat a stylish step back in time. A touch of glamor, a touch of romance, I could have been on the set of Madmen! Staff all loved their jobs, rooms were groovy, location couldn't have been better. I loved all the different pools - each one special in its own right, the two spa pools, green gardens.....just wonderful.\nI went...\n\n\nMore  \n\n\n", "\nWhile the Avalon (formerly Viceroy) is not an inexpensive hotel, the luxurious rooms, styling, amenities and grounds make it the best deal of all the top tier Palm Springs resorts in my opinion. (Of course, I wish all the hotels in the country would revisit their burdensome \"resort fees\" and simply reprice the rooms but that is not Avalon-specific.)\nWe...\n\n\nMore  \n\n\n", "\nWe have never been to PS before, and choosing a location/hotel was a challenge. However, I was fortunate enough to make arrangements with the hotel directly and speak with Don D., who is the most helpful human ever! Our stay was fantastic, our experience was the best possible, and we cannot wait to return. We loved our bungalow/villa, and we...\n\n\nMore  \n\n\n", "\nThis is a long review, but my intention is to be helpful. I booked a room at the Avalon Hotel five months before a trip to Palm Springs for my friends' wedding (this past weekend). After reading the (very mixed) reviews, I was hesitant, but since the wedding was at the Avalon and I found a discounted rate on TripAdvisor,...\n\n\nMore  \n\n\n", "\nWell, it looks just like the pics. Our two bedroom villa was perfect for the four of us and a 3-year-old. We were there for a wedding and everything went swimmingly, except that it rained. In a way it made the reception more fun and the sun shone bright and warm next morning. Kelly's make-over of the hotel still looks...\n\n\nMore  \n\n\n", "\nFirst appearances good - but sadly this didn't last\nI had booked a premier studio with two queen beds, a separate sitting room, and either a patio or balcony (depending on which floor the room was situated); what I was offered on arrival was a room at the rear of the hotel with a view of a side street -...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/06/50/09/de/grounds--v2440974.jpg"}]
[{"category": "hotel", "review_count": "141", "title": "The Willows Hotel, Palm Springs", "rating_string": "5.0", "address": "412 W. Tahquitz Canyon Way, Palm Springs, CA 92262", "review_list": ["\nWonderful place, lovingly maintained to allow a visitor to get the feel of a more charming and graceful era. Kind, helpful and very knowledgeable staff. Grounds beautifully maintained. Just minutes from town.\nWe look forward to our next visit!\n", "\nWe enjoyed two nights at the lovely Willows in Palm Springs. Location was excellent, walking distance to everything and right next to the museum. Breakfast each day in the beautiful dining area overlooking the waterfall was great. There is however one caveat.... If you stay in the room above the kitchen, beware the intense smells of morning cooking. Our room...\n\n\nMore  \n\n\n", "\nWe absolutely loved The Willows. The location is in the center of downtown Palm Springs, but off the main road so you still feel secluded. The Inn was very quiet and relaxing. The staff was phenomenal and so accommodating and welcoming. The breakfast was delicious and came with a gorgeous view of a waterfall. This was our first visit, but...\n\n\nMore  \n\n\n", "\nThis is by far the best accommodation in Palm Springs if you only want to be with your traveling mate. The perfectly restored mansion has only eight rooms and does not allow guests of guests to enter. Which at first is disappointing since it is the kind of place you want to show off to your friends, but once you...\n\n\nMore  \n\n\n", "\nMy husband and I enjoyed every minute of staying at The Willows. The breakfasts were lovely with silver settings and china plates. Delicious offerings including a freshly baked, warm muffin; a fruit course and a breakfast entrée. We stayed 4 nights and the menu changed daily without any duplicates. Their appetizer and wine service in the late afternoon was wonderful...\n\n\nMore  \n\n\n", "\nI return to Palm Springs each year for 2 reasons: The annual Tour de Palm Springs fundraiser bike ride and The Willows Historic Inn. As usual, as soon as I arrived at the Inn, I was welcomed as if returning to family. In fact, the same staff has been there for years and they always remember to inquire about my...\n\n\nMore  \n\n\n", "\nMy husband and I stayed at the Willows in Dec 2015. It was a great time of year to visit - we were able to sit out by the pool during the day and use our fireplace at night.\nPros:\n* Breakfast at the Willows was lovely - great food in a beautiful setting\n* We also enjoyed the wine...\n\n\nMore  \n\n\n", "\nLocated within walking distance of the main strip of Palm Springs. Spotlessly clean. This is the place where Clark Gable and Carol Lombard spent their honeymoon. Einstein stayed here many times. There are only eight rooms. We stayed in the loft. If you have problems with stairs you might not want this room. That being said all the rooms are...\n\n\nMore  \n\n\n", "\nIf you want to splurge...this is the place to do it. Nestled amidst mid-century modern hell, is this 1924 classic BnB/Neo-Mediterranean, restored brilliantly! We stayed for three great nights. Received a complimentary room upgrade! Wine and hors d'oeuvres...amazing breakfast. The staff is wonderful and attentive. We felt like we were in a guest house at Hearst Castle! It will be...\n\n\nMore  \n\n\n", "\nHigh quality EVERYTHING! From the building, to the grounds, to the linens, bedding, furnishings….really, not a single complaint. Plus, it was spotless! We will be back for sure. The staff was extremely nice and helpful. The Christmas decorations were beautiful, tasteful\n"], "img_url": "http://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "737", "title": "7 Springs Inn & Suites Resort, Palm Springs", "rating_string": "4.0", "address": "950 N. Indian Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nI checked into this hotel on a quick one night business trip. I have stayed here before. The room that I had was very large with a kitchenette. I was poolside, so that was nice. If I had a swim suit, it would have been better. There were a number of outside seating areas scattered around the resort. Some with...\n\n\nMore  \n\n\n", "\nI'm torn between giving this a rating of 4 or 5. Factoring in the price, it's a 5 since it's a great value. By itself, probably a 4. When I was choosing a hotel for Palm Springs (the city itself, not the greater area), this was the lowest priced of the \"better\" rated properties (4.0 or higher out of 5...\n\n\nMore  \n\n\n", "\nQuite a good value for the price, for a suite with kitchenette. Stayed here after getting stuck in Palm Springs for 3 extra nights due to a snowstorm. Easy walk to town and to Old Las Palmas. The staff was very nice, grounds were very clean. Suite was fine, though the carpet smelled slightly of mildew and seemed wet. The...\n\n\nMore  \n\n\n", "\nWe chose this place based on the great reviews and the suite option with a full kitchen, room enough for our family of 6.\nThe front desk staff is friendly, and they helped us carry our stuff up the spiral staircase to our suite.\nThe pool area is great, the spa is large and has a really modern glass wall...\n\n\nMore  \n\n\n", "\nAfter a late start from LA to Phoenix we decided to find a quick hotel that was nice but not too much $$. This place is great. Friendly checkin, nice design style and rooms open out to the courtyard which was very nice. The renovated touches gave the feeling of being in a higher price point place. Beds were the...\n\n\nMore  \n\n\n", "\nThis place wasn't cheap, but I figured since it was walking distance to nice parts of town, it would be a higher price... although it wasn't as close as others. The pics looked nice, but it was pretty shabby. In the first room, the sheets weren't dry yet (still wet from laundry). So we changed to another room. Unfortunately it...\n\n\nMore  \n\n\n", "\nRelaxing environment-hot tubs,pool and fire pits open until midnight. Our room was spacious with comfortable beds and a sofa and a balcony sitting area. The grounds were well maintained and pleasant. Walkable.\nI liked it a lot.\n", "\nStayed for 5 nights. Extremely clean, well managed property. The hotel consists of two areas, the older classic \"motel\" type units near the pool, and the newer two story suite units around a great new hot tub area. We are walkers and this location is great, a 5 block walk down Indian Canyon Drive and you are in the heart...\n\n\nMore  \n\n\n", "\nMy husband and I stayed for 5 nights, after Arlo graciously showed us the property. King suite. The room was very clean and quiet. We used the Spa many times each day, and we loved the fire pits on demand. The bed was a bit hard, but we got used to it after the first night. 😄\n", "\nThis property has been nicely restored with a mid-century modern feel that brings back the feeling of old Palm Springs when it was THE getaway spot for Hollywood stars. There are some nice outdoor lounge areas with large sofas and fire pits and nice gardens. Our room was a generous size with a small refrigerator, microwave and coffee pot. The...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/07/6e/5d/89/entrance.jpg"}]
[{"category": "hotel", "review_count": "184", "title": "Triada Palm Springs Hotel", "rating_string": "4.5", "address": "640 North Indian Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWe easily walked to multiple restaurants, bars, shops a casino and concert venue from the Triada. Although all parking is valet parking, the valets were super-efficient, especially Kevin. Other staff members were very friendly. We were, however, disappointed in our room, which we were in for 5 nights. There was no dresser in our suite, so we lived out of...\n\n\nMore  \n\n\n", "\nMe and my husband stayed here just for the weekend. This was his second time. The staff was friendly. Everyone from valet to check in provided excellent customer service. The bed was nice and comfortable for us. This place has some amazing views that you can enjoy.\n", "\nI stayed here over the last couple of nights and this is a very nice boutique hotel. I had a casita room with a kitchen and living room. The room and guest services were fantastic. My only complaint is the valet parking, I prefer to have access to my car at all times and not have to only use a...\n\n\nMore  \n\n\n", "\nThe Triada is OK.\nWe stayed here just one night on our way through to Las Vegas. It was OK but I don’t think it deserves 4 stars.\nThere was only one person at check in which meant there was a queue, the valet was a plain clothed guy that I actually wasn’t sure if I'd just given the keys...\n\n\nMore  \n\n\n", "\nI've never been more frustrated with a hotel than I was with Triada in Palm Springs. We booked the hotel back in December based on the location and the rave reviews for stays in the casita suites with the nice full kitchens. We booked using Marriott points for a Casita suite, and even though it cost us as many points...\n\n\nMore  \n\n\n", "\nThis hotel is now run by Marriott but once was a haunt for film stars and other famous people. It was situated within walking distance of the main shopping/ eating area of Palm Springs. The rooms are set out as mini apartments and the stairs would not suit some people. While we were there the town suffered an earthquake but...\n\n\nMore  \n\n\n", "\nBeds are comfortable. Since the hotel is a renovated older structure, they've remodeled rooms making the most of the space. Some large rooms have small bathrooms, some small rooms have large bathrooms. If you care about this, ask when you're checking in. Staff is great. Angel in the bar/restaurant. Wyatt is great. Kevin and Scott in valet took great care...\n\n\nMore  \n\n\n", "\nWe came to the Triada for a few nights for a short getaway. I reviewed many hotels in the area and chose the Triada over others based on reviews and photos. I was pleasantly surprised that everything there was what we expected. Beautiful hotel!\n", "\nHad a fantastic weekend, staff is very friendly and attentive, pool area nice a cozy.\nResturants in walking distance.\nThe only negative ting to say is that the A/C is a bit noisy.\nI would defiantly come back.\n", "\nFirst the good part - the casita I stayed in was lovely - modern- contemporary with a living room and couch - full kitchen huge shower and lovely king bed - robes that actually fit - good selection of TV channels - I could have stayed in the room for a much longer stay. This hotel has a lovely setting...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/41/66/42/triada-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "875", "title": "Hilton Palm Springs Resort", "rating_string": "4.0", "address": "400 East Tahquitz Canyon Way, Palm Springs, CA 92262-6605", "review_list": ["\nI would recommend this hotel to anyone. It is a large hotel with a small hotel feel. It has it's own restaurant, sundry store, spa, restaurant, ATM, pool bar & fitness room. Rooms are larger than usual and staff is super friendly. Is within walking distance to casino and downtown shops & restaurants.\n", "\nNicely appointed site with friendly, helpful staff - easy walking distance to PS Museum and downtown restaurants and attractions. Rooms are up-to-date and very clean. The central courtyard and pool area is very attractive.\n", "\nWe have stayed at this Hilton several times and have always had a great experience. During the warm weather the pool is very nice, lot's of lounges to set on and umbrellas. If you like to gamble the Spa casino is right across the street.\n", "\nI spent 4 days at the hotel recently and found the front desk staff to be unwelcoming to the utmost. My adult daughter who stayed with me, mentioned to me how cold the front desk staff had been with every interaction. I told her I had been thinking the same thing. They seemed arrogant and put out to have to...\n\n\nMore  \n\n\n", "\nWe just stayed at the Hilton Palm Springs last weekend for a cheerleading competition that was held at the convention center. The location was perfect! It is a 5 minute walk. The room was very nice but the main thing that I appreciated was the customer service. They went out of their way to get us a 1:00 check in...\n\n\nMore  \n\n\n", "\nI have a 13 year old and we don't want to go somewhere with massive screaming children! I can actually enjoy myself and relax. It's walking distance to everything and I enjoy the mid century feel we even bring our dog! It's our new favorite the glass fire pit is beautiful at night and they have a nice bar as...\n\n\nMore  \n\n\n", "\nMy wife and I recently spent 16 days in Southern California, three of them in Palm Springs (a charming and architecturally interesting city). Relying on TripAdvisor reviews, we selected the Hilton Palm Springs for our stay. It worked well for us in many ways. The central location was convenient; our room was clean and well-appointed; and we had no difficulty...\n\n\nMore  \n\n\n", "\nLots of excess fees. Not lots of excess frills. I would not recommend this particular Hilton in the future. despite a good location. 22 dollar resort fee (for what?) and 18 bucks to self park. Either mark up the rooms or don't but don't nickel and dime me each step of the way.\n", "\nThe rooms have nice patios and the square shape of the hotel is nice. The rooms are spacious and comfortable. I enjoyed my stay and will return even though parking was a bit confusing at first. I like the close parking to the rooms and the hotel restaurants are nice as well.\n", "\nThis hilton is in good shape - enjoyed all the facilities and the location is great - near downtown, and other in town amenities. It's near the airport as well, making it convenient. The conference went well because this hotel has very good facilities for this size conference (220 people)\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/04/0e/dd/fe/hilton-palm-springs-resort.jpg"}]
[{"category": "hotel", "review_count": "1004", "title": "Andreas Hotel & Spa, Palm Springs", "rating_string": "4.5", "address": "227 N. Indian Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWhat a joy to stay in a lovely restored hotel with NO resort fee. Please check the pictures online for a glimpse of hotels in the 50s. Warm and cozy with Cole Porter and Sinatra entertaining softly poolside, with the pool available 24/7. Adequate breakfast included and coffee, tea and candy snacks available the rest of the day and evening....\n\n\nMore  \n\n\n", "\nStated one night. The staff v nice and helpful. The hotel is tired. Rooms w smelly carpets. But nevertheless clean. Bit noisy- thin walls. Breakfast included in room price., dont expect much. Coffee, tea, eggs and lot od sugary stuff. Good location. But for this price - well its Palms Springs after all...\n", "\nFirst of all, we found a great deal. After one night, we upgraded to a larger suite, which was even more comfortable. Everyone on the staff was as helpful as possible. The spa treatments were just what we needed. Judy and Marcy were terrific there. All in all, it was a wonderful experience and a beautiful getaway.\n", "\nLovely stuff, very clean. Great pool and fireplaces. We were welcomed with glass of champagne and got a tour of our room. It felt like home. Two min walk to main attractions.\nHighly recommended.\nWill stay again.\n", "\nWe can not wait to come back to stay at this hotel again in Spring 2016. It is a small, cozy hotel and has everything you expect to have\nfor 5 stars hotel. Nice, clean bed and big bathroom just like our own home.\n", "\nI stayed here for 3 nights earlier in January. So much about the place impressed me. The parking area and entrance have a look of class and excellence (and no charge for parking!). Upon checking in, I was helped by Bobby. He was welcoming, professional, and very helpful. The room was much more spacious than I had expected. It has...\n\n\nMore  \n\n\n", "\nMy wife and were looking for a good massage in Palm Springs and had heard great things about the Spa Andreas in the Andreas Hotel from friends. We were not disappointed. Upon arrival, we were greeted warmly by Lynn, the spa director who did an excellent job explaining the various services the Spa offered. The atmosphere here is very warm...\n\n\nMore  \n\n\n", "\nThis is a very beautiful small hotel in the heart of downtown Palm Springs. It felt like the oasis it was meant to be. From a glass of complimentary champagne to the heated pool and hot tub to the beautiful rooms, we felt pampered. Pictures on the wall of the lounge show the stars who have stayed at the hotel...\n\n\nMore  \n\n\n", "\nThe Andreas Hotel and Spa are located right in the heart of downtown. Our room and bathroom were very large , clean and modern. The doors opened up to a darling little balcony (large enough for two adults to stand comfortably) overlooking N. Palm Canyon Dr. Unfortunately, the three story structure being erected across the street blocks most of the...\n\n\nMore  \n\n\n", "\nYou know a Hotel exceeded expectations when you can't wait to return! This Hotel had everything we were looking for and more. The Staff was extremely friendly and helpful (Thank you Tina for the friendly smile and disposition at breakfast...you helped get the day started on the right foot).\nChecking in and out was seamless! The location is incredible! You...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/03/5e/da/e9/andreas-hotel-spa.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1170", "title": "Renaissance Palm Springs Hotel", "rating_string": "4.0", "address": "888 East Tahquitz Canyon Way, Palm Springs, CA 92262", "review_list": ["\nI stayed at this hotel for a conference last week and was very impressed by the property. Lots of places to sit and relax in the sun, huge pool and spa. The food provided was excellent and plentiful. I would certainly stay here on a vacation visit with friends and family. Also, casino is just around the corner!\n", "\nBravo & thank you to the staff in the Valet, check-in, house cleaning, bar, & food. All were exemplary. Rooms were comfy and sparkly clean. Issues were dealt with immediately with a smile.\nThe lobby and inside/outside seating area were incredible. If you are planning a party or reunion of any sort, this area is second to NONE! Truly amazing...\n\n\nMore  \n\n\n", "\nOverall, this was a nice place to stay. A bit off the main drag - so expect a wee walk. The hotel layout is a bit awkward. Elevators are centrally located - but it was quite a hike to our room. Reminded us of the hotels in Las Vegas. The room itself was nice - the couches weren't overly comfy...\n\n\nMore  \n\n\n", "\nI don't have enough great things to say about the hotel, staff, food, environment etc. It really sets the tone for the customer service industry and how to treat people better then anywhere else. Keep up the great work management as your people are a direct reflection of how to do things right!\n", "\nWe booked this hotel via Priceline and we were really impressed that they gave us a room with nice view . Often we've noticed that hotels treat their customers as second rate when booked via these third party sites. This was not the case with this hotel and we loved our short stay there! The lobby and pool area are...\n\n\nMore  \n\n\n", "\nOur junior suite was on the 4th floor, had a balcony and faced the pool. It had great views of the mountains.\nThe layout was: you enter the sitting room, pass the bathroom to the bedroom,out to the balcony. A very stand affair. The furnishings were modern and in good condition. The room had a coffee maker and a refrigerator....\n\n\nMore  \n\n\n", "\nCame here for a quick getaway with the intention of romance with my beloved. Chose this property due to Marriott branding and proximity to downtown Palm Springs. Unfortunately we arrived during the tail end of some massive cheer competition at the adjacent Palm Springs convention center, and the hotel was overrun with adolescent girls half heartedly supervised by their Chardonnay...\n\n\nMore  \n\n\n", "\nI stayed for one night passing through town on my way out of LA so I can't speak to the property as a whole. First of all it is absurd they charge $12 for self parking which should be complimentary in my opinion. The lobby is gorgeous. The check in process was effortless and the front desk staff was friendly...\n\n\nMore  \n\n\n", "\nStayed here for business trip. Beautiful hotel inside and out. Pool area was gorgeous and clean. The room was spacious and clean. Could not get the room cool enough. Wasn't horribly warm but could have been cooler.\n", "\nWe were upgraded to Jr. Suite which was nothing special with a view of the roof. Maintenance staff could not get furnace to work so we were moved to another Jr suite with somewhat of a view. Our rate included breakfast buffet.. Typical eggs, bacon , potatoes, cereals. We did not use the breakfast one day so 750 points were...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/1a/b6/5e/renaissance-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "714", "title": "Hard Rock Hotel Palm Springs Resort", "rating_string": "3.5", "address": "150 South Indian Canyon Drive, Palm Springs, CA 92262 (Formerly Zoso Hotel)", "review_list": ["\nOn the surface, Hard Rock Palm Springs seems glamorous and fun and everything a young, youth oriented hotel would offer. Fun yes, but not luxurious or well kept at all.\nWas here for the International Bear Convergence event, 4 nights in total. I had some qualms about staying here for a gay bear event at such a small hotel. Rightly...\n\n\nMore  \n\n\n", "\nStayed for a long weekend... Staff friendly location downtown lots of good restaurants nearby... Very convient... I am not a fan of the small square pillows.. Pillow choices would be a great benefit to guests\n", "\nI stayed at the hotel for International Bear Convergence event, this was the host hotel. I liked the property, close to a lot of the area. Pool was a bit on the small side for our large group and drinks in the lobby bar are a bit costly.\n", "\nHad the opportunity to complete a four night stay in February 2016. Really thought this would be much more of a resort but turned out not to be so. Yes they have a pool which is quite small especially if there's a large number of people staying at the hotel which was the case when I was there.\nThe staff...\n\n\nMore  \n\n\n", "\nStayed one night-- happened to accidentally be on a Thursday so the street fair was going on-- quite a surprise. The hotel and all the staff were very nice and the room was very large and clean. The atmosphere at any Hard Rock facility is worth a little more-- and this hotel was no exception. Price wise they were cheaper...\n\n\nMore  \n\n\n", "\nOur bed was very uncomfortable.\nThe heater in the room was inoperable.\nThey lied to us about the breakfast package. They charged us $30 for breakfast but when we went to eat at the hotel restaurant, they said they will charge us again and we would get a credit of $30 . When I asked then what was the point...\n\n\nMore  \n\n\n", "\nThis hotel is very pricey for poor service and lack of amenities!!\nThey seemed to be understaffed and not all that helpful or friendly.\nI requested a wake up call and it never came.\nCould never get thru to room service to order food.\nThe bell desk took 45 minutes to come get our bags at check out which was...\n\n\nMore  \n\n\n", "\nStopped in for drinks and pool . Definitely a young person's hotel.we are in our 60s and not a place I would stay just too contemporary for me but if in younger go for it . Did not eat at restaurant but not impressed . Pool look neat , very young like 30 ish\n", "\nwe love to stay at the hard rock, love simmons restaurant,everything is with in walking distance,very freindly staff, pool rocks on the weekends in the summer ,great veiw of the mountians from the pool area\n", "\nStayed here for two nights. Very clean hotel. There was always some one sweeping or mopping the floors. Staff was friendly. They have a shuttle service from the airport. Rooms were spacious and clean. Pool area nice with an outside bar.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/04/a6/59/b1/hard-rock-hotel-palm.jpg"}]
[{"category": "hotel", "review_count": "1259", "title": "BEST WESTERN PLUS Las Brisas Hotel, Palm Springs", "rating_string": "4.0", "address": "222 South Indian Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWe have been at this BW several times and it does not disappoint. Our room was a very nice size for a 10 day stay. Staff were great. Very attentive and always very courteous. Breakfast was great making the room a good value.\n", "\nWe arrived early & after a few questions from desk staff they offered to upgrade us from regular pool view to whirlpool king suite. We were in our room by 1 & sitting by the pool with drinks in hand. Kale at gazebo bar was great as was Tanika(?) at breakfast omelet bar. While a little older property rooms were...\n\n\nMore  \n\n\n", "\nThe Las Brisis is centrally located in Palm Springs, which makes it very convenient for travelers. However, the hotel has seen better days. Much of the hotel is in need of a remodel. My room had a funny smell and the mattress was not comfortable. Service at the front desk was good. They do offer a free breakfast, but I...\n\n\nMore  \n\n\n", "\nnice place would stay again there was some maintenance issues but not to big quiet and clean don't know what more to say the pool was nice and the afternoon had a outside bar and food we didn't take part in that but the people were nice to us check in went well and check out to was fine security...\n\n\nMore  \n\n\n", "\nThis place is only a block from the main shopping district and within easy walking distance to eating establishments. It is not a new facility but is clean and quiet. The staff were helpful and friendly. The breakfast included an omelet bar plus all the \"normal\" offerings. The room did not include a microwave, however the room (king suite) was...\n\n\nMore  \n\n\n", "\nWe stayed at this property once before and had a very good experience. but we were on the 2nd floor and facing away from pool. This stay we had a lot of pool noise and on two of three nights, obnoxious and suspicious people banging on our door in the middle of the night. The hot tub is a nice...\n\n\nMore  \n\n\n", "\nThis is a great property with walking distance to downtown Palm Springs. beautiful views of the mountains with several great outdoor sitting area. Breakfast is great with \"made to order omelets\". Staff is very friendly and helpful with restaurant suggestions. Will definitely stay here again when in Palm Springs.\n", "\nLas Brisas is the best location when visiting Palm Springs, walking distance to great restaurants and shopping. The pool side bar/grill is excellent. We always stay at this hotel when we visit Palm Springs. Beautiful landscape!\n", "\nThis hotel was great for a nice getaway! It was clean, the beds were very comfortable, and the location was in walking distance of the strip. I would highly recommend this hotel. This can be a good stay for couples, families, business or solo. The breakfast had a broader selection than others I have stayed it. The omelets are made...\n\n\nMore  \n\n\n", "\nWe had stayed here before and was happy with the location and the pool area was relaxing and lush. During our most recent stay we were unable to sleep through the night due to noise that also continued through the day. AND the walls are paper thin. Could hear everything in adjoining rooms. So much for a relaxing time to...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/05/90/15/c1/restaurants-bars--v1258767-30.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "213", "title": "The Palm Springs Hotel", "rating_string": "5.0", "address": "2135 North Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nI found this gem and thanks to Trip Advisor's great reviews, how close it was to an event at the Convention Center plus no resort fees, so I booked it! The hotel was hard to find/know where to park the 1st time when we arrived at night. We weren't sure where the front door was or how to get in...\n\n\nMore  \n\n\n", "\nAfter another hotel cancelled our reservations two days before our trip to Palm Springs, I booked this hotel and I'm truly glad I did. My wife and I stayed for two nights. We met the owner and several staff, all of whom were pleasant and helpful. The hotel has a modern look with some retro touches. Our room was private,...\n\n\nMore  \n\n\n", "\nGot in late after a 4 hour drive from LA ...this place was perfect for one night. Outdoor space at pool and lobby is very cool and welcoming. Room is nice size and bed and pillows ( huge for me) were very comfy. I could see myself staying here more than one night if I needed to..can't beat for the...\n\n\nMore  \n\n\n", "\nThe Palm Springs Hotel was modern clean and inviting, the staff was more than accommodating, and very pleasant to work with while at the hotel. It was refreshing to stay in a Small Boutique hotel, forgot how nice it was, they really do care. I am Planning another trip in a few months and this is on top of my...\n\n\nMore  \n\n\n", "\nWe had a lovely stay at this Desert Modernism icon. Our room was clean and well supplied and the staff was warm and helpful. It was obvious how much care had been taken in the redesign, to capture that retro mid century feel, while making it thoroughly modern. I would love to visit again.\n", "\nFirst of all the mattress was FANTASTIC ‼️\nBest sleep I have had in a long time.\nBathroom and vanity area were excellent.\nStaff was courteous and friendly.\nPool area was gorgeous and well maintained. Rooms have a minimalist design, which I liked except for clothes storage. Love the large plastic cups right next to the ice machine. Would definitely...\n\n\nMore  \n\n\n", "\nOur first impression of the hotel was great - it's in good shape, intimate and well appointed. The desk staff were warm, informative and inviting. If we had an overnight stay, our review probably would have been five stars. However, we stayed for a five nights, which revealed some of the hotel's shortcomings.\nFirst, the maid service. Maid service was...\n\n\nMore  \n\n\n", "\nIt was with some trepidation that I planned our Palm Springs trip over Thanksgiving weekend. Most hotels were full, or the prices were raised astronomically due to the holiday. Then my spouse remembered that we had an LA Times article about new hotels in Palm Springs stashed away in our travel files. Through process of elimination, we zeroed in on...\n\n\nMore  \n\n\n", "\nStayed 2 nights over New Years Eve 2015 to 2016 - Overall Hotel layout consist of independent units around a very nice pool area / hot tub / (3) separate gas fireplaces - Also includes grill area, plus bar area. You can purchase beer and wine - prices are normal prices, not Hilton, Marriott, Westin 500% over reasonable prices...Leslie was...\n\n\nMore  \n\n\n", "\nMy boyfriend and I spent the night in this fabulous hotel for about $110.00 a night. WE originally went to visit family of his who lived nearby. IT was also a birthday surprise for me of the best kind. The staff was courteous and the bed was luxurious w great pillows. THE shower was big enough for three people. WE...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/d1/62/a7/the-palm-springs-hotel.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "454", "title": "Vagabond Inn Palm Springs Hotel", "rating_string": "4.0", "address": "1699 South Palm Canyon Drive, Palm Springs, CA 92264", "review_list": ["\nWe always stay a the Vagabond when we cam! This one ha a great pool area with a covered patio, snack bar and hot tub. The room was clean and comfortable and for $10 extra we brought our dog Spot with us. The free breakfast was great and you could fresh make tasty waffles. There is also a free shuttle...\n\n\nMore  \n\n\n", "\nEven the continental breakfast was a surprise! A warm atmosphere, wonderful pool/hot tub and pleasant clean room. Well worth the discounted price. Across the street from the Lyons Bar and Grill, a little pricey but lovely service and food. For Canadians in Feb. this is heaven\n", "\nAs a former Customer Service Supervisor I was first impressed with the friendly, helpful, and knowledgeable staff person, Pam, who answered the phone. I needed to know more about the area, my online booking, and room availability prior to my arrival. Upon meeting her, I realized her personality was genuinely awesome!\nThe room I booked served its purpose. It was...\n\n\nMore  \n\n\n", "\nThis hotel is nothing out of the ordinary. It's really just a place to rest your head at night. It is about 1 mile away from the main road and is a clean and inexpensive option for people. The breakfast bar is sub-par. One morning they did not have a protein option. The next they served hard-boiled eggs. Plan on...\n\n\nMore  \n\n\n", "\nWe stayed here for 2 nights while in Palm Springs. We were looking for a reasonable budget stay rather than a great resort stay. It met our expectations from previous reviews we had seen. An older facility, well kept and clean. The pool/hot tub area was nice. They had a few offering for their continental breakfast - juice, coffee, fruit,...\n\n\nMore  \n\n\n", "\nLooking for an inexpensive place to stay on a crowded weekend and found this hotel. The location is good, not too far from downtown. The room was clean and a decent size. There was a pool and hot tub and breakfast included. The staff was helpful and friendly. Here are the problems. The room had a strong smell, too much...\n\n\nMore  \n\n\n", "\nCheck in was quick, reception staff friendly.\nOn entering our room we could smell it had been recently cleaned as a very strong smell of beech. We turned down the sheets like we usually do to see the sheets were dirty and stained, we reported this to reception which was soon sorted.\nThe bed was big and comfortable, but unfortunately...\n\n\nMore  \n\n\n", "\nWe stayed here 4 times over the past 2 years. For the price, this is the best hotel in Palm Spring. The location is close enough to downtown. Front desk staff is nice and helpful. The room is decent size. Bed is fine. The bathroom is fine. The pool is heated. Continental breakfast is adequate: boil eggs, waffles, cereals, etc....\n\n\nMore  \n\n\n", "\nWe arrived late, and were welcomed by a courteous professional front desk person. We were given a decent rate for our room. The room had been cleaned but was very dated, dirty carpets and older linens. This property in on par with a motel 6 type property, however it costs $20 more?\n", "\nWe left Los Angeles on a Saturday night, and started toward Palm Springs to stay before finishing the drive back to the Phoenix-area on Sunday. The Vagabond Inn was the perfect place for us to stop. When we arrived, we were tired and really ready to get to our room. The staff at the front desk was very helpful. They...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/08/41/b5/fd/vagabond-inn-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "408", "title": "San Giuliano Hotel, Palm Springs", "rating_string": "5.0", "address": "375 W. Arenas, Palm Springs, CA 92262", "review_list": ["\nMy wife and I needed a short get a way, and after looking at the reviews on Trip Advisor, we decided to stay a couple of nights at the San Giuliano Hotel. It was the right decision. Here are the reasons to stay here.\nFirst - the room, the grounds, and it is the perfect place for a couple to...\n\n\nMore  \n\n\n", "\nSan Giuliano is a boutique hotel within a 5 minute walk to Palm Canyon Drive. We spent 2 nights in the Fountain Suite. This suite has a beautiful private courtyard with plenty of seating to choose from both in the shade or in the sunshine. There is also a private hot tub area. The interior is tastefully decorated with a...\n\n\nMore  \n\n\n", "\nThis is a small property with 8 rooms AND each room has a private enclosed patio with a personal hot tub. In addition, there is a common area with a pool and plenty of pool side chaise lounge chairs. The property is completely enclosed by walls and mature landscape with access via locked gates. The photos at sangiulianohotel.com accurately represent...\n\n\nMore  \n\n\n", "\nMy wife and I stayed here in the Ranch suite for a week in January 2016. The Ranch is Rm 7, located on the common pool at the end of the property. It's one of the more private, albeit smaller spaces, because its double doors open into the private courtyard rather than onto the pool. Tall privet hedges face the...\n\n\nMore  \n\n\n", "\nMy wife and I spent a few nights at the San Giuliano back in August 2015. I did a lot of research on small hotels in the Palm Springs area and decided on the San Giuliano. I couldn't have made a better decision. From the time we arrived until the time we left, the service and the resort was perfect....\n\n\nMore  \n\n\n", "\nThis is a beautifully designed little hotel consisting of eight small villas, each with a little hot tub outside, and a pool in the middle. The staff is excellent -- especially Joanie, who helped us find a challenging hike nearby, upgraded us to the big Fountain villa, scheduled massages, advised on restaurants, etc. The San Giuliano is walking distance to...\n\n\nMore  \n\n\n", "\nThis was our second visit to the San Giuliano Hotel. Again it was excellent. We stayed in the Velvet room...it was awesome. Service was above and beyond. Will definitely be going again sometime. Would give them 10 stars if I could.\n", "\nA truly fantastic hotel with only 8 completely private villas each with its own patio/garden and hot tub. It's a paradise that happens to be about a 5 minute walk to the heart of downtown Palm Springs. They are also super helpful. Luis provided me an excellent tip on where to go hiking with a dog. Jonie checked me in...\n\n\nMore  \n\n\n", "\n8 villas, all with private patios and hot tub. We stayed in the Fountain room and loved it! From the gated entry, beautiful front door hardware to every small and large detail we were amazed. The patio is gorgeous and we automatically felt relaxed as we walked in. The Fountain room is the only villa not connected to the main...\n\n\nMore  \n\n\n", "\nThis place is immaculate, pleasing to the eye, in a quiet part of Palm Springs, within easy walking distance of downtown. The view of Mount San Jacinto from the pool is breath-taking. This was our second visit and we will be back gain.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/22/90/55/san-giuliano-hotel.jpg"}]
[{"category": "hotel", "review_count": "620", "title": "Ace Hotel and Swim Club Resort, Palm Springs", "rating_string": "4.0", "address": "701 E. Palm Canyon Drive, Palm Springs, CA 92264", "review_list": ["\nHad a meal at the restaurant on the nite of January 19/16. Cost of the meal and tip were under $50 Canadian which was charged to my Master card. A couple of days later, while checking my credit card expenditures I noticed a charge of $105. Brought this to the attention of the manager and it took three days and...\n\n\nMore  \n\n\n", "\nI've been a fan of the Ace Hotel brand since I started going to the one in Seattle shortly after it opened. This Ace delivers on the brand promise. The rooms are quirky and clean, the staff are genuinely friendly without the typical script of the big chains and the pool is spotless. The food at the converted Denny's is...\n\n\nMore  \n\n\n", "\nThis is paradise in the desert. We love the vibe, rooms are so comfortable (they have thought of everything), the restaurant, food, music and nightly entertainment are all awesome! At the front desk Chad is the best- he help us with great suggestions of things to do in Palm Springs. But it's really hard to leave. This has been the...\n\n\nMore  \n\n\n", "\nAs someone who works in photography and styling I had wanted to stay and see the Ace Hotel in Palm Springs forever! I loved my experience at the Ace in Portland. The Ace hotel in Palm Springs did have it all. The cool diner, Photo Booth in the lobby, Rad bar, pool parties on the weekend, hip rooms. If I...\n\n\nMore  \n\n\n", "\nStayed at the Ace for a quick getaway with my best girlfriend. She lives in LA, me in Miami and I was visiting because she had just ended a pretty significant relationship. Our trip soon was deemed \"the glorious breakup vacation.\" The Ace was just what the doctor ordered. The pool is so peaceful and serene. They play Billie Holiday...\n\n\nMore  \n\n\n", "\nStayed here with a group of friends in January and had a blast. This hotel is definitely a destination for the painfully hip-and-pretty but if you can get past some of the questionable fashions and Instagram posing, you will have a great time. (Ok, ok, I contributed my own questionable fashion and Instagram posing while here too.)\nThe rooms are...\n\n\nMore  \n\n\n", "\nWe stayed at the Ace for a weekend getaway. Coming from the East Coast, you can't help but be stunned by the gorgeous vistas in and around Palm Springs, and Ace has done some creative things with this former mid-century Howard Johnson. It is an Instagrammers dream. But it felt a little empty, verging on moody and depressed. Maybe it...\n\n\nMore  \n\n\n", "\nACE is a special kind of place. Their website does a good job of describing the place and its amenities. My biggest beef was wishing they'd spent more time keeping their grounds clean and better kept than worrying about raking the sand in groovy zen-like patterns. The value for the money did not match.\n", "\nSecond time at the PS ACE and can't wait to come back! Our room ended up being right by the Commune - where they host weddings which was a bummer as we were there for a quiet get-away. Chad at the front desk went above and beyond and got us smoothly resettled in a quiet (and nicer!) room and even...\n\n\nMore  \n\n\n", "\nMy wife and I took a quick trip to Palm Springs during the last week of the year and booked a room at the Ace during a well-timed sale. We thoroughly enjoyed our trip. The king plus room had a couch, ample space, a view of the pool, a little private area on the outdoor hallway, and it was a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/08/39/e3/25/guest-room.jpg"}]
[{"category": "hotel", "review_count": "675", "title": "Colony Palms Hotel Resort, Palm Springs", "rating_string": "4.5", "address": "572 North Indian Cyn., Palm Springs, CA 92262 (Formerly the Palms at Palms Springs)", "review_list": ["\nReally quaint and charming, but could use some maintenance and upgrades. Don't valet as unsafe, unorganized. Rooms are comfortable but fixtures and locks need fixing. The restaurant is small but nice.\n", "\nLoved the food. The room was so comfortable. The pool was divine. I had a deep tissue massage with Liz Brown and it was phenomenal. The cocktails were really good. I ate every meal in the restaurant and loved everything I tried. I particularly liked the Brussels Sprouts Caesar salad.\n", "\nWe spent the weekend and it was fantastic Gilbert was very helpfull from check in to check out . The resturant was great food is unreal as well as the drinks. The hotel is also located very close to town. We will be back in a few months.\n", "\nWe just returned from a last minute \"babymoon\" trip, where we spent three nights at the Colony Palm.\nThe hotel is absolutely lovely, with a fantastic pool and hot tub, plenty of chairs and lounge areas around the pool area, in a great location just a few steps from the downtown restaurant area, and the big bonus is the super...\n\n\nMore  \n\n\n", "\nFriendly staff: Valet, front desk, pool, housekeeping. Cool, boutique hotel. Quiet. Our room was a little small but comfortable. Nice bar and food. Lots of privacy if desired.\nGreat location. We came to PS for a wedding nearby. I will stay there again!\n", "\nI have stayed here twice, and each time is better than the last. THe setting is very private and the rooms are moroccan style. They are so well designed, and very in line with the desert setting. If I am in palm springs I never stay anywhere else. They have an amazing spa, offer parking close to the rooms, and...\n\n\nMore  \n\n\n", "\nI'll start with the bad. Yes, I found it later in my confirmation but I was not told when I made the reservation on the phone there was a $35 a night resort fee. Let's be clear. They might as well have charged an airport landing fee as a resort fee. There is no airport. There is no resort. It's...\n\n\nMore  \n\n\n", "\nOur family spent 4 days here and headed out to explore the canyon hikes and Joshua Tree each day. Everyone loved it. The location and design are perfect. The breakfast is amazing and the food all pretty great.\nMy only complaint (which is no small thing) is that the coffee was terrible. I tried the drip and the espresso. Wish...\n\n\nMore  \n\n\n", "\nWhen you travel on a Holiday, the staff at hotels/restaurants can sometimes seem stressed out or not happy about being at work - totally understandable. This was NOT the case during my 5 day stay at The Colony Palms over Thanksgiving. From the moment I arrived, to the second I left, the staff was super engaged and genuinely nice. The...\n\n\nMore  \n\n\n", "\nI love this hotel and have stayed here several times. It is small intimate and you really don't need to leave. The on site restaurant has amazing food and the pool is relaxing. Every time I have been here a wedding party has been finishing up a weekend getaway and it is great people watching. This hotel attracts young, attractive...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/35/66/5c/exterior-view.jpg"}]
[{"category": "hotel", "review_count": "662", "title": "Palm Springs Rendezvous Hotel", "rating_string": "5.0", "address": "1420 N. Indian Canyon Dr., Palm Springs, CA 92262", "review_list": ["\nDon’t let the campy themed rooms fool you. This hotel is a just a really lovely place to relax and visit Palm Springs and the surroundings. Cocktail hour around the pool is a great way to get to know other guests. Breakfasts are delicious. Coffee and tea available at any time to help yourself, and fresh baked goods put in...\n\n\nMore  \n\n\n", "\nThis is the hardest review I've ever had to write. We booked because of the Trip Advisor rating. This would not be a place the wife and I would normally stay. We're into new properties. Having said that, the service was incredible from the phone call before check in to the checkout experience. Room was clean, bed good and a...\n\n\nMore  \n\n\n", "\nThe people at the Palm Springs Rendezvous really go above and beyond to make sure your stay is enjoyable. They prepare great breakfasts (not just your standard muffins and coffee), they have a great cocktail hour with appetizers, and they really take care of your every need. We loved our stay. We borrowed the bikes for the day and rode...\n\n\nMore  \n\n\n", "\nWe had a wonderful time (5 days) at this relaxing motel/B&B/hotel. It is very unique and quirky - you live in a 50's environment in your room and in the lounge. The staff is excellent and most hospitable, providing lots of help on where to visit and where to eat. The rate includes lots of extras, such as a healthy...\n\n\nMore  \n\n\n", "\nThis is very midcentury with a relaxing vibe. The staff are super friendly, and it is a great place to get married and have a honeymoon. I would recommend this place to anyone who wants this type of vacation.\n", "\nEverything here is simply amazing !!! The decor is all retro 1950s and the rooms are s simply gorgeous. We stayed for two nights and loved the place. Our every whim, from cocktails in the pool, to restaurant bookings was looked after. The staff were just fantastic - nothing was too much to ask. We stayed in the poolside Silver...\n\n\nMore  \n\n\n", "\nMy boyfriend and I stayed here for 2 nights in January, and we can't stop talking about this place! If you want the true flavor of old Palm Springs, then this is the place to stay! From the moment we stepped into the courtyard, we were in love. From the hot tub, to the heated pool, to the old-school vibe...\n\n\nMore  \n\n\n", "\nThis was our first stay at the Rendezvous and hope it won't be the last. As you would expect from a spot so highly rated, the room (Route 66) was extremely comfortable and fun to hang out in. What I didn't expect were the extras: the free drinks and appetizers in the lounge, the generally sociable atmosphere, the relaxed helpfulness...\n\n\nMore  \n\n\n", "\nWe promised some years ago (or threatened) \"to be back\"! We returned for New Years celebrations and the Rendezvous is still the wonderful place we remembered! Rooms/Suites all different, the Pool heated, the Happy hour happy! Breakfast thanks to Tery is really awesome and thanks to Robert we had really nice dinners reserved for us! We hope to be back...\n\n\nMore  \n\n\n", "\nWhat a great spot! Very relaxing with my team from the friendly welcome to the extra special touch helping us celebrate our anniversary!\nOur stay was in the TV room, such a cozy room with everything you need, and I loved the pool was right out our room door! The breakfast was very good .The happy hour was another personal...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/06/34/30/d0/hawaiin-surf--v2498331.jpg"}]
[{"category": "hotel", "review_count": "704", "title": "Del Marcos Hotel, Palm Springs", "rating_string": "5.0", "address": "225 West Baristo Road, Palm Springs, CA 92262", "review_list": ["\ni have been hosting a group of 12 golfers every January in Palm Springs. I found the Del Marcos online in year 1 and we have been going back ever since ( 8 years),\nthe most relaxed and relaxing environment you'll ever see. great personal service includes nightly free happy hour. Walk, don't drive, to you and again.r choice of...\n\n\nMore  \n\n\n", "\nMy partner and I had initially booked our stay at the Del Marcos thru Expedia, but due to some technical glitches, the wrong dates were booked. Rather than calling Expedia, I thought to call the hotel directly, and a very friendly, polite-sounding lady answered the phone, introduced herself as Lee and proceeded to assist us with our dilemma. Without any...\n\n\nMore  \n\n\n", "\nWe booked this on booking.com last minute due to the great reviews, but knowing nothing about the area. The hotel was immaculate and very well situated. There is a free bus, the Buzz, that stops in front and does a big loop around much of Palm Springs. One block to the Thursday night street festival, many shops and restaurants. However,...\n\n\nMore  \n\n\n", "\nI loved this place. The mid-century modern architecture informs the vibe of the place from the colors to the furniture. The staff is warm, informative and consistently helpful. Eric, in particular, was a great resource and Palm Springs guide. They do a breakfast that wasn't fussy but all you need. There is happy hour but I never managed to get...\n\n\nMore  \n\n\n", "\nFirst .. the great. We were greeted upon check in by Lee and she was great! In the morning we also had fantastic help from the front desk helping us plan our vacation. Second .. the good. Location wise this hotel is pretty good. At the far end of downtown we could walk to most of Palm Springs. I feel...\n\n\nMore  \n\n\n", "\nWe have yet to stay at the remodelled hotel but did book 6 years ago. We heard that there might be a problem with management but never imagined what we were to encounter, Arriving after a 20 hour journey with 5 tired sons there was nobody to greet us but a sign saying back in an hour at reception. Waiting...\n\n\nMore  \n\n\n", "\nThe property is clean, comfortable and located in a great spot. They have a wonderful breakfast, happy hour, bicycles to ride and fire pits. The staff is very friendly and accommodating, especially Li.\n", "\nPalm Springs has many charming, unique lodgings (and we've tried quite a few) but the Del Marcos now ranks TOPS in our book. The motel, built in 1947, is architecturally distinguished and perfect care has been used to take it back to its glory -- while catering to modern needs. It's run magnificently by Eric, who is most welcoming and...\n\n\nMore  \n\n\n", "\nStayed at the Del Marcos Hotel over the Christmas Holiday - what a treat! Beautifully kept property - spotless, stylish, friendly and helpful staff, convenient location - couldn't ask for more. We will definitely be making this our go-to place for Palm Springs visits.\n", "\nPalm Springs exceeded our expectations and Del Marco Hotel even more so. It beats any accommodation we experienced along the way, irrespective of Star Ratings.\nFor a start we love mid 20th Century architecture and design and Del Marcos has it all. Every detail of the refurbished hotel is superb down to the quality of bed linen and toiletries, but...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/d1/79/bf/saltwater-pool.jpg"}]
[{"category": "hotel", "review_count": "165", "title": "Sparrows Lodge Hotel, Palm Springs", "rating_string": "5.0", "address": "1330 East Palm Canyon Drive, Palm Springs, CA 92264 (Formerly Sparrows Hotel)", "review_list": ["\nTrue to its claim, Sparrows Lodge is a quiet, adults-only hideaway a few miles from downtown Palm Springs. The rooms are spacious and beautifully appointed, with an incredible shower area and delicious linens. The common areas are lovely and homey, and the friendly staff is well trained and always eager to be of service. The pool is the centerpiece, with...\n\n\nMore  \n\n\n", "\nThis is a very unique property. I have traveled a lot, and Sparrows Lodge is quite memorable. Greeted by Jon, who turned out to be the most amazing host turned friend, the tone was set for a wonderful week at the Lodge. Great complimentary breakfast with homemade yogurt, granola, thick slabs of bread with their homemade jam and French press...\n\n\nMore  \n\n\n", "\nI stayed for five nights and was so surprised to see that this place was all that and more.\nThe staff go out of their way to make you feel at home especially John Hood. He goes around and smudges the area with delicious sage which gives the area a very earthy cool aroma.\nBreakfast is very simple but very...\n\n\nMore  \n\n\n", "\nI didn't actually stay here (it was completely booked) so I cannot speak to the rooms. However, I had to visit it. It was delightful. The garden area is lovely. I sat there for ~30 minutes enjoying a margarita and watched birds come and go between the bird feeders and the bird baths while enjoying the sweet smells of the...\n\n\nMore  \n\n\n", "\nWe stayed at Sparrow Lodge for our 26th Wedding Anniversary in January and it was one of my favorite small Boutique Lodges that I've stay in...I love smaller quaint hotels and this one fits the bill its relaxing,it has lots of little Nooks crannies to cuddle up in for reading,close to downtown, and friendly staff. If in Palm Springs this...\n\n\nMore  \n\n\n", "\nEverything excellent from start to finish for a short one night stay. Try to stay longer!\nNo reception counter, only a welcoming area with bar, food, tables and couches. No paper work, just your key and invitation to the amenities.\nStroll past the pool to your room and if lucky a larger room with gas log fireplace.\nEach room has...\n\n\nMore  \n\n\n", "\nSparrows Lodge is doing so many things right. The property is a calm oasis, more suited to the person who is past the \"DJ by the pool\" party scene that many Palm Springs hotels are known for. Instead you will hear birds, running water and Fleetwood Mac. The pool and hot tub are sparkling clean saline. With no kids allowed...\n\n\nMore  \n\n\n", "\nWe went to the Sparrows Lodge with two other couples and had the most amazing 3 night stay. The property like many in Palm Springs doesn't look like much from the road but when you walk in so lovely and different. No typical hotel check in desk, rather you make yourself to the bar where they pour you a glass...\n\n\nMore  \n\n\n", "\nWe found Sparrows last year and stayed for five nights. We loved it so much we could not wait to come back to Palm Springs and we didn't even consider staying anywhere but Sparrows. Often times you can't reproduce your first experience the second time around but in Sparrows case it was even better the second time. The laid back...\n\n\nMore  \n\n\n", "\nClose to downtown. Free Wifi. Free parking. Breakfast included. Great food. Amazing staff. Heated Pool. No kids. Attention to detail everywhere. I fell in love the minute I walked through the door. If traffic bothers you ask for a room away from the street. Hint: all the food is delicious but the home made soups are amazing. I'm coming back...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/05/72/17/c3/sparrows-hotel.jpg"}]
[{"category": "hotel", "review_count": "174", "title": "Colt's Lodge Hotel, Palm Springs", "rating_string": "5.0", "address": "1586 E Palm Canyon Dr, Palm Springs, CA 92264 (Formerly Alpine Gardens Hotel)", "review_list": ["\nWe stayed at the Colt's lodge for 6 days and had to leave, it is a hidden gem of a hotel in the Palm Springs area, there are only 11 rooms and a adult only place very nice for a relaxing stay. The heated pool was a added bonus the staff were excellent Job, Jonathan etc they went out of...\n\n\nMore  \n\n\n", "\nMy husband and I stayed recently for 4 nights and we really enjoyed our time. The bed wasn't the most comfortable but the room was extremely pleasant. We were lucky to have a patio on the back of our room which was really nice. The hot tub wasn't working at full capacity, only a few jets were running. Breakfast was...\n\n\nMore  \n\n\n", "\nThe Colts Lodge actually floored us! Incomparable in every way from the very cordial greeting by Job ( manager) when we arrived to the exquisite landscaping, the beautifully appointed rooms offering the finest amenities.\nWe have come to Palm Springs many times and our stays have always been lovely, but this is a different breed of cat altogether. We felt...\n\n\nMore  \n\n\n", "\nMy wife and I had an overnight stay 01/25/2016 in Palm Springs at the conclusion of a business/vacation trip in the area. I found Colt's lodge online, and description and the online reviews very deadly accurate. What a beautiful spot! The rooms were spacious, clean and very well decorated. the pool area was spectacular, a real throw-back to the old...\n\n\nMore  \n\n\n", "\nColts Lodge is wonderful. We (my wife and daughter and I) stumbled across this place on the net and it had great reviews so we booked in and I am so glad that we did.\nThe rooms are lovely, beds are super comfortable, breakfast were good and that management and staff super friendly and very helpful.\nI would definitely stay...\n\n\nMore  \n\n\n", "\nWe stayed overnight at this gorgeous place and wished it could have been longer. The rooms are just delightful and very comfortable and decorated beautifully and very clean. Breakfast was also very welcome and a wonderful inclusion. We would recommend this great place to anyone, its location is also very handy to the centre.\n", "\nMy husband and I celebrated our 10th anniversary at Colt's Lodge. One cannot go wrong with choosing this intimate, adults only hotel. It's absolutely gorgeous, all the rooms have their own classy themes and the hosts and manager are wonderful. Jon and Frank are generous owners/hosts to their guests. They gave us complimentary red wine upon arrival and even threw...\n\n\nMore  \n\n\n", "\nTHIS BEAUTIFULLY REMODELED HOTEL IS AWESOME AND TRIP ADVISOR WILL NOT REMOVE THE FORMER OWNER'S PICS. DONT LET THE UGLY, OLD PHOTOS FOOL YOU! My husband and I spent a night and two days at the Colts Lodge in Palm Springs. The service was really outstanding. I can't express how hospitable the owners and support staff treated us. We recently...\n\n\nMore  \n\n\n", "\nThis was our second visit to this fabulous place as before due to our schedule we could only stay one night. Our week has been exceptional and we do not want to leave. No complaints, just praise and more praise. You get what you pay for and much more!\n", "\nWe stayed at Colts Lodge in 2015 and what a wonderful stay we had. We loved our time there. We were from Australia and first time visitors to Palm Springs. We picked the best accommodation that we could have. Colts Lodge has recently been fully renovated and Jon and Frank have done a superb job. The room was of moderate...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/f7/3a/0c/the-succulent-garden.jpg"}]
[{"category": "hotel", "review_count": "258", "title": "Alcazar Palm Springs Hotel", "rating_string": "4.5", "address": "622 North Palm Canyon Dr., Entrance on Granvia Valmonte, Palm Springs, CA 92262", "review_list": ["\nWe love staying here. WE love the pool.. It is a small place with a small pool. We ususally have the pool to ourselves. It is a nice warm pool.. Hot tub is good too. The rooms are big. Wifi is good. TV, Frig.. Microwave in the Office. In the morning they serve juice and coffee and coffee cake. The...\n\n\nMore  \n\n\n", "\nLong over due review, found Alcazar online and I immediately fell in love. You can tell the owners take great pride and it shows. The landscaping is beautiful, you could smell the jasmine flowers through out.\nThe rooms are perfectly white, the floors, the linens, the walls. It feels very cool and relaxing that you almost don't want to leave...\n\n\nMore  \n\n\n", "\nGreat small Hotel ! Location, service, well maintained and very clean👍🏻...Nice heated Pool and Jacuzzi🏊🏻, surrounded by excellent Restaurants🍷👏🏻\nFree bikes availables for guests\nCoffe and Tea available 24 hours and delicious Croissants and Pastry with Juice for breakfast☕️\n", "\nThe hotel was absolutely stunning. Small, cozy and very private. Only 34 rooms in the complex. The rooms are all white interior, very beautiful clean. I would definitely recomment this hotel and I'm looking forward to visiting it again in the near future.\n", "\nA very well presented hotel, we had little idea what to really expect from Palms Springs and being here is late September was an experience. However, the hotel and room was excellent and well positioned for downtown Palm Springs. Birba & Cheeky’s restaurants are very close to the hotel and very popular, we had a room close to the restaurant...\n\n\nMore  \n\n\n", "\nThis is a very pleasant boutique hotel. Location is very convenient, many shops and restaurants can be reached by walking, near city center.\nRooms are well distributed in the one-story buildings. In the center there is a nice pool area.\nEverything is well-kept and very clean.\nEveryone is friendly. In the reception area there is a Nespresso-machine for capsules of...\n\n\nMore  \n\n\n", "\nWe really loved this hotel (and Palm Springs) beautiful rooms with quirky little touches all around. An amazing pool and hot tub area with a lovely seating area including water features, which looks amazing at night when it's all lit up. We would definitely recommend this hotel to anyone staying here.\n", "\nLocated in the heart of Palm Springs this is our home away from home. The staff is so friendly and accommodating and over our many stays, now feel like extended family. The property is perfectly maintained and is so pleasantly peaceful. We always reserve a room with a patio so we can enjoy our morning coffee and the dogs love...\n\n\nMore  \n\n\n", "\nThis is a small quirky establishment, quiet and peaceful. Modern decor. Good rooms and very comfortable and clean. It is more like a motel than a hotel but that is fine, unless you are expecting a fully fledged Reception and trimmings. Unfortunately the person in Reception seemed somewhat bored, not very interested in us and did not seem to have...\n\n\nMore  \n\n\n", "\nThe actual hotel facilities are nice and quaint. We stayed on the week of Sept. 27th. The pool is nice and a few feet away from the rooms. The design in modern and sleek. However, the front staff needs hospitality training. No welcome or introduction it seems as if they were students studying for an exam and we were interrupting...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/02/f6/0b/90/alcazar-palm-springs.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "313", "title": "Courtyard Palm Springs Hotel", "rating_string": "4.0", "address": "1300 Tahquitz Canyon Way, Palm Springs, CA 92262", "review_list": ["\nThis is not a luxurious hotel but they definitely can provide you a comfortable bed and a spacious room. Though it is small and old but the room is very clean. It is around 5 minutes driving distance to downtown Palm Springs so it is very easy to find food even if the hotel does not have a proper restaurant....\n\n\nMore  \n\n\n", "\nBooked this hotel when scheduled to Palm Springs on business on quick notice. While the room was comfortable and adequate, the restaurant was poor. The \"Bistro\" served food that had not been microwaved long enough. Menu was very limited and food of poor quality and over priced. The hotel is located far from restaurants and shopping compared to other hotels...\n\n\nMore  \n\n\n", "\nother than handicapped rooms being far far away from elevator, this was a good place, clean and with windows that opened and a nice view. Staff helpful too. Would stay again and senior price was great.\n", "\nA courtyard hotel is always a good option. Stayed here one night, whilst passing through. We basically only slept here but it was a great option. We just showed up at reception and they offered us a great rate. The staff at the front desk were very friendly and really interested in hearing about the country we came from. The...\n\n\nMore  \n\n\n", "\nWhat a lovely experience we had ! The hotel is everything you expect from Marriott, clean, great parking, nice beds, great toiletries (although I overheard a lady complain that the body lotion was TOO thick......we loved it.....it has a pleasant smell and it was luscious) all the amenities are just right. What made our stay so special was the staff...\n\n\nMore  \n\n\n", "\nWe stayed here with kids between Christmas and New Years. Looked recently remodeled. All bedding and furniture were modern and attractive. Bath and shower come with basic room. Lobby has several internet stations and no wait during our stay. Pool area was small and jacuzzi could've been higher temperature.\n", "\nMy sister and I stopped here while traveling back to Texas. The staff was friendly and extremely helpful. The rooms were comfortable and spacious. I only wish they served breakfast a little earlier so that we could have gotten on the road sooner.\n", "\nWe stayed here twice last fall, once on our way east and once on the way back. Though not super charming, the hotel was attractive, very clean and offered most amenities. On our first stay, the room was nice, but had a very noisy refrigerator (turned off after figuring it was a noise source). Then, I became aware there was...\n\n\nMore  \n\n\n", "\nClose to the airport and downtown. The rooms are nice and comfortable, the stay friendly and knowledgeable. They have a shuttle to the airport and it also runs from the hotel to downtown in the evenings. My 3rd stay here and I always enjoy it.\n", "\nComfortable, well appointed and spacious room. The only shortcoming was that it could have used better sound isolation, though that wasn't too big a problem. There is no longer a complimentary breakfast, but the Starbucks in the lobby is handy.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/9d/64/5b/courtyard-palm-springs.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "132", "title": "Desert Isle of Palm Springs Resort", "rating_string": "4.0", "address": "2555 E Palm Canyon Dr, Palm Springs, CA 92264", "review_list": ["\nMy husband and I booked this resort with Diamond Resorts using points. There are many rooms available for direct booking, with no set rooms for either.\nWe like the roominess of our unit, with two baths ( one with shower, other with tub). The kitchen is fully loaded and the living room large. There is a sofa sleeper, as well...\n\n\nMore  \n\n\n", "\nThis is not an hotel in the traditional sense but a series of well appointed suites arranged in blocks around various walkways and a couple of pools.\nNot particularly large, it offers very well equipped, spacious, comfortable and clean apartments with dedicated free parking.\nEating facilities are limited but there are plenty of local options to choose from.\n", "\nThe resort is located just a few miles from downtown, 5 minutes’ drive. We stayed in a family apartment with fabulous mountain view, lovely balcony, next to the heated pool.\nThe apartment itself was very specious, cozy, fully equipped, lovely decorated.\nFully equipped kitchen was very useful when traveling with kids, but not only.\nHighly recommended for a romantic stay...\n\n\nMore  \n\n\n", "\nAs DI owners, Desert Isle is our 'return site'; this is our third stay here in PS. We find all needs are met in the comfortable condo units. The location is very convenient with grocery stores, eatery sites( including the excellent Manhattan in the Desert restaurant right next door), TJ Maxx in walking distance. The office personnel are very accommodating...\n\n\nMore  \n\n\n", "\nStayed here in Mid November using some timeshare points that I didn't want to lose. This resort is pretty well situated, directly across from a shopping plaza containing McDonald's, Walgreens, Wells Fargo, Michael's, a grocery store, about a mile or so from Von's for groceries and gas, same distance to the restaurants and shops of Palm Canyon Dr. and the...\n\n\nMore  \n\n\n", "\nit was a long story how we deciding what place to stay in PS. We read lots of reviews and watched hundreds of pix. The views we got from Internet about the Desert Isle was not he greatest we saw and we were looking for other places, speaking frankly. But all of the sudden it happend that we finally arrived...\n\n\nMore  \n\n\n", "\nThe location is nice, it is in a quiet area but close to downtown and has nice shops and grocery stores nearby. Lovely views of the mountains. Pools were nice and kept up, property was very pretty. There are two bathrooms in the one bedroom. Master bathroom's shower can be made into a steam bath. There is a fireplace also....\n\n\nMore  \n\n\n", "\nVery spacious two bed/two bath town house in resort where condos are spread out over property. Spiral staircase to upper bed/bath may be difficult to navigate if you have any health problems. Service was very good and restaurants and shopping plentiful in area. Does not have a restaurant but next door is excellent (Manhattan's) restaurant.\n", "\nWe had a very clean room and very impressed with the grounds. We stayed in the area closest to the office and it is very pretty. Trenton checked us in and was very sweet and helpful. Meet all our needs and requests. Most of the staff was very pleasant.\nOur biggest issue was the lack of the concierge. She was...\n\n\nMore  \n\n\n", "\nVERY UNFORTUNATE! We really loved this place but this stay of ours will be the last... Extremely poor service by staff. We booked two rooms and had a cockroach problem in both, and one of the rooms the toilet was leaking and my sister actually tripped and fell. We called when the toilet problem happened and they told us that...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/c2/d2/6c/desert-isle-of-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "326", "title": "Movie Colony Hotel, Palm Springs", "rating_string": "4.0", "address": "726 North Indian Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nA year ago, I was booked to stay at the Movie Colony Hotel for one night, but unfortunately was grounded in Houston due to extreme weather conditions and did not arrive in time to stay at the hotel. When I finally arrived in Palm Springs, albeit two days later, I stopped-by to introduce myself to the manager, Juana Loera, who...\n\n\nMore  \n\n\n", "\nHubby and myself had a great time in Palm Springs in good part thanks to this quiet and quaint little abode.\nStaff was gracious and always ready to go above and beyond to make our stay the most welcoming and comfortable. Special thanks to Mike and Juana.\nWe slept good, enjoyed the pool and jacuzzi accessible 24hr and complimentary continental...\n\n\nMore  \n\n\n", "\nI researched, got recommendations, read reviews. Ended up choosing Movie Colony Hotel. Very Glad. We had room 18--right by the end of the pool/jacuzzi area with a private patio. Spacious Room, very clean, modern, nice-sized fridge. I was worried about noise at night being right by the pool, but we never heard a thing. I think the concrete construction of...\n\n\nMore  \n\n\n", "\nWe stayed in Townhouse #29, the Sinatra Townhouse. Rumored to have been the home for Jim Morrison and his infamous ventures into the pool, the room was a marvel of Mid Century decor. The living room was gorgeously appointed with a bar, fireplace, 2 Wassily Chrome adn Leather chairs and a beautiful mirrored armoire. The bedroom upstairs featured a period...\n\n\nMore  \n\n\n", "\nIn the heat of Palm Springs there is no shade available to park a vehicle. The flooring in the unit I was in seemed like it came from a beach bungalow........a straw type weaved floor covering better suited for the sand than a hotel room. It was sticky to the touch and that in itself turned me sour. Electrical outlets...\n\n\nMore  \n\n\n", "\nWe stayed here for five nights in mid-September and absolutely loved this hotel!! I don't think there are enough descriptors to really do it justice. In fact, I think this is my first five-star review!\nThe hotel grounds are mellow and have an awesome art deco vibe. Lots of little private nooks for guests, beautiful flowers and cactus plants, lovely...\n\n\nMore  \n\n\n", "\nWe love going to Palm Springs & especially enjoy staying at The Movie Colony, we enjoy the comfort & cleanliness of this place, also enjoy the happy hour each evening where the hotel put out wine & a great cocktail, We have met many different people from around the world at these happy hours whom all agree that this is...\n\n\nMore  \n\n\n", "\nI liked this hotel which is in a great location in Palm Springs. You can very comfortably walk to the main bar/restaurant street and the hotel is small (about 15 or so rooms) and friendly with a nice pool and breakfast area.\nTwo types of room: a standard (which I had) and a townhouse (one of which was Frank Sinatra's...\n\n\nMore  \n\n\n", "\nI was back : Home sweet home! :) Perfect small hotel for couples, or people who want to relax in a calm & peaceful environment. No party crowd here.No music around the pool, the staff is caring for your comfort and rest .Respectful & discreet guests usually stay there. The rooms are very clean and simple in a mid century...\n\n\nMore  \n\n\n", "\nWe travel often to California, but never visited Palm Springs. I'm so glad we did! We have stayed at many hotels all around the world, but in our experience, The Movie Colony Hotel is amongst the best and most memorable. Checking in after hours was a breeze. Our room was basic, but crisp clean. Perfect for two girls. Service at...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/7b/74/c8/suite.jpg"}]
[{"category": "hotel", "review_count": "184", "title": "Triada Palm Springs Hotel", "rating_string": "4.5", "address": "640 North Indian Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWe easily walked to multiple restaurants, bars, shops a casino and concert venue from the Triada. Although all parking is valet parking, the valets were super-efficient, especially Kevin. Other staff members were very friendly. We were, however, disappointed in our room, which we were in for 5 nights. There was no dresser in our suite, so we lived out of...\n\n\nMore  \n\n\n", "\nMe and my husband stayed here just for the weekend. This was his second time. The staff was friendly. Everyone from valet to check in provided excellent customer service. The bed was nice and comfortable for us. This place has some amazing views that you can enjoy.\n", "\nI stayed here over the last couple of nights and this is a very nice boutique hotel. I had a casita room with a kitchen and living room. The room and guest services were fantastic. My only complaint is the valet parking, I prefer to have access to my car at all times and not have to only use a...\n\n\nMore  \n\n\n", "\nThe Triada is OK.\nWe stayed here just one night on our way through to Las Vegas. It was OK but I don’t think it deserves 4 stars.\nThere was only one person at check in which meant there was a queue, the valet was a plain clothed guy that I actually wasn’t sure if I'd just given the keys...\n\n\nMore  \n\n\n", "\nI've never been more frustrated with a hotel than I was with Triada in Palm Springs. We booked the hotel back in December based on the location and the rave reviews for stays in the casita suites with the nice full kitchens. We booked using Marriott points for a Casita suite, and even though it cost us as many points...\n\n\nMore  \n\n\n", "\nThis hotel is now run by Marriott but once was a haunt for film stars and other famous people. It was situated within walking distance of the main shopping/ eating area of Palm Springs. The rooms are set out as mini apartments and the stairs would not suit some people. While we were there the town suffered an earthquake but...\n\n\nMore  \n\n\n", "\nBeds are comfortable. Since the hotel is a renovated older structure, they've remodeled rooms making the most of the space. Some large rooms have small bathrooms, some small rooms have large bathrooms. If you care about this, ask when you're checking in. Staff is great. Angel in the bar/restaurant. Wyatt is great. Kevin and Scott in valet took great care...\n\n\nMore  \n\n\n", "\nWe came to the Triada for a few nights for a short getaway. I reviewed many hotels in the area and chose the Triada over others based on reviews and photos. I was pleasantly surprised that everything there was what we expected. Beautiful hotel!\n", "\nHad a fantastic weekend, staff is very friendly and attentive, pool area nice a cozy.\nResturants in walking distance.\nThe only negative ting to say is that the A/C is a bit noisy.\nI would defiantly come back.\n", "\nFirst the good part - the casita I stayed in was lovely - modern- contemporary with a living room and couch - full kitchen huge shower and lovely king bed - robes that actually fit - good selection of TV channels - I could have stayed in the room for a much longer stay. This hotel has a lovely setting...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/41/66/42/triada-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "553", "title": "BEST WESTERN Inn at Palm Springs Hotel", "rating_string": "3.5", "address": "1633 South Palm Canyon, Palm Springs, CA 92264", "review_list": ["\nThe hotel is quite noisy. We and our friends in another room were unable to get hot water in the shower. at breakfast the toasters did not work. The staff were unable to fix the problem we had to suggest they move the toaster to another outlet which worked.\n", "\nThis is a very centrally located hotel with a remodel going on. Our room had been pleasantly updated. The al fresco breakfast was good and is enjoyed around the pool nestled up against the hills. The tiered pool area is a retreat under the palms, but could use some daily maintenance, as there was some broken glass and tables needed...\n\n\nMore  \n\n\n", "\nHotel staff was great, breakfast was great, televisions and internet not working correctly and appartently are on going problem at this property. The room also had a funny odor, but you couldn't beat the location and the great staff, I would stay again, even with the few issues.\n", "\nHad to go down to Palm Springs for a Gymnastic competition and did not know were to stay and did not want to spend too much. The hotel is older, but the rooms have been updated. They were clean and had a refrigerator and a microwave in the room. The best part was the comfortable bed. Were were there for...\n\n\nMore  \n\n\n", "\nOn the face of it this hotel seemed like every other Best Western but is priced higher in the range - but ok it is Palm Springs so maybe it would be a more up market experience and worth the extra $$'s - Not So!\nThere were lots of problems with the room and the building itself felt more than...\n\n\nMore  \n\n\n", "\nNice clean motel with friendly customer service. The pool and outdoor area to enjoy the Continental Breakfast was awesome and so relaxing. We would stay here again. And the beds were heaven. Great location, right in the heart of Palm Springs.\n", "\nIf you can get a room cheap enough, then go for it, as the hotel is in a good location with lots of free parking. They have a decent free breakfast (made to order waffles) around the pool. The hotel needs updating...the carpet in the hallways is simply worn out. However, everything is clean, and our room on the top...\n\n\nMore  \n\n\n", "\nWe weren't really in Palm Springs to be in Palm Springs, it was just a stop over on a cross country move. This is also a budget hotel, so be aware of that - my 5 stays don't mean it's a 5 star property, just that it exceeded our expectations for the type of property we knew we booked.\nThat...\n\n\nMore  \n\n\n", "\nCheck in and check out was fast and cheerful. The room was a bit worn, but nice and comfortable - yet with a certain smell (detergent?) that my wife found annoying. Breakfast was good and the outdoor seating worked well (it was cool in the shade, but nice at the other side of the pool in the morning sun in...\n\n\nMore  \n\n\n", "\nWe're a family of four with two teenage sons. We booked at 8pm for that night. Used AAA card for discount. Once at Inn, we asked for the Booking.com rate which we were granted. Including all fees and taxes, it came out to about $120/night. We asked for a quiet room. The room on the third floor was clean, simple...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/03/24/6f/ef/best-western-inn-at-palm.jpg"}]
[{"category": "hotel", "review_count": "227", "title": "Desert Sun Resort Hotel, Palm Springs", "rating_string": "4.5", "address": "1533 Chaparral Road, Palm Springs, CA 92262 (Formerly Desert Shadows Resort)", "review_list": ["\nWe stopped over for 4 days and had the most relaxing time just sitting by the pool all day and soaking in the spa of cause with a drink. But with the apartments so close it was no effort. The small cafe was great for a meal or a coffee.\n", "\nWe just returned from a great New Years weekend at the Desert Sun Resort in Palm Springs, and loved it.\nWe stayed in a one-bedroom villa that had a private patio with a nice view of the grounds The see-through fireplace in the bedroom and to the living room was very nice as well as the kitchen. The Jacuzzi tub...\n\n\nMore  \n\n\n", "\nwe spent 3 nights four days at Desert sun Resort, also attended new year eve party at the club. The resort is very classy and comfortable. People are really nice and welcoming. The owner John & Elizabeth are super friendly. Highly recommended!\n", "\nWe loved Desert Sun Resort! Yes, we were hesitant and agreed at the gate to pull chute if necessary. But there was no reason for angst.\nFirst off, there were all sorts of people - mostly couples. Ages ranged from mid-20s to mid-70s with an average age around 45. We did not feel out of place as mid-30's. All sorts...\n\n\nMore  \n\n\n", "\nGreat location, beautiful grounds, warm, friendly staff throughout and management and a relaxing ambiance made for a wonderful week's vacation. Mmmm massage and weekend restaurant! Thank you, we will be back.\nR. Bruce\n", "\nThis place is very clean and nice. 3 pools and very private. Can walk to most of the dinner places off site\nThe staff was fine. Not real busy so nice and comfy roomy resort The other couples are friendly and approachable to talk to\n", "\nWe've been to many c/o resorts - Caliente, Paradise Lakes, Cypress Cove, plus numerous Caribbean destinations and Desert Sun was by far the best. The grounds were immaculately cared for, the staff helpful and friendly, location was perfect. Our trip included 3 days in Vegas, 3 in Desert Sun, and then 4 more in Vegas. We both wish we would...\n\n\nMore  \n\n\n", "\nThis has to be the best most fun place my girlfriend and I have ever stayed at. We were the youngest couple there but felt very comfortable and welcomed by the guest and especially the staff. We are both in our mid 20s but was awesome hanging out with older couples having great convos and drinks. The bartenders are amazing...\n\n\nMore  \n\n\n", "\nThis is one of our favorite c/o resorts. This is by far the best we have encountered in Palm Springs. The grounds are clean and spacious. There are three different, depending on whether you want active or quiet. The rooms are comfortable and many have been recently updated. The staff is friendly and helpful. The location is close to downtown...\n\n\nMore  \n\n\n", "\nWe stayed a few nights here and thoroughly enjoyed the people and the surroundings. Enjoyed the tennis courts and the social aspect. Well situated close to town and other amenities. We tried the tow other nearby c/o places for a night each but they really do not compare. Should mention that compared to the other places the there was a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/3a/c4/a5/world-famous-au-naturel.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "115", "title": "Motel 6 Palm Springs Downtown", "rating_string": "3.5", "address": "660 South Palm Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nWe were arriving late and didn't want to shell out $300 to stay an extra night in our rental house, so we stayed here. The staff people were very nice and the place was clean and quiet, but there were virtually no amenities. No shampoo! And you had to leave your driver's license to borrow a hair dryer (which had...\n\n\nMore  \n\n\n", "\nSpent one night traveling from the Central Coast of California to Phoenix. It was New Years weekend and the pickings were slim and expensive. This was available and reasonably priced. The staff was very pleasant, and the room was adequate for two and spotlessly clean. However, the amenities were non-existent. The towels were so small and thin they were almost...\n\n\nMore  \n\n\n", "\nThe rooms are up to date but a little to small for my life style. It's a Motel 6 so Good value. It was located near downtown Palm Springs so you could walk to places if that's what your into. The staff was friendly and nice.\n", "\nI had to find a hotel room fast in Palm Springs twice in November and wound up here. The renovated rooms were a reminder that if one has not stayed in a Motel 6 lately, they haven't stayed in a Motel 6. It is a bit of a walk to Downtown Palm Springs, but I needed the walk anyway so...\n\n\nMore  \n\n\n", "\nBasic, no frills rooms but they served their purpose. But for the price and especially their location it was a great deal. A short walk and you are in downtown Palm Springs with all the dining and shopping. There were some interesting characters roaming the property, wasn't sure if they were fellow guests or just roamers. But it seemed all...\n\n\nMore  \n\n\n", "\nMy husband and I came to PS for a weekend visit to a good friend of mine. We were very happy with our accommodations. The place was clean, modern and cozy. People at front desk were very friendly too. Will stay here again!\nPeter Z\n", "\nProbably the nicest Motel 6 I have stayed in. Great location on the end of the downtown, five minutes from the airport. It is a three story building with limited ..park your car out side your door rooms available. With all that said the room is just standard Motel 6 and it was almost double the rate I had paid...\n\n\nMore  \n\n\n", "\nAfter camping for 3 nights in the San Jacinto Mtns, I decided to \"splurge\" and clean up in Palm Springs. I was surprised to find the Motel 6 a real bargain. It was clean, quiet, the pool is a plus and it's easy to get to the old central district, as well as Palm (Indian) Canyon, a \"must see\" in...\n\n\nMore  \n\n\n", "\nThe facility, although it was been recently refurbished is your average Motel 6, clean, functional and basic sleeping accommodations. What make this location somewhat special is the close proximity within walking distance to the downtown area along Palm Canyon, in Palm Springs. In addition you can catch the Buzz Bus Thru-Sundays for a tour around Palm Springs along Palm Canyon...\n\n\nMore  \n\n\n", "\nAs tom says, clean comfortable room at an affordable price. Simple very friendly. Basic no extras. Office staff very friendly. Value the best I found in two days of online checking. I'd stay here again and recommend for any price conscious traveler\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/1f/bc/62/motel-6-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "155", "title": "Oasis Villa Resort, Palm Springs", "rating_string": "4.0", "address": "4190 East Palm Canyon Drive, Palm Springs, CA 92264", "review_list": ["\nWere 2 couples from British Columbia and arrived on Friday, Oct 2nd to Oct. 9th. Both the outside of resort and grounds inside the resort were well maintained, clean & looked beautiful even with the ‘moat’ and fountains turned off to conserve water. Great location for exploring Palm Springs. Not sure if our 2 bdrm. unit, 1-story unit had been...\n\n\nMore  \n\n\n", "\nThis is a gated community with extras you don't find in most rental accommodations. We had a two bedroom which also had a murphy bed so could sleep 6. A large table for eating meals and a small alcove off the kitchen with table, which was lovely.\nThere is a garage with units but very small so didn't use it....\n\n\nMore  \n\n\n", "\nThis is the perfect vacation. It's located near great restaurants, however most evenings we cooked in our well equipped kitchen. Rooms are spacious and comfortable. Office personnel are friendly and helpful. A great way to vacation in the desert.\n", "\nFamily stayed dec 25,15 in a two bedroom with a den beautiful had a great christmas, next day family had to move to a smaller unit do to availiity, to my surprise the maid reported i had a dog!! Really ofcourse i do i informed the front desk i think her name is esmerelda no problem she said i even...\n\n\nMore  \n\n\n", "\nFriendly,nice and helpful people.Fun night entertainment.Delicious food.Huge variety to choose from.Our 3 bedroom condo was clean and very roomy.We were there 9 days,and enjoyed every day.We had our 87 yr.old mother with us and she enjoy herself as well.There was shopping for everyone.Designer and reasonable.A lovely trip.We were in Plam Springs 10 yrs.ago.Things have really changed.More diverse and that's a...\n\n\nMore  \n\n\n", "\nIs Palm Springs geared for kids? I don't know, but this resort did not have kid-friendly spaces or activities like some vacation properties I have visited. For me personally this resort is just about perfect. My villa was actually a lovely one-story, two-bedroom home with its own garage. There was a barbecue (gas) with the utensils provided. Complete kitchen, ample...\n\n\nMore  \n\n\n", "\nWhat started out as a shock, power lost for the facility, ended with a great week in a fine location.The units are large and very well equipped,our first experience with a BBQ for our own unit,The selection of pools is amazing. Great location for exploring Palm Springs. Our unit backed on a busy road so the patio was of limited...\n\n\nMore  \n\n\n", "\nWe loved this resort - maybe not a 5 star but certainly a very clean and comfortable resort. We stayed in a 2 bedroom unit against the highway, the first few nights we didn't notice the noise but I have to admit by night 4 I was hearing it - not unbearable but was loud if you were enjoying the...\n\n\nMore  \n\n\n", "\nWe stayed ten days at this resort. The grounds were beautiful and we appreciated that we were provided with complementary bicycles to ride around on. There were a few things about the room that we found lacking. The television sets were really outdated and the bathrooms were in need of upgrading. Also, during our stay we only used the hot...\n\n\nMore  \n\n\n", "\nKeep a very close eye on your valuables!! We had an amazing week here, no problems until we were getting ready to check out. We had an early flight and had to be out by 4am. I had packed the car and went back inside for one last bag, I felt safe in a gated community and totally overlooked locking...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/cc/fd/3f/entrance.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "103", "title": "Extended Stay America - Palm Springs - Airport Hotel", "rating_string": "3.5", "address": "1400 East Tahquitz Canyon Way, Palm Springs, CA 92262", "review_list": ["\nFrom outside the complex looks amazing. Do not get your hopes up! As soon as you approach the entrance, the picture becomes gloomy. Smoking is allowed outside so you walk through a smoke screen, the first sight on entrance is 2 security guards, rooms are outdated and not clean, breakfast is a shelf opposite check-in desk serving grab and go...\n\n\nMore  \n\n\n", "\nThe bathroom smelled of mold and there were dead ants in the towels. It appears that they fumigated the bathroom right before we got there and it stunk. There were q couple of ants on the toilet.\nThe outside of the hotel is beautiful and the bed was comfy but there was definitely a mold issue and I specifically notified...\n\n\nMore  \n\n\n", "\nHigh priced for what! Not clean, very small rooms and very run down.\nWe were greeted by the woman at the front desk in a conversation of 10 minutes through a wall. She didn't bother to come out until I said I couldn't hear her.\n", "\nThis place was full of cockroaches, Dirty, noisy, outside areas were stinky and there were many homeless and disgusting people living in and around this hotel. Noisy pot smoking people and a horrible experience\n", "\nThe location is central and the room lay out is good with a kitchen at the entry. But otherwise this hotel is shabby. From the broken screen and non-working bathtub plug to the dirty carpet in the front lobby, I join the chorus of very disappointing.\n", "\nI have stayed at several ESAs over the years and this one is terrible. Looks nice from the outside, cheap and run-down from the inside. All the furniture in the room was old,damaged and dirty. Bedsheets were wrinkled and didn't feel fresh.\n", "\nHorrible place! From the outside it look okay, however when you walk in the cigarett smell was overwelming. We had booked a two bedroom and they ended up giving us two seperate bed rooms. My husband and I ended up staying on seperate rooms in order not to leave the kids alone. Lots of pot smoking people there as well....\n\n\nMore  \n\n\n", "\nVery disappointed with this hotel. It appears to be okay from the outside, inside it was dirty, the hallway and room smelled of marijuana upon our arrival, the bed was a double and not a queen as advertised and there was a bug in the kitchenette. Never again!!!\n", "\nI like this property for the location (near downtown), the rooms are clean and they have a kitchen area. A grab and go breakfast. The pool area is smaller and not a \"resort style\" pool rather a basic dip and go. Summer rates are good.\n", "\nWhen I booked the room I had wanted a king size bed, but all that was available was a queen. They put in the notes to switch us if available. We knew there was a small kitchen, so we packed some food, snacks, been and water. When we got there to check in I noticed that there was a piece...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/6e/42/89/swimming-pool.jpg"}]
[{"category": "hotel", "review_count": "48", "title": "Skylark Hotel, Palm Springs", "rating_string": "4.5", "address": "1466 North Palm Canyon Drive, Palm Springs, CA 92662", "review_list": ["\nWe had a wonderful one night stay at the Skylark over the weekend. We'd booked somewhat last minute and got a very nice King Size room with a mountain view. The grounds and hotel were in great condition; the view of the mountains stunning. The pool and hot tub were lit up at night, as were the grounds, with a...\n\n\nMore  \n\n\n", "\nWe had a few hickups with our 5 day stay, but the rates were still very good and all areas of the property were very clean. This hotel policy requires you to put a door sign on the handle IF you WANT your room made up, whereas most hotels I've been to assume you want it made if a do...\n\n\nMore  \n\n\n", "\nI spent a lot of time combing through hotel reviews for a last minute trip to Palm Springs. Sure there are more modern, swanky hotels available but for the price point, Skylark is the perfect choice for a weekend getaway. It's located a few minutes drive away from the main strip. The rooms are spacious, quiet, and the AC works...\n\n\nMore  \n\n\n", "\nWe decided to go to Palm Springs on a whim and got a great last minute rate for the Skylark. It fit our needs perfectly - clean and comfortable place to stay for the night. Very helpful and friendly front desk staff accommodated our late check-in. Love the 24-hr pool and hot tub, BBQ, steam room and clubhouse/lounge area. We...\n\n\nMore  \n\n\n", "\nI came across this place by chance , I drove past it as I was driving into Palm Springs...\nIt's 1950 retro , the rooms are clean & tidy and the breakfast is a continental affair but perfectly adequate for my needs .\nThe staff are so friendly and extremely helpful .... I will certainly visit here again next time...\n\n\nMore  \n\n\n", "\nWe booked this hotel on a whim after reading the other trip advisor reviews and we were not disappointed. It's it a great location, very chill and comfortable feel. Nice staff and basic amenities which is all we needed! We didn't want to end up at a place with a bunch of kids or at a place that would be...\n\n\nMore  \n\n\n", "\nI happened to stumble upon this little gem by accident. The outside tells nothing of the story inside. The building is very non descript on the outside and I think most people would just pass it by, but the oasis that awaits you on the inside is worth the second look.\nWe checked in late one evening and had to...\n\n\nMore  \n\n\n", "\nCan't say enough about this iconic hotel turned chic boutique. Loved the service, loved the colour choices, loved the breakfast bar, loved the furniture, loved the lighting, loved the way it was being maintained and manicured, loved the bed, loved the sheets, loved the products, loved the towels, loved the pool, loved the hottub, .... ok...you get it. Just stay...\n\n\nMore  \n\n\n", "\nBooked this hotel for White Party Palm Springs. What a great hotel. Clean. Comfortable. Attractive. Great location. Reasonable price. The pool area is amazing. with a great view of the mountain. Great location not too far from everything.\n", "\nWonderful welcoming staff. They were all helpful and accommodating of our requests.\nFrom front entrance to the back, very very clean, fresh and quiet. Pool area is inviting and relaxing. Rooms are comfortable and fresh. Highly recommend this hotel.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/03/13/30/5a/camp-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "199", "title": "Palm Springs Tennis Club Resort", "rating_string": "4.5", "address": "701 West Baristo Road, Palm Springs, CA 92262", "review_list": ["\nMy wife and I have been to the Palm Springs area several times and we keep coming back to the downtown Palm Springs area. It has character, interesting people, good restaurants and a some shopping. The Tennis Club is within walking distance of downtown and has very nice grounds, nice pools and hot tubs. We are time share members and...\n\n\nMore  \n\n\n", "\nPalm Springs Tennis Club is walking distance to downtown Palm Springs. On the weekend a shuttle bus stops near the front of the main building, and will take you downtown or to the casino with stops in between. We always feel at home when we visit this resort because the staff is so friendly and accommodating. Our room was clean,...\n\n\nMore  \n\n\n", "\nMe and my wife stayed here for 5 days. The unit we stayed in is in the main building. The garage to park the car is inside a gated locked area where you need your room key to get in. Depends on where your unit, some parking space is right out in the open but the resort is located in...\n\n\nMore  \n\n\n", "\nStayed with friends who had timeshare for the week. The front desk staff are disinterested, except for the night manager Mike and the activities coordinator, Ana. The onsite restaurant, Spencer's, is quite good. Service, food and value was good. The facilities are clean and the gas bbq that was for our use seemed almost new. Some of the service seemed...\n\n\nMore  \n\n\n", "\nLots of hype of how nice this was but I found it lacking. It’s in a beautiful place but needs some maintenance and a friendlier staff. Since it’s an older building, many things like the fitness center seem to be an add on. The room was noisy, in wall heat/AC unit was off and on, off and on. Overhead ceiling...\n\n\nMore  \n\n\n", "\nThe Tennis Club is a wonderful place to stay . It is great for tennis , but the location and the overall amenities make it the BEST ! The staff is exceptional and\nthe room upgrades are almost complete . Would not stay anywhere else !!\n", "\nThis is a marvelous property in a great location with a fascinating history. The design and decor are truly superb and the staff is skilled and committed to providing great service. I would rate it a five, but for some minor maintenace matters - a missing kitchen cabinet trim panel, a leaky shower head, and a door hung loosely in...\n\n\nMore  \n\n\n", "\nI first came to the tennis club 50 years ago, so it held a special place in my memories. We came back for a five day break from the cold east. Our two bed room was reasonable, spacious and clean. Tennis is all we asked for, a pre arranged game in the morning with a great mix of guests and...\n\n\nMore  \n\n\n", "\nThe service is pretty good & the grounds are well kept... However, the units are outdated. They can definitely use some renovating. Hope to come back sometime & see some change in the rooms. It definitely was disappointing. On the plus size the weather was great.\n", "\nWe've been owners since 1983 and somehow it get better and better. The resort is in great shape the units have been remodeled and look great.The grounds are immaculate and the staff is wonderful. We had a beautiful unit and the daily house keeping is a extra benefit. The resort is only a short walk to Palm Canyon Drive where...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/05/8f/bb/bc/exterior.jpg"}]
[{"category": "hotel", "review_count": "146", "title": "Los Arboles Hotel, Palm Springs", "rating_string": "4.0", "address": "784 North Indian Canyon Drive, Enter on Via Altamira, Palm Springs, CA 92262", "review_list": ["\nLos Arboles is located about 1 km (3/4 mile) from the main strip in Palm Springs.\nThe room I stayed in was spacious and very reminiscent of Mexican hotels. It was clean and comfortable.\nThe pool area is beautiful! Didn't get a chance to try the adjacent restaurant.\nI recommend Los Arboles!\n", "\nLove staying here. The rooms are very clean and inviting. The staff is very friendly. Food at the restaurant is very good Mexican food. Small and out of the way, but close enough to walk to popular downtown area.\n", "\nA nice enough hotel, but if they had told me that our room was right on the main road with cars and lorries crashing past nonstop, I would not have come here in a million years, let alone paid for a suite. They handled my request for another room with total indifference. Never again. There are much better hotels in...\n\n\nMore  \n\n\n", "\nStayed for 2 nights during Christmas break. Beautiful quiet property, indoor swimming pool with a great view of palm trees and mountains. Room was big, clean and comfortable. They have a reasonably good Mexican restaurant associated with the hotel property. Guests get 5$ restaurant credit which was kind of nice.\nDownside of this place is its location. It's kind of...\n\n\nMore  \n\n\n", "\nStayed at Los Arboles for 3 nights and had a wonderful time. Staff were so helpful and pleasant - really knowledgable too on local attractions.\nWill return from cold and wet Wales to this little gem to top up on sun and Palm Springs hospitality as soon as able!\n", "\nThis is a wonderful hotel... Very clean and relaxing, quiet, lovely staff, and with a really tasty restaurant on site. The pool is not large but very relaxing and with a nice view of the mountains in the distance. I highly, highly recommend it!\n", "\nSearch romantic beautiful surroundings with the beautiful 19 thirties movie colony dial Hotel sweet looking out onto the beautiful pool and the wonderful restaurant that I highly recommend I stay at the Los arboles Hotel in Palm Springs you won't be disappointed wonderful place for couples to retreat to\n", "\nWe stayed here for 2 nights. The only reason I picked this place because I found a great deal . Good location, walkable to downtown. Nice rooms. What I didn't like is their office hours: nobody is there for check in after 5 pm or check out before 8.30 am. Very inconvenient . Also they don't offer complimentary coffee. Basically,...\n\n\nMore  \n\n\n", "\nMy wife and I stayed at Los Arboles for a couple nights. We were working in the area so we didn't get a chance to try out the restaurant, but it smelled great! This is a tiny little family owned hotel and located behind the Movie Colony Hotel. We arrived at night and had a hard time finding it. There...\n\n\nMore  \n\n\n", "\nWhile on a swing through the high desert, we found this place on line. It looked really good, had great reviews, and was not one of the mainstream places. An added bonus were Tram tickets included with the room. It was super clean, quiet, very comfortable and the staff went out of their way to make us feel welcome. Had...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/7c/92/74/pool-located-in-the-courtyard.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "82", "title": "Desert Vacation Villas Hotel, Palm Springs", "rating_string": "4.0", "address": "250 West Vista Chino, Palm Springs, CA 92262", "review_list": ["\nWe actually rented 3 of these condos for our family to stay in for the week. My wife is very picky when it comes to cleanliness & she had zero complaints about our condos. The beds were very comfortable & the full kitchen is always a nice way to save money.\nThe pool/jacuzzi area is well maintained. The pool was...\n\n\nMore  \n\n\n", "\nWe very much enjoyed our stay at Desert Vacation Villas. It is like a Condo, and is located in the sophisticated Uptown Design District in North Palm Springs, with art galleries, interior design studios, decoration stores, and upscale restaurants, adjacent to the Luxurious Estates in the Old Las Palmas area of North Palm Springs, including the Elvis Presley Estate and...\n\n\nMore  \n\n\n", "\nWe stayed here for a week. Had a wonderful week staying at this resort, a little dated, but with recent bathroom upgrades/renos. Kitchen adequately equipped for making a meal or two. The bed in the masterbed room was comfortable, although the fitted sheet was so tightly fitted that it kept popping off - just a little annoying. The two bedroom...\n\n\nMore  \n\n\n", "\nVery roomy for two adults and two children. Three balconies, two bedrooms, living room and kitchen. We had a car so we were able to reach local sites. We had to call for arrangements to get the key (as explained to us in advance). The pool is on the small side and it's not set up like a full-service hotel,...\n\n\nMore  \n\n\n", "\nSo I was there for a birthday celebration. It was 6 women in a 2 bedroom condo. The condo wasn't bad but the beds were HORRIBLE! We all said that it felt like we slept on rocks (yes, even the sofa bed). The pool was a joke and too small. There was no shade anywhere. Would I stay there again.....\n\n\nMore  \n\n\n", "\nWe got a recently renovated room that was perfect for a family trip as we were able to cook all meals at home and everyone had their own TV with cable. The rooms are great, fully renovated apart from the cottage cheese walls and ceiling. The grounds are a bit of a let down. No real landscaping, just some sad...\n\n\nMore  \n\n\n", "\nWas a very pleasant surprise. The staff were very nice. I saw some of the reviews that say it is bland inside and out, yes it is not fancy but very serviceable. We got the two bedroom suite. It came with a master with a king sized bed, TV with movie channels, balcony, second bedroom had two twin beds with...\n\n\nMore  \n\n\n", "\nI took a nice getaway on mothers day. Nice location and very large vacation Resorts home away from home. Best kept secret in Desert Rooms very double kitchen. Nice size for family four. Very clean and well, put together\n", "\nfrom the outside, this is a beige, bland stucco box that I believe was once condos. I wasn't expecting much when I checked in—there's a small central pool, bbq facilities and free bicycles. but when I entered my upper 2-bed, 2-bath unit, I couldn't believe my eyes. fantastic modern decor—lovely furniture, light desert-appropriate colors, photos of palm trees and Indian...\n\n\nMore  \n\n\n", "\nIn early June I was invited to spend 4 days in Palm Springs with my college friends. They picked the place, in fact it was a time-share swap and met our budget. It was located right off the 111 with easy access to El Paseo, the River and downtown PS. Our villa had 2 bedrooms and 2 bathrooms, which was...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/c4/d4/96/desert-vacation-villas.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "61", "title": "Plaza Resort and Spa, Palm Springs", "rating_string": "4.0", "address": "2601 Golf Club Drive, Palm Springs, CA 92264-6501", "review_list": ["\nThis resort is in a good location near Trader Joe's and Von's, and close Highway 111 which runs through all the cities. The kitchen left a lot to be desired. It was very small, had no storage, and no dishwasher. The washer and dryer were down the hall somewhere (we didn't use it). In our unit (211) the living room...\n\n\nMore  \n\n\n", "\nI would definitely stay here again! We were offered the room with a view to our liking. We chose to have the golf course view framed by huge mountains in the distance. In fact, we had a resident hummingbird visiting each morning. Our room was a well sized studio with a private terrace. We sat there often; in the mornings...\n\n\nMore  \n\n\n", "\nFriendly staff, good size rooms with a kitchen, 2 pools, one on west end is the quiet pool, ,kitchens have stove top, and there are outdoor bbq's. No dishwashers. Rates are increased too much on Friday/Sat on a 7 day rate, but overall, pretty good value.\n", "\nWe stayed for a week and the staff was very friendly. We have two Westies, which were allowed for a small fee. The grounds were impeccable and the golf course view was nice. There were areas for the dogs and they had pet stations. You couldn't tell they allow dogs. I was sad that they are going to become Wyndham...\n\n\nMore  \n\n\n", "\nMy husband are staying here for 5 days. It is the first time at this resort. We are very pleased with the resort. We have a one bedroom unit with a small kitchen. With the exception of the kitchen the rooms are nice size. The A/C works efficiently and the ceiling fans are quite. There are elevators which is quite...\n\n\nMore  \n\n\n", "\nGreat resort in a quieter location in which you can explore the Palm Springs greater area. There are two pools, one being a quiet area. Both have bbq's that were kept very clean. We had a one bedroom suite which was huge and overlooking the Tahquitz golf course with amazing views. Victoria on the front desk was exceptionally helpful and...\n\n\nMore  \n\n\n", "\nWe chose this resort because it is a timeshare exchange and most importantly, they accept dogs. Very friendly and responsive staff, convenient location to everything in the valley and it is a quiet resort off the main drag.\nNice pool, gym and tennis courts. The rooms were huge and very clean.\n", "\nThis resort is pet friendly. The only thing is they are far away from the city. I would rather stay closer to the city. I stayed there because I wanted to bring my parrot with me. It is a very clean and well kept resort. There are golf courses close if you like to play golf.\n", "\nWe almost always stay at a Hilton, Hyatt or Marriott. This compared favorably. We spent an extended weekend here while attending a wedding at a nearby venue. It is a timeshare operated as a hotel managed by the Wyndham group. We paid a nightly rate of $90 for a one-bedroom unit. At that rate, this hotel was an outstanding value....\n\n\nMore  \n\n\n", "\nWe stayed for 7 nights and enjoyed our mini suite. We chose to face the golf course and glad we did because it's beautiful in the morning. The fitness room and sauna aren't anything to write home about...it would be more beneficial if they could upgrade these areas because the equipment isn't In too good of shape. Besides that, our...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/fd/e2/df/bedroom.jpg"}]
[{"category": "hotel", "review_count": "588", "title": "Old Ranch Inn Hotel, Palm Springs", "rating_string": "5.0", "address": "220 South Patencio Road, Palm Springs, CA 92262", "review_list": ["\nActually it's our ONLY choice when coming to Palm Springs.\nMy wife and I been coming to the Old Ranch Inn for several years (averaging about 5 stays a year) but this was our first stay with the new owners. The old owners (Ed and Larry) became our close friends and the thought of the Old Ranch without them was...\n\n\nMore  \n\n\n", "\nThis was my wife and my first visit to Palm Springs, and by sheer good fortune we stayed at the Old Ranch Inn for the week we were there. We loved Palm Springs and found it to be about the easiest place to just relax and refresh ourselves, which was the whole purpose of the trip. The Old Ranch Inn...\n\n\nMore  \n\n\n", "\nAnother fabulous stay. We stayed here before the new owners took over,Tim and Gwen.\nFabulous then, but with the new owners and helpful Rosie(assistant) it is like living in a Paradise.Exceptional,Spotless,beautiful large rooms,a great pool,great breakfast and all the bottle water you wanted and all rooms, with the pool at your doorstep.\nIt is in a ideal location, 2 blocks...\n\n\nMore  \n\n\n", "\nWe only stayed one night and wish it could have been more. The hotel is a perfect location for Palm Springs downtown activities, we enjoyed the Thursday night fair. Everything about the Inn is well appointed and beautiful and spacious and eye appealing and comfortable. Only criticism was the continental breakfast which was highly processed and packaged, although plentiful. Coffee...\n\n\nMore  \n\n\n", "\nWe loved our stay here! Perfect location that is within walking distance to the heart-of-it-all, yet is tucked away like a private, quiet oasis. The room itself was quite spacious and the bed was brilliantly comfortable. Pool fine and the breakfast worked ok\nThanks to Tim and the rest of his staff\n", "\nMy partner and I stayed here for two nights and we loved every minute of it. A beautiful place to stay with excellent facilities and the friendly and helpful Rosie. Wish we had longer to spend at Old Ranch Inn.\n", "\nFinally a place that looks good, is stylish, small enough to be intimate and offers management a chance to make conversation. It's clean, inviting, close to Main Street, yet in a quaint neighborhood.\nClearly the owners are doing something right and the guests feel it wholeheartedly.\n", "\nNice,quiet,personal ,clean, love the pool and all the hummingbirds.A perfect place to stay when you're visiting Palm Springs.Excellent.\nEen geweldig hotel, klein, luxe en alles aanwezig voor een fijn, ontspannen verblijf.Aanrader voor Palm Springs👍🏻\n", "\nWhat a lovely place this is! We loved everything about our two night stay. Tim was so welcoming and friendly and gave us lots of tips about the locale. Our room (8) was perfect in every way and we both wish we had stayed there longer. Breakfast was fresh and tasty and a relaxed affair. If you go to Palm...\n\n\nMore  \n\n\n", "\nOn check in we met Rosie, who was friendly, professional and very helpful. She showed us our room, (room 2) which didn't open to the pool as I had hoped, but was an amazing room anyway. The rooms here are huge and comfortable. I would think in winter with the fireplace it would be even more so.\nOur main reason...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/01/88/72/6f/old-ranch-inn.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "54", "title": "Residenza San Lorenzo Hotel, Palm Springs", "rating_string": "5.0", "address": "588 East San Lorenzo Rd., Palm Springs, CA 92264 (Formerly Random Haus Palm Springs)", "review_list": ["\nStayed here for 2 nights over NYE. Amazing accommodation, incredibly well appointed and beautifully renovated, all very modern, visually pleasing. 2 bedrooms and 2 bathrooms, decent sized living area and a top fitted out kitchen. Asked for an upper floor unit and it was very quiet. The pool and spa were great, everything is super clean. Is a gated property...\n\n\nMore  \n\n\n", "\nRandom Haus offers a full size apartment with a gorgeous kitchen and living area. Extremely clean inside and out!\nWe immediately felt at home.\nThis was our first trip to Palm Springs and Random Haus was a perfect location to test the dessert oasis.\n", "\nFirst off Random Haus is hands down the best place to stay if you are traveling with pets.\nEros welcomes you to the immaculately kept property. A peaceful river of koi surround the units. The staff is first class making sure you have everything you need for an wonderful stay.\nThe rooms/condos are beautifully appointed with the best kitchen appliances....\n\n\nMore  \n\n\n", "\nwonderful place to stay. we've done 6 nights here and are sad to be leaving, it's 1st class accommodation at a reasonable price. There are only positive things to say about random haus...staff friendly, accommodation spotless, facilites wonderful, spa tub gorgeous, firepits romantic, even the music played around the pool is so Palm Springs and makes this place memorable...totally laid...\n\n\nMore  \n\n\n", "\nThis was our second time staying at Random Haus this year.\nTheir staff (Eros and crew) are very accommodating and willing to assist with whatever the need may be.\nTraveling with two small dogs for this past weekend, it was convenient to have a place that felt like home and had all the luxuries to help feel that we were...\n\n\nMore  \n\n\n", "\nHighly recommend this unique accommodation. Fabulous design ( very funky lighting) , kitchen big enough to cook up a feast, friendly staff, and fish to watch while admiring the view. Pool, spa and sauna. All in all an oasis in the dessert. Didn't want to leave.\n", "\nStopped here for a couple of nights whilst heading from Phoenix to Santa Barbara. It's not a hotel but a tastefully restored two storey building containing about 12 apartments surrounding a swimming pool. We had an immaculate two bed/two bath apartment with a terrace backing onto a small stream. The living area comprises sofa and two arm chairs, study area,...\n\n\nMore  \n\n\n", "\nStayed at Random Haus this past weekend for the first time and I am definitely going back. Not only was our spacious two bedroom, two bathroom condo tastefully decorated but included amenities such as wine fridge, bar, and a yard with a koi pond/stream. Eros, the manager, was so accomodating and helpful as was the entire staff. I felt like...\n\n\nMore  \n\n\n", "\nI stayed here recently on a two week work trip. Eros and Aaron couldn't have been more helpful! I felt very well looked after! I would recommend this place to anyone looking for a self catering apartment in Palm Springs. The rooms are actually stunning and I couldn't believe my eyes when I arrived. I took videos so that I...\n\n\nMore  \n\n\n", "\nWhat a \"GREAT\" place!! For my first time in PS, I couldn't have stayed in a better place. Clean, quit and secure. Stayed in \"The Crawford\", very spacious. Eros & Arron where GREAT! Loved the Koi Pond !! After all the festivities for the weekend, wish we could have stayed longer just to lounge around... My next stay... I want...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/41/5b/a0/residenza-san-lorenzo.jpg"}]
[{"category": "hotel", "review_count": "17", "title": "Twin Palms Resort Motel, Palm Springs", "rating_string": "4.5", "address": "1930 South Camino Real, Palm Springs, CA 92264", "review_list": ["\nThis place has about 16 units, all ground floor. The rooms\nare large with full kitchens, dining area, living room, bedroom,\nand full bathrooms. Rooms are arranged around a heated\noutdoor swimming pool with a tepid 101-degree hot tub.\nWhile the living areas are generally comfortable, the\nkitchens and baths have many maintenance problems.\nThe old 1950s-era gas stoves and...\n\n\nMore  \n\n\n", "\nI stayed here for 10 days and it was refreshing and reenergising. The close proximity to town and the lay out of the accommodation made it un assumingly quaint and nice. The friendly staff and laid back atmosphere was just what the Dr ordered.\n", "\nThis is a hidden gem. It's prefect for it's location. Everything you want to see or do I'd really close by. Nice and quite area of town, and for that time of year I thought it would be a bit more busy. I highly recommend this to anyone visiting the downtown area and wants a little elbow room at a...\n\n\nMore  \n\n\n", "\nA great place to relax and have fun. John is a wonderful person was great getting to know him. Rooms were remodeled new furniture. Twin Palms is close restaurants. I also stay when I am on business. I or we love this place.\n", "\nFor this place to call themselves a resort is a joke! Don't waste your time on this property, do yourself a favor and keep looking. Aside from sub-par furnishings, utterly inadequate air conditioning (outside temp 112, inside a cool 85) this place does not live up to the posted reviews and photographs.\n", "\nWe absolutely loved David and John(proprietor). David kept us in stitches and they even brought us flowers. They really know how to make you feel welcomed. We loved the little bungalows. You have everything you need. And the best part they have BBQ's around the pool area. Looking forward to our next time in beautiful Palm Springs. There is even...\n\n\nMore  \n\n\n", "\nMy husband and I stayed at the Twin Palms resort for 10 days vacation in late April-early May, 2015. It is very well located for hiking, groceries, the outlet malls, downtown Palm Springs and for visiting other locations west such as El Paseo, the date farm and The Living Desert zoo. This is a very down to earth, well maintained...\n\n\nMore  \n\n\n", "\nI had made booking based on Tripadvisor reviews and new will not go wrong. We made booking from April 29 to May5. We arrived very late around 11pm. Seeing the property I was taken a back from the entrance. But was not so! We had lot of heavy luggage and David was so nice to get the luggage to our...\n\n\nMore  \n\n\n", "\nMy husband and I spent part of our vacation at this wonderful little resort and we were very glad we did. We loved that we had a full suite, especially the kitchen so we could prepare our own meals. There was also a barbecue outside. The pool area was lovely and right outside our door. The owners and management were...\n\n\nMore  \n\n\n", "\nWhat a beautiful gem located in Palm Springs. Very large condo style rooms with a amazing view of the mountains out by the pool. The staff is very friendly and you can tell they take a lot of pride in the place. If your looking for a quiet getaway this is the place. I have stayed at much more expensive...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/05/df/e3/fb/my-room-was-great.jpg"}]
[{"category": "hotel", "review_count": "261", "title": "Villa Royale Inn Hotel, Palm Springs", "rating_string": "4.5", "address": "1620 Indian Trail, Palm Springs, CA 92264", "review_list": ["\nAdding to the record at hand: I wrote a review about this tucked away gem last year, but went back recently and wanted to update my review. The Villa Royale Inn is wonderful. Although, the owner has made some effort to maintain the landscape a little more, there is still plenty of gardening that needs to be done. And they...\n\n\nMore  \n\n\n", "\nStayed here just the one night but would highly recommend it. Not the cheapest place in town but it has quality and comfort aplenty. A good breakfast is included too. The rooms are beautifully presented, the pool area and jacuzzi are very clean and inviting. Sat in the jacuzzi under the stars. Simply wonderful. Highly recommended.\n", "\nThis is old Palm Springs at its best! Three beautiful courtyards with sparkling blue pools. We rented 1 room for us and a suite for my parents and they were both perfect! The suite was huge! We had a lovely continental breakfast delivered to our rooms and spent the sunny December morning in our PJ's around the pool. We are...\n\n\nMore  \n\n\n", "\nFrom what I have seen during my visits to Palm Springs, this is the most unique hotel that there is and that is why I keep going back to this place. Every corner of the grounds, every room has it's own history and character. The food at the onsite Europa restaurant is simply delightful so if you staying at the...\n\n\nMore  \n\n\n", "\nMade my reservation online, unfortunately my plans changed. I cancelled my reservation a month in advance and was charged a $60 processing fee. Are you kidding me? I will never stay here and strongly recommend anyone who would considers this hotel, take your business to a place that values you as a customer.\n", "\nWe had come here first many years ago, the charm had us sold. When we came back we could hardly believe how desperately in need of an overall the room needed. The old cabinetry was in very bad shape, just about everything felt dingy worn and ready to go. It looks its best at night outside, the restaurant glows and...\n\n\nMore  \n\n\n", "\nThis is by far the sweetest place out of 4 that I have stayed in the Palm Springs area. The pool has the best views of the San Jacinto Mountain range, or stars and palm trees over tile rooftops. And the complimentary breakfasts area gentle, familial way to start each day with few decisions The property is across East Palm...\n\n\nMore  \n\n\n", "\nMy husband and I just stayed there last week for 4 days. We came just to relax from our very hectic life and saw the deal through Travelzoo so booked 4 nights. We loved this place. The staff was very friendly. We ate at the restaurant which was excellent as was the service. Breakfast was included every morning and it...\n\n\nMore  \n\n\n", "\nThe Villa Royale is centrally located in Palm Springs and a gem-of-a-compound, completely walled off with fantastic caring staff. This is the original property and home of Sonja Henie, the former three time Olympic Figure Skating Champion! Thirty-one private rooms -- two pools and a fantastic old-school restaurant. The General Manager, Chris, took care of all our needs, and seemed...\n\n\nMore  \n\n\n", "\n8f you want to stay in a quite, unique boutique hotel, this is a must. It's old Palm Springs at its best . Also, eat at the restaurant. Wow, what a meal, drinks and a harp player is one of a kind. Love thus place but it's not eating. It is dining. ..enjoy.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/c4/4f/6e/villa-royale-inn.jpg"}]
[{"category": "hotel", "review_count": "334", "title": "The Garden Vista Hotel Palm Springs", "rating_string": "3.5", "address": "1875 North Palm Canyon Drive, Palm Springs, CA 92262 (Formerly Shilo Inn Palm Springs)", "review_list": ["\nWell!! First impressions as a hotel means a lot to me!! It's about being welcomed to the hotel and feeling a good homely atmosphere, we arrived late on July 12th, as we walked in after a 10 hour drive the receptionist at check in was sitting on the desk and I thought oddly \" how professional\"\nWe weren't greeted with...\n\n\nMore  \n\n\n", "\nYes, you would expect to get a decent discount during the HOT season in Palm Springs, but this place was certainly a great surprise. Great price and the accommodations were excellent. The perfect location, right on N Palm Canyon Drive, close to a great, favorite restaurant (Sammy G's). You can't go wrong here.\n", "\nStayed here a couple of nights. The price for the room was excellent, about $50 a night including a Continental breakfast. The room was extremely large and clean, a little outdated. They have 2 pools, one for adults only which was great for us! It was quiet when we stayed there and had no issues with house keeping. The worst...\n\n\nMore  \n\n\n", "\nWe booked on line and took advantage of an exceptional deal and stayed on a Sunday night.\nCheck in was the worst I think we have experienced. The girl was disinterested, uncommunicative and slow. Fortunately things got better. Parking is plentiful. Our room was large, the King size bed was great, the shower was very good.\nThe air conditioner worked...\n\n\nMore  \n\n\n", "\nThis is a $50 hotel. The location is near downtown Palm Springs. It is adequate with an ok bed. The rooms are clean ( but smell of disinfectant ) The bathrooms are a bit worn and need some repair. The wifi was good and the continental breakfast was not very good. Overall, if you need a place to stay in...\n\n\nMore  \n\n\n", "\nThe hotel has pity much all the amenities you can ask for in a hotel. Free wifi, breakfast, pools, free parking, fridge, microwave and AC in the room and good location. The only drawback is the cleanliness. The corridor to the room was dirty and the room wasn't well dusted, the pools weren't cleaned frequently with leaves floating around. But...\n\n\nMore  \n\n\n", "\nWe were staying at another resort down the street but wanted to stay a couple of nights longer and this was very close and the price was good. Problem is when we called in to see when we could check in and were told to call back in 2 hours for an update..no problems. We called back and we were...\n\n\nMore  \n\n\n", "\nFor the price it was a good value. Large rooms, most have a patio or baloney to the pool area. Small fridge and microwave in room. Two pools and family and adult only pool. Breakfast was minimal. Check-in was fast and courteous. Grounds and rooms showed their age, but balanced with the room price, <$60.00 it was a good value....\n\n\nMore  \n\n\n", "\nFirst thing we noticed were the entry way. Door flimsy and day light seen though gaps.\nBathroom door know flopping loose and bottom of door look like some gods had been clawing on it.\nRoom decor and furnitures out dated. People upstairs VERY heavy footed, pacing most of evening, keeping us up.\nNever were told about continental breakfast by staff...\n\n\nMore  \n\n\n", "\nWe have stayed here during the Indian Wells tennis tournament. at the time, pretty much all the hotels in Palm Springs area were sold out. ok- this hotel is not La Quinta Resort, it's outdated and needs renovation. But the rooms pretty clean, service not bad, certainly ok to stay one night or two if you don't have any other...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/07/17/44/fc/the-garden-vista-hotel.jpg"}]
[{"category": "hotel", "review_count": "1594", "title": "Desert Riviera Hotel, Palm Springs", "rating_string": "5.0", "address": "610 E Palm Canyon Dr, Palm Springs, CA 92264", "review_list": ["\nWe love this property! Every detail has been thought out here. We had the pleasure of meeting the owners who were more than gracious. The staff is amazing. The room felt like home. The pool, hot tub, breakfast, snacks, fire pits, filtered ice machine and water just to name a few made our experience all we hoped for. The view...\n\n\nMore  \n\n\n", "\nWe spent two nights at Desert Riviera but it was not nearly enough time! From the minute you enter the garden/pool/hot tub area, you know it is a special place! We loved the fantastic staff and their attention to every conceivable detail to enhance one's stay. There are just 11 suites so it's quiet and friendly. Just lounging around the...\n\n\nMore  \n\n\n", "\nAs a frequent traveler who gets to stay in a wide variety of hotels, many luxury, I was astonished at attention to detail at this fabulous find in Palm Springs. Perfect in too many ways to list, including pristine tasteful decor, beautifully and perfectly manicured landscaping, coffee laid out by the fire pits in the morning, kitchen stocked with herbs...\n\n\nMore  \n\n\n", "\nThere are special places that stay in your memory and remind you to return to the place where you were happy. This little hotel is friendly and clean with a retro vibe. It's a place to relax and slow down. Take in the details that show the owners care for your comfort and are proud of the oasis they have...\n\n\nMore  \n\n\n", "\nThis hotel is one of the best. The staff was incredibly accommodating... we asked for orange juice to make mimosas with the champagne they supplied in our room for our anniversary and they promptly squeezed fresh orange juice for us. The rooms were immaculate and the ambience was great. We loved the vibe while relaxing poolside. We will definitely stay...\n\n\nMore  \n\n\n", "\nWords can not say how amazing my stay was! The STAFF,,,,,, Amazing! Very Clean rooms. This is the kind of Hotel where you can truly take a break and just relax.\nPut this Hotel on your list for return stays!\n", "\nVery comfortable rooms with mini kitchens. In a private gated area, all rooms look out over a pool and patio area with BBQ's and fire pits for guests use.\nThere is also a kitchen for guest use along with a selection of DVD's and books that can be borrowed.\nVery relaxing atmosphere. All the staff were very friendly and helpful.\n", "\nWe had been at a meeting in la Quinta and wanted to extend our stay. I actually picked Desert Riveria from reviews on trip advisor. It was so nice and the most hospitable place ever. They made us a tee time ( discounted fare) and let us use their golf clubs. We had been traveling for quite a few days...\n\n\nMore  \n\n\n", "\nThis is a small boutique hotel, 11 rooms. It was the cleanest hotel we've ever stayed in and we travel a lot. We originally booked it for two nights, not sure if we'd want to move but then chose to stay the entire week. Have to say, the hotel made our stay in Palm Springs. The service was beyond excellent....\n\n\nMore  \n\n\n", "\nMisty was super helpful with all sorts of ideas for our 5 day stay. From Vegan restaurants to detailed hikes in Joshua Tree, she set us up nicely for an active time in Palm Springs. Retro rooms with a great courtyard that never seemed too busy. They pay attention to the small details which we appreciated. We will be back!!!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/ec/23/a7/desert-riviera-hotel.jpg"}]
[{"category": "hotel", "review_count": "1247", "title": "Hotel California, Palm Springs", "rating_string": "5.0", "address": "424 E Palm Canyon Drive, Palm Springs, CA 92264", "review_list": ["\nI Just returned from two weeks at Hotel California. I had stayed there several times before the remodel, but this was my first experience with the wonderful staff and the beautiful rooms and grounds. The staff members are extraordinary,Larry, Betty, Sandy and Mike anticipate your every need, making each person feel very much at home. The rooms are very comfortable,...\n\n\nMore  \n\n\n", "\nFrom the moment we arrived at Hotel California we were impressed with the service, amenities, and friendliness. The staff and service are unsurpassed at this boutique style hotel which also had spacious clean rooms with comfortable beds, and a really lovely courtyard with a perfect pool and hot tub. Thank you guys!\n", "\nA second stay at this gem in Palm Springs. Very charming, accommodating and welcoming. The staff are the best. They can't do enough to make certain your stay is memorable. And the location is ideal. I recommend it!\n", "\nWhat can I say about the Hotel California that's not already been said? This place is perfect. It's a small family run place and you're made to feel like a member of the family.\nThe welcome we were given was second to none and the warmness and lovely service continued right up until we left the next day. As we...\n\n\nMore  \n\n\n", "\nFor our first visit to Palm Springs, we couldn't have picked a better place to stay. The Hotel California is a delightful place with a terrific staff. From the moment we arrived, we couldn't have felt more welcome and throughout our stay, the staff was always ready to make suggestions on things to see and do, as well as restaurant...\n\n\nMore  \n\n\n", "\nWell, these folks felt like family almost instantly! It's the wine on arrival (or other beverage), it's the coffee 24/7, it's the bits of conversation as if they've known you forever, it's the gas table outside the kitchen to take off the morning chill, it's the bikes to use for your scenic rides, it's the kitchen to use with plenty...\n\n\nMore  \n\n\n", "\nThis was our second visit to Hotel California, it was every much as we remembered, great service, lovely relaxing environment, brilliant facilities and overall a great place to stay for our trip to Palm Springs.\nThank you everyone for such a great holiday experience.\n", "\nThis was our 3rd stay at the Hotel California...and DEFINITELY not the last!\nWe already have reservations for our next trip to Pal Springs...now that we have grown used to being spoiled by the fabulous staff at this little gem, there is no other hotel that we would consider while here!\nThank you SO much Larry, Betty, Lucy, Sandy and...\n\n\nMore  \n\n\n", "\nHad a very pleasant stay there relaxing in the outdoor heated pool then switching to hot tub...the worries just melted away as I marveled @ the lovely & nostalgic surroundings..had that strange feeling been here before..UH..OH..\"we can check out any time we like but we can never leave\"...RIP...love lulu.. THERE ARE BIBLES HERE...\n", "\nLeave your stress at the gate and let the team make your stay here a Time not to be Forgotten.\nWho gives you welcome drinks, fantastic rooms with treats, warm pool and hot tub, a kitchen with all amenities to work your own magic, but close enough to downtown to enjoy meals out. Hot coffee, fruit, water at anytime, bicycles,...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/01/fb/33/bd/hotel-california.jpg"}]
[{"category": "hotel", "review_count": "322", "title": "Little Paradise Hotel, Palm Springs", "rating_string": "5.0", "address": "435 E Avenida Olancha, Palm Springs, CA 92264", "review_list": ["\nThis is an Adult Only hotel - very peaceful and relaxing. Hotel is very clean and rooms are up to date! Staff made the stay even more enjoyable. Bikes on the property. We golfed, biked, ran, ate and relaxed. Safe and secure place to stay. Only downside is room was typically not cleaned until 3:00; otherwise a great find!\n", "\nLittle Paradise offers a big slice of heaven. This is a fairly priced adult, sophisticated place. No children and no pets. (Isn't that redundant?) No phone call to a third party vendor in Mumbai to book a room. Call the hotel direct and someone at the hotel answers.\nThe emphasis is on peace and tranquility. No boom boxes by the...\n\n\nMore  \n\n\n", "\nThe hotel is very nice and clean. It is not far from downtown 30 min walk or around $5 for uber if you don’t want to drive. They have a separate kitchen which was a surprise for us (luxury king room) and a great modern shower. The bottle of the vine was a nice touch too. A/C was a bit...\n\n\nMore  \n\n\n", "\nCan't say enough about this wonderful hotel. Victor, the owner, was always accessible and helpful, Meagan and Judith were friendly and knowledgeable. The view is awesome, looking out at the saltwater pool and mountains. It is an adult only hotel which was great and quiet and peaceful. The pool was sparkling clean and warm and we really enjoyed the gas...\n\n\nMore  \n\n\n", "\nThis hotel is a true find! For starters, it is tucked into a lovely neighborhood - close to shops and restaurants, but without the noise and busyness of a main street. The property is lovely with the rooms facing a beautiful pool and gazebo area. We were greeted warmly at the reception and then taken to our room. We had...\n\n\nMore  \n\n\n", "\nMy wife and I booked into the Little Paradise Hotel for one night before our flight back home to Australia. We wanted a quiet hotel within a couple of hours travel time to LAX. This hotel, whilst a but more expensive than others certainly was worth the extra. We were met by Judy who was most helpful and got us...\n\n\nMore  \n\n\n", "\nMy husband and I just finished a trip to the Little Paradise Hotel and had a great time during our stay. The beds are like heaven, like you're sleeping on a cloud. The decor is modern and stylish. The room was a really good size, with our own kitchen, that they keep stocked with drinks and muffins for breakfast. They...\n\n\nMore  \n\n\n", "\nWe had a lovely time at the Little Paradise Hotel! Everything was absolutely perfect!! I only wish we stayed more than one night. The decor is modern and inviting. I was unexpectedly surprised by the kitchen in our room. HIGHLY RECOMMENDED!\n", "\nWe loved this place. Amazing views from the (heated) pool and patios. Awesome bathrooms and great beds. Location and service are stellar too. We'll be back! They got bicycles too and welcomed us with a nice cold bottle of white wine to enjoy on the patio. Great experience!\n", "\nThis little place was wonderful with amazing hospitality on a quiet neighborhood street behind a lovely wooden fence. Judy escorted us to our room to show us how to use the shower with 6 jets and to operate the remote controlled electric fireplace and pillar candles. Our room had a comfy luxurious king size bed, two upholstered chairs and end...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/b8/1b/40/little-paradise-at-night.jpg"}]
[{"category": "hotel", "review_count": "58", "title": "L'Horizon Resort & Spa Hotel, Palm Springs", "rating_string": "5.0", "address": "1050 E. Palm Canyon Drive, Palm Springs, CA 92264 (Formerly The Horizon Hotel)", "review_list": ["\nBeautiful new property, great design, excellent service, cool restaurant...what more could a guest ask for. It all starts at valet where they had a great welcome, followed by an easy check in with a nice glass of champagne. They escorted us to a beautiful room that was very private with an outdoor patio. Lots of different rooms to choose from...\n\n\nMore  \n\n\n", "\nWhen I booked this place it looked too good to be true. It wasn't.\nWe pulled in (be ready - they are valet only) and had a great check-in experience. We were in bungalow 8 with a great view of the pool. The rooms were really neat. Loved the boutique feel and the fact that it didn't \"feel\" like a...\n\n\nMore  \n\n\n", "\nThis chic-boutique captures the emotion and energy of the 1950's-60's. Upon our arrival, we were greeted with a glass of bubbly and given a tour. The grounds are immaculate with so much attention to detail, especially in our room. Loved the toothbrush holders, the outdoor showers, the furniture and shag rugs. The staff were friendly and intuitive, only approaching at...\n\n\nMore  \n\n\n", "\nWe had a mini company \"retreat\" here this weekend and we all had a great stay. The hotel was very accommodating. My husband and I were upgraded to the Residence which was just fantastic and great for hosting our 5 other co-workers for the day. The restaurant was fabulous and so beautiful. The only complaint I have is that the...\n\n\nMore  \n\n\n", "\nCould not have imagined a better stay. The entire experience was spot on; from champagne at check in, to Le Lebo (my wifes favorite.) I have never left a review before, but I also haven't had service like this before ever. The valet was fantastic I think his name was RJ was fantastic. Great with recommendations and very knowledgeable.\nI...\n\n\nMore  \n\n\n", "\nLook no further! L'Horizon is the spot in Palm Springs... impeccable resort and amazing staff. We stayed the week of our wedding which was off site. The staff was top notch in accommodating us with our wedding plans as well as being incredibly charming! They not only upgraded our room to the fireplace suite but were incredibly helpful with everything...\n\n\nMore  \n\n\n", "\nMy husband and I just stayed at L'Horizon for two nights and my only complaint is that we didn't stay longer. The staff was super attentive, the grounds were immaculate, the rooms were spacious and comfortable and the food was fantastic. I'd go back in a heartbeat.\n", "\nStayed here during Xmas 2015 for recent visit to Palm springs! This is one of the best hotels in Palm springs. Great location (1 mile for downtown), great ambiance, great friendly staff and great restaurant on property!\nThe cookies/treats they serve during the night, nameplate on the door, champagne when you check in, toiletries, robes everything was top notch!!\nIt's...\n\n\nMore  \n\n\n", "\nThis is a beautiful resort with excellent service. We were greeted with champagne and the employees were very friendly and helpful. The bungalow was very nice and different from your typical hotel room. Very comfortable. The lighting was more for mood than function. We arrived on a very cool day and actually needed the heat. The heater/AC unit was ridiculously...\n\n\nMore  \n\n\n", "\nCan't say enough about this. Service was excellent, the rooms were in marvellous conditions. The best thing was there were no children disturbing the peace and quiet that you would pay for.\nAlthough this was a touch expensive, but worth every penny.\nTook advantage of the pool and the poolside service, along with the great mountain views.\nThere was a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/84/44/78/l-horizon-pool-at-dusk.jpg"}]
[{"category": "hotel", "review_count": "151", "title": "Desert Hills Hotel, Palm Springs", "rating_string": "5.0", "address": "601 West Arenas Road, Palm Springs, CA 92262", "review_list": ["\nWe used to like this place but not anymore. We needed to cancel because of a medical emergency. We were told by the manager they would not refund our money. Even though there were still other empty rooms available. We then asked if we could have a credit to use the room some other time and were also told no....\n\n\nMore  \n\n\n", "\nMy husband and I enjoyed a pleasant and relaxing holiday at the Desert Hills. The rooms are clean and spacious. We stayed in room six which featured a quaint kitchen and was stocked with the appropriate necessities. The Inn is very well kept and clean, offering a pool and lovely spa as well as a well stocked communal pantry for...\n\n\nMore  \n\n\n", "\nafter a fabulous wedding at Colony 29, I stayed at Desert Hills for a couple of nights to enjoy the peace and quiet of the desert. These people are fabulous. I couldn't have found a nicer hotel to stay. In fact, all the guests were so nice, too. Downtown was within a couple of blocks. The tennis club was next...\n\n\nMore  \n\n\n", "\nEnjoyed how close this boutique hotel is to downtown Palm Springs - just 3 walkable blocks. Very quiet Tennis Club neighborhood in which it is located. Great mountain views from rooms on the south and north sides. Great staff, too!\n", "\nThis is one of the best places to stay on Palm Springs- small, quiet, clean, (no children/ no pets) and convenient location.\nDesert Hills is located about 4 blocks west of Palm Canyon on Arenas Rd. and an easy walk to the Tennis Club or Spencer's as well as the heart of downtown PS. Hotel offers gorgeous \"foot of the...\n\n\nMore  \n\n\n", "\nThis hotel is wonderful. We stayed 15 years ago and it's taken a while to return but wasn't it worth it!!!\nFirstly arrived late in the evening and have to say thanks to Abby and Johanna (the 2nd management) in room 2 for helping us to get checked in.\nWhat can I say about this beautiful place, it's quiet, relaxed...\n\n\nMore  \n\n\n", "\nAs promised after our Christmas 2014 visit (see long review February 7, 2015) as soon as we parked the car and walked through the gate with our luggage it just felt like we had come home, particularly since we had the same room (#6). We were late arrivals and as promised our room was unlocked with the lights on and...\n\n\nMore  \n\n\n", "\nNeeding some R&R, we decided to head off to Palm Springs for a 3 night get-away. We usually stay in the historic \"Tennis\" district near downtown, and I'm SO glad my husband remembered the name of this little gem. No kids, no pets, and no smoking allowed….just peace and quiet. We called and talked to Barbara, the most wonderful manager...\n\n\nMore  \n\n\n", "\nI really don't want to tell anyone about this treasure though I feel recognition is well deserved and warranted. My husband and I stayed here in July, a bit of respite from our Australian winter. I couldn't have been any happier than I was lazing by and in the pool. It was super quiet here, and I often found to...\n\n\nMore  \n\n\n", "\nWe would never have found this great hotel had it not been for Coachella. The hotel we had stayed in a couple of times before doubled their rates so we looked around for a better deal. Not only is the Desert Hills a better deal, our room #4 was a whole apartment with a private patio in the back. Rachel...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "359", "title": "The Chase Hotel of Palm Springs", "rating_string": "4.5", "address": "200 W Arenas Rd, Palm Springs, CA 92262", "review_list": ["\nThis hotel is situated in walking distance to the Main Street of restaurants and shops. A very old hotel but check out room 105, it has a shower with a window view, no curtains but a wall outside to keep the looky loos from peeking. The pool was warm and great for doing laps. Very quiet place for relaxing.The staff...\n\n\nMore  \n\n\n", "\nWe really liked The Chase. It's an older hotel, and they don't have any of the fancy stuff that a lot of places do (older TV's, no cable etc) but every room has a pretty giant kitchen, they have a free continental breakfast daily, delicious fresh baked chocolate chip cookies in the lobby till 9pm, and the people that stay...\n\n\nMore  \n\n\n", "\nThis is a friendly place that, with a bit of spit and polish, could be a real gem. All of the people who work here are just so nice. We stayed in room 114 which was huge and had a kitchen to boot! The air conditioner was crazy loud, but luckily I had brought ear plugs thanks to a previous...\n\n\nMore  \n\n\n", "\nWe have stayed here a couple of times, both times we have been well taken care of. Pet and kid friendly! We usually stay in the king suite with an adjoining two queen bed room and it's more than enough space for all of us. Older but clean rooms, decent continental breakfast.\n", "\nhad a four nite stay recently, and once again the chase didnt disappoint. rooms are imacculately presented, breakfast is fresh and healthy and the pool is great. staff are so friendly and helpful, cant wait to return!\n", "\nexcellent hotel. The only reason I didn't give it 5 stars: I booked this hotel because I liked the cushions pictured on the pool loungers on the hotel website, but these cushions don't exist; and the bathrooms are circa 1940. Spacious rooms, great furniture, tons of storage. Quiet and secluded, lots of foliage around the pool. You will see hummingbirds...\n\n\nMore  \n\n\n", "\nChecking in Carl, on the desk, asked had we stayed before and when we said \"yes\" told us \"nothing has changed\" - magic words indeed.\nThe Chase is my ideal hotel: lovely setting with a view of the mountains, loads of trees and flowers, great pool and a laid back vibe. The rooms are spacious and we had a nice...\n\n\nMore  \n\n\n", "\nWe've been staying at The Chase every May for about 10 years to attend the Film Noir Festival. We feel so comfortable and welcome there. The staff is super friendly, the grounds are gorgeous and right up against the mountains, the decor is unique, the breakfasts and cookies are excellent. It's nice to see dogs and cats around too. The...\n\n\nMore  \n\n\n", "\nWe stayed here for 4 nights, ages of guests ranged from 20 to 70 yrs in hotel. We had a king room which was very large with a full sized fridge & microwave. Walk in shower but no hairdryer but you can ask reception for one. The hotel owner & staff make this hotel a pleasureable experience as super friendly....\n\n\nMore  \n\n\n", "\nWe ended up getting the last room available the day we were to arrive (made the reservation that morning) and everyone at the front desk was so welcoming and friendly. Got there and loved the midcentury modern decor of the interior main part of the hotel-the hotel's entire exterior is that way too, although the rooms aren't as particularly appointed....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/01/13/94/df/chase-hotel-welcomes.jpg"}]
[{"category": "hotel", "review_count": "625", "title": "Days Inn Palm Springs Motel", "rating_string": "3.5", "address": "1983 North Palm Canyon Drive, Palm Springs, CA 92262 (Formerly Palm Court Inn)", "review_list": ["\nGreat room spacious and clean. Loved the pool and the distance to places we need to go to. Great value. We w\n", "\nThe property was very nice and housekeeping does a good job cleaning your room, You will be woke up in the morning by the sweet sound of them slamming the door to their storage closet if your room is anywhere near it. The front desk staff could be a bit more personable. Beware of overpaying for the snacks in the...\n\n\nMore  \n\n\n", "\nMy husband and I stayed 2 nights here as part of our 3 week road trip around California and boy I could have easily stopped here for a whole week. I totally fell in love with Palm Springs and this hotel is a bargain!\nWe arrived early so our room wasn't ready but there's a café that's part of this...\n\n\nMore  \n\n\n", "\nI had to travel to this area due m California Service Dog was scheduled for surgery, I am a Disable Person.\nWhen walking in to the reception are, the first thing The Female Receptionist said they didn't accept Dogs...Before asking how she could assist me or if I had a reservation, no having any information what so ever. I informed...\n\n\nMore  \n\n\n", "\nThis is a really fun place to hang out, especially if you have kids and enjoy having a fridge and microwave in the room. Usually you can book for under 100 usd per night, and that's a good deal.\nThere is a restaurant that shares the same driveway, but it's pricey. There is a Dennys down the street that is...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "284", "title": "Comfort Inn Palm Springs Downtown Hotel", "rating_string": "3.5", "address": "390 South Indian Canyon Drive, Palm Springs, CA 92262", "review_list": ["\nHotel completely unwilling to work with me on a reservation change. Book the wrong date by a day, they did not have room for me on the actual day. Discovered issue and cancelled within 5 minutes of reservation. Hotel unwilling to refund and manager hung up during our conversation. Extremely poor customer service. Will never book with them again.\n", "\nIt's understandable that this hotel is rated near the bottom of all Palm Springs Hotels. Really, the only thing going for it is its location. Right on the main thoroughfare, there are great places to dine out, shop or just walk around.\nThe hotel itself is old, tired but at least clean. The beds are a bit lumpy, the pillows...\n\n\nMore  \n\n\n", "\nAlthough this Comfort Inn is older, it is clean, very near the weekly Thursday night outdoor market, has a heated pool, an unheated pool and a hot tub. Lots of chairs for sitting around the pool. Breakfast includes the usual...waffles, bagels, pastry, cereal, yogurt, sausages, eggs, fruit. The room was clean although somewhat dated. We didn't want to spend too...\n\n\nMore  \n\n\n", "\nThe hotel is nice, clean rooms, nice pools, decent breakfast buffet. However, if you want to sleep in, this is not the place. the rooms are very noisy once people start moving in the morning. We could hear the neibors through the walls, the floor of the second story squeaked every time some one above us took a steep, and...\n\n\nMore  \n\n\n", "\nStayed here on a weekend trip to Palm Springs. After a day of hiking we were looking forward to a nice hot shower. Once we figured out the knob was labeled backwards we still could only get warm water - well short of the soothing showers we expected. The comfortable bed partially made up for this, but the small TV...\n\n\nMore  \n\n\n", "\nI am only aware of 2 handicapped accessible rooms here, and I have stayed in both. 121 is with a roll in shower, 120 has a bath with a seat in it.\nI booked a handicapped accessible, and when I was checking in, they tried to put me in a regular room. It was only when I showed them the...\n\n\nMore  \n\n\n", "\nThis hotel is ok, but the location is right in the middle of most Palm Springs attractions. They serve a pretty fair breakfast with self service waffles. The rooms are clean, fair sized and, equipped with a frig. The prices are pretty good, with discounts for military AAA and state employees.\n", "\nA lovely hotel close to all the restaurants and bars. Had a heated pool,which is great to have a dip in January and also a jacuzzi. The breakfast was good and went up to 10am every day. This is great if your on holiday. The room was big and had everything you needed. However if you have niosy people staying...\n\n\nMore  \n\n\n", "\nI loved the location of this hotel. It was downtown and we could walk to many different little shops. We were on the 3rd floor. The room was quiet and clean. The decor was older, but it was great for the amount paid. We swam in the hot pool. The breakfast was nice. They even had strawberry waffles. I would...\n\n\nMore  \n\n\n", "\nWe stayed here for 2 nights and it was the perfect spot for our Palm Springs getaway. The beds are very comfortable, the staff are friendly and helpful (thanks Cesar), and the full breakfast was a great way to start each day. We 'd definitely stay here again.\n"], "img_url": "http://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "65", "title": "Motel 6 Palm Springs East", "rating_string": "3.5", "address": "595 East Palm Canyon Drive, State Route 111 at East Palm Canyon Drive, Palm Springs, CA 92264", "review_list": ["\nThis is a less expensive motel than most in the area. But, you get what you pay for. The motel has internet only if you pay extra for it, what motel does that anymore. Even a back woods hut in Thailand has free internet as does almost every coffee house. No in room refrigerator or coffee. Could not even get...\n\n\nMore  \n\n\n", "\nWe had a great time, love the grounds and the pool, very friendly staff.We requested a poolside room and when we arrived most rooms by the pool were taken, the staff pulled a housekeeper from another section to clean a room by the pool so we can check in before we went to a wedding held next door at the...\n\n\nMore  \n\n\n", "\nIf you just need a bed and place to shower and clean up then this will do. The room was clean with only a full size bed. No appliances in room and no breakfast. But that's all we needed so it fit our needs. Stop at Elmer's restaurant just down the street for breakfast, it's great! There is wi-fi but...\n\n\nMore  \n\n\n", "\nI am not a review writer, but my experience at Motel 6 in Palm Springs needs to be known. The place is fine and it's what you might expect from a Motel 6. I'll stay there again, but what stands out from other places is the customer service.\nWe checked in late and wasn't expecting much. When we walked into...\n\n\nMore  \n\n\n", "\nNewly renovated flooring replaced carpets with laminates. Also, the interior walls are un-insulated, making conversations (or other sounds) un-attenuated. Bottom line, you can hear every step made in the room above, or sound made in adjoining rooms.\n", "\nhave passed by here many many x's over the decades. was always intrigued by the grounds. This time found out. The rooms are that new Motel 6 \"modern rooms\". (not exactly) yes it has a new bed and colors. New raised basin, and wood floor and flat screen TV.However the lights are old school as is the desk area w/...\n\n\nMore  \n\n\n", "\nThis is a Motel 6 so don't expect luxury accommodations, nice bath products or a fluffy bed. But it is clean, well-maintained, and the staff is really helpful and nice. Also they take dogs for free!\nWe stay here on occasion when we want to enjoy the Ace Hotel and Swim Club pool and other amenities without breaking our bank...\n\n\nMore  \n\n\n", "\nThis property has been renovated so the rooms are on the modern side. The room was big, clean and the staff were super nice. We stayed 3 nites and the beds were good. The grounds are big and dog friendly. We stayed in a corner back unit so the street noise wasn't bad. The price was GREAT for the area....\n\n\nMore  \n\n\n", "\nI found myself in Palm Springs after a day of exploring the Imperial Valley without having made any firm plans for accomodation that night. Knowing that decent places tend to run $175+, I decided to take a chance and just LOOK at a room at the Motel 6.\nMy preview glimpse revealed a simple and basic but very clean room...\n\n\nMore  \n\n\n", "\nI'm not a Motel 6 girl and stayed her for one night only because a late change in plans left me with no other pet-friendly options under $200/night. I was so pleasantly surprised at how clean the room was and the nice quality of the recent remodel. You get nothing in the way of \"stuff\", i.e. hair dryer, coffee pot,...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "189", "title": "Quality Inn Palm Springs Hotel", "rating_string": "3.0", "address": "1269 E. Palm Canyon Dr., Palm Springs, CA 92264", "review_list": ["\nThe worse hotel I have ever stayed in. Problems the moment we checked in. Couldn't even lock the door...party was going on..complained..police were called...ice box didnt work...both on site restaurant are closed down. Place is in of major repairs...wallpaper coming off the walls....water stains on ceiling...cobb webs hanging from ceiling...carpet falling apart. Sprinkler in front of our building were broke...\n\n\nMore  \n\n\n", "\nI visit Palm Springs frequently and often stay in four star hotels. However when the chance came to visit Palm Springs for a good deal over New Years Eve, I couldn't resist. For one of the cheaper hotels in Palm Springs, this place is excellent value. The room are clean, and the pool is really nice.\n", "\nThis Inn is at good location surround by mountain view. Though winter it have a spa, my children love it and stay in the spa. A swimming pool with warm water. A 5 mins drive could get you to shoppung and food.\n", "\nIt's not so nice, stay was okay and it's located at the far end of downtown shopping center. I think the place is closed down now. The staff was friendly and nice. Rooms were okay with it being in Palm Springs were most of the places are old and ran down.\n", "\nGot a great deal on rooms for almost a week's stay, for business purposes not pleasure. This place is old and more than a bit tired, but it is sufficiently clean and a really good value for a place like Palm Springs. The staff is spectacular! The room did not really pass my \"barefoot test.\" I wore my flip-flops to...\n\n\nMore  \n\n\n", "\nSince this was a free night for us on Choice points I have no complaints. But I would make these comments. The outdoor pool setting is very good for an average motel, so if you plan on spending a couple of hours outside relaxing this is a great location for a budget price. It was entirely my fault for overlooking...\n\n\nMore  \n\n\n", "\nOk room. When we walked inn the set up was odd. See pic. The lobby and front desk people were nice. Our room seemed quiet, which is good. A/c was on too. Good cool air, temp outside is 94. Location is far from casino. I was hoping it was closer.\n", "\nI look around as I wade into the cool refreshing (be advised I'm Canadian) water of the pool. It's 11am on a beautiful sunny Palm Springs Saturday, and I'm the only one out here. That's right, the high today is going to be about 100 degrees and I'm the only one at the pool area. Later in the day the...\n\n\nMore  \n\n\n", "\nOnce again we returned to the Quality Inn for our annual 2 week vacation. Nothing changes and it is still the calm and peaceul oasis in the desert. Art and Janice were as welcoming as ever and all the staff are amazing and really make you feel that they are glad to see you back. Yes, the hotel is old,...\n\n\nMore  \n\n\n", "\nWhile this may not be a top notch hotel in terms of amenities, it definitely serves our purpose well. We have small dogs and this hotel is great when traveling with your pet companion. It has a large area in the back for dog walking or sitting with your pet in a quiet, well groomed area. The rooms are basic,...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/b3/50/f8/exterior.jpg"}]
[{"category": "hotel", "review_count": "37", "title": "WorldMark Palm Springs Resort", "rating_string": "4.0", "address": "1177 N Palm Canyon Dr, Palm Springs, CA 92262", "review_list": ["\nIt may be owned by Wyndham now but they need to put several million dollars into the place to make it worth while. The staff was pleasant enough, but the room (602) had multiple maintenance issues, including faulty blinds, a window that wouldn't stay up, and no hot water until you ran it for more than 5 minutes. In addition,...\n\n\nMore  \n\n\n", "\nWhat a pleasant surprise, we booked a one night stay despite a number of negative reviews about this location. We are WM owners, Upon arrival we were greeted by friendly and helpful staff including the welcome desk. The resort is beautiful, clean and well kept. We were in room 213, a two bedroom that was very clean and well stocked...\n\n\nMore  \n\n\n", "\nCustomer Service is horrific. Rude and unpleasant.\nBuilding is torn down.\nPool is falling apart and always dirty.\nAdult poop 3 days out of the 7 we were there. (Many older people who do not get out to use restroom)\nAC does not hit one of the 3 rooms. When called maintenance, he said it was just poor design.\nRooms...\n\n\nMore  \n\n\n", "\nI am presently staying at this resort based on a trade through Interval International. This resort in no way should be seen as a Gold Crown Resort. It is much more of a average hotel. So do not have high expectations.\nThe Resort seems to encourage smoking on the patios of the rooms rather than having a designated smoking area....\n\n\nMore  \n\n\n", "\nUpon checking the reviews of this place prior to arriving, I am surprised about all the low or bad reviews from previous guests. A friend and I stayed here in July after having my relatives book their timeshare for us. I must say, we were surprisingly pleased with our overall stay. The location is just a short drive or walk...\n\n\nMore  \n\n\n", "\nWe usually stay at the Indio Resort but thought we would try staying in Palm Springs. The exterior was extremely dirty. The patio areas had not been sweep or watered down in ages. Our room had a \"balcony\" but it was not private. 4 units in building 5 second floor all connected. In order to walk down the stairs to...\n\n\nMore  \n\n\n", "\nPros: Friendly Staff, Clean rooms, Great location\nThe Staff is friendly and tries to help as much as possible. The unit was smaller than expected but clean. The locations is the one thing this WorldMark resort has going for them. It is close enough to downtown and has plenty of restaurants within walking/short driving distance.\nThe check-in was not bad,...\n\n\nMore  \n\n\n", "\nThis property was easy to find, located on North Palm Canyon Drive and close to shops, restaurants, and attractions. Our group also enjoyed El Consuela Restaurant, which had a great atmosphere, good food, and dancing!\n", "\nGreat hotel gives you the feel of being back in the day. Overall it was a great stay. The pool area was wonderful. The air filters were filthy and need changing. The desk helped us know more about the town then visitor information. We listened to an owner update here and it was great info, but terrible because their AC...\n\n\nMore  \n\n\n", "\nWe are a family of 4 ( hubby, 5 year old son, baby girl and myself) and we booked a 2 bedroom unit here for a 5 day getaway this past September. Location is great, we were super close to everything and within 3 miles of the entrance to the Tramway (which is a definite must while in the Palm...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/58/34/1f/worldmark-palm-springs.jpg"}]
[{"category": "hotel", "review_count": "46", "title": "Club Trinidad by EVRentals Hotel, Palm Springs", "rating_string": "3.0", "address": "1900 E. Palm Canyon Dr., Palm Springs, CA 92264", "review_list": ["\nProperty is very old and would take a renovation to complete with the newer properties. The offer free parking and wifi, although the wifi is fairly intermittent. Had a studio and feared give worst but actually fairly spacious. Dishes provided are a very mixed set but work. Place had two pools and a hot tub and were fairly under utilized....\n\n\nMore  \n\n\n", "\nWent with RCI so we couldn't cancel and move somewhere else. As it is, we left a day early. Vintage implies charm. This place has no charm, it's just a run down old motel/hotel. The room size was fine, but everything was falling apart. Even the tile floors are loose! Bed is the smallest Queen we've seen, linens flimsy. Spare...\n\n\nMore  \n\n\n", "\nExpected more, especially the fireplace in the studio per their website.Ran the a/c 24/7 as no windows opened and unit smelled funny.This property's claim to fame is the Purple Room, the watering hole of the rat pack among others. Maintenance is non-existent, including the ripped out smoke detector that was reported but not fixed by our 6th day. BUT the...\n\n\nMore  \n\n\n", "\nSuch a laid-back and friendly place. It's older - the curtains don't match the carpet and the kitchen cupboards are from the 80s - but it's clean and centrally located. It's mid-December, so I didn't think we'd use the pool, but I brought our swim suits, just in case. I'm so glad I did because my boys were in the...\n\n\nMore  \n\n\n", "\nWe booked through RCI so we paid a little over $100 for fees and 5,000 points. We had a conference to attend so compared to the other hotels that were charging $200 and more per night this place was a great value because it had a full kitchen (including cookware, dished etc.) and free Wi-Fi.\n", "\nIt seems that Palm Springs has become more trendy and hotel rates have been on the rise. This place isn't expensive like the newly renovated places but it's a no frills kind of place. The rooms are nice sized with air-conditioning, full kitchen, 2 pools, on-site washer/dryer and a restaurant/nightclub called \"Purple Room\" It's close to downtown Palm Springs and...\n\n\nMore  \n\n\n", "\nBooked via an RCI last call deal which was very reasonable for the week.\nThe motel was pretty empty yet they still put us in one of the worst locations for a room.\nWe had a studio, everything worked and it was reasonably well equipped. The downsides were it had a connecting sliding door to the room next door which...\n\n\nMore  \n\n\n", "\nold atmosphere but,partial and convenient very family oriented and close to downtown and you can reach places of interest, board members on site and great family friendly schedules, 2 nice pools. Free parking and wifi.\n", "\nThis is an older Motel style property and not everything is pristine or perfect. However it oozes atmosphere and has excellent staff who go the extra mile to ensure your stay goes as well as possible.\n", "\nI was visiting from New Hampshire Palm Springs Club Trinidad Retro Bar for a happy hour on March 12, 2015. Mike Costas was performing , entertainment was fantastic and I had a great time until a check arrived. I was slapped with a $25.00 entertainment fee!!\nI think it was a sleazy way of slipping that fee. It should be...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "3.0"}]
[{"category": "hotel", "review_count": "70", "title": "Ivy Palm Spa and Resort, Palm Springs", "rating_string": "3.0", "address": "2000 N Palm Canyon Dr, Palm Springs, CA 92262", "review_list": ["\nHotel on a budget.. bed comfy, bathroom clean, local, 7 eleven walking distance, easy in n out. We checked in after, checking into a junky hotel, left that place, and the staff gave us a great deal we could not refuse. So this hotel actually saved our getaway & it made it worth the stay. If your looking for a...\n\n\nMore  \n\n\n", "\nFinding a place to stay in Palm Springs is hard. If we had known we would of stayed further down in Palm Desert or Indian Wells.\nThis Hotel is motel style, rooms off carpark or outdoor corridors. The plus is that it is very clean, housekeeping do a great job. The negatives are the rooms are old, musty, in need...\n\n\nMore  \n\n\n", "\nUgh. Old dated ugly. Rock hard beds. Get some paint and update your furnishings! Stray cats hanging around the property. One star \"resort\". What a joke. We left but of course had to pay them. Very unhappy. Maybe ok for one hour use.\n", "\nOK .. always wanted to say what I really think of this town just east of LA with lot of hideaways . From Calgary it was a 2 day trip with lots of nice stops especially Portland.\nNice little oasis type motels and weather to the extreme .. May / June etc. For those who are going there it's a...\n\n\nMore  \n\n\n", "\nWe stayed at Ivy Palm two nights and it is very affordable, but it's old and rundown. Our king room was fine though and there was a large flat screen TV. The resort actually looks like an apartment complex and has a large statue of an elk on the grounds. The front desk guys were helpful and courteous. We did...\n\n\nMore  \n\n\n", "\nI bought the groupon deal and hoped for the best. I was greeted by a very nice man at the registration desk who pleasantly checked us in early.\nRoom was supposed to come with free WIFI, but it constantly went down. WIFI is crap.\nWhen I got to the room, it looked decent, but the bathroom was not very clean....\n\n\nMore  \n\n\n", "\nStayed a sold out weekend in Palm Springs & gave this place a chance. The staff was friendly & the property was near downtown so walking to the restaurants and all the bars was convenient. The grounds are maintained but the room needed some loving.\n", "\nNice location, have done substantial clean up around front entrance. New hotel management company now running it, previous female manager a lot more personable, checked in easily, were in the older section this time so it shows it's age, pillows less than desirable, I used the one off the couch. Good continental breakfast.\n", "\nHotel is conveniently located to many nearby attractions -\nsuch as the Palm Springs Aerial Tramway taking you to the top of the mountain for hiking, Desert Hills Premium Outlets if you are interested in shopping, Palm Springs Air Museum, and it is not far away from many good restaurants.\n", "\nA nice clean and affordable resort on the fringe of Uptown and Downtown. The \"Buzz\" Bus shuttle stops out the front and provides a free service to access the town. Friendly and helpful staff. clean rooms and tidy grounds. Good continental breakfast inclusive in the room rate, also no \"resort\" charges like some other places in town.town. Thoroughly recommend as...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/3c/c1/2f/exterior.jpg"}]
[{"category": "hotel", "review_count": "567", "title": "Palm Canyon Resort & Spa, Palm Springs", "rating_string": "3.0", "address": "2800 South Palm Canyon Drive, Palm Springs, CA 92264", "review_list": ["\nThe worst ever. Just a few deep fried prawns calamari and crab legs; no oysters no salmon no seafood casseroles definitely not my idea of a seafood sensation. Will not return. We had expectations of a primarily seafood buffet because of the tag line Seafood Sensations totally false advertising.\n", "\nI booked on-line for an April stay. No problem. When you need to make a reservation it is a smooth process. When I needed to cancel I cannot get anyone to answer the phone for a major resort! I am not an owner, I would never after this experience. I begged the operator to get me to a live person....\n\n\nMore  \n\n\n", "\nThe place was handy for us - we were in the area for hiking so it was relatively easy to get in and out of town and certainly close to the Indian Canyon trails.\nWe had a two bedroom unit - large comfortable master but the second bedroom didn't even have a closet. This may be okay if you are...\n\n\nMore  \n\n\n", "\nWe've been coming to this resort for \"years\". Time has worked wonders. Like anything else, needs a bit of touch. The maintenance and housekeeping staff are wonderful. However, the rooms need serious upgrading. The beds are very comfortable but everything else needs to be upgraded. The pools and the jacuzzi are well maintained. The gym is small but it has...\n\n\nMore  \n\n\n", "\nThe resort grounds are very nice, the pool is large and there is a separate one for the children. The rooms often smell stale and feel damp. The beds are comfortable and the linens clean. Two bedrooms have two baths but the reservation people do not seem to know that. There are not enough parking spots so you might need...\n\n\nMore  \n\n\n", "\nI had read some very scary reviews of this property (dated 2013) and was very apprehensive, but was pleasantly surprised when I arrived.\nThey mentioned bed bugs; no sign of bugs of any kind!\nThey mentioned soiled lines; clean sheets on my bed!\nThey mentioned low water pressure; the water pressure was fine in my opinion.\nThey mentioned little or...\n\n\nMore  \n\n\n", "\nWe had a spacious two bedroom two bathroom suite in November 2015 with a mountain view. The exterior of the complex looks very nice and the pool area is quite beautiful but the bar/restaurant was under renovation while we were there. Unfortunately, the interiors need updating. Maybe once they are updated this would be a good place to visit as...\n\n\nMore  \n\n\n", "\nSuperfucial problems: cockroaches, mold, broken keycard door locks and more!\nMy family own a timeshare at this resort in Palm Springs California. diamond resorts recently bought Monarch Resorts and stripped all of the value out of our deed. There are a lot of other people complaining about the exact same problem on Yelp. Avoid doing business with Palm Canyon and...\n\n\nMore  \n\n\n", "\nThe pool was amazing! Thought I would use the kitchen more but didn't feel like cooking once you start enjoying the pool. The food and drinks from the bar were delicious. I'm a vegetarian and their veggie pizza was delicious with lots of cheese. The rooms were very clean and every one was very pleasant. We got to watch movies...\n\n\nMore  \n\n\n", "\nWe had a one bedroom unit with a full kitchen, living area, and dining area, sufficient for 4 adults. Outside of our window is the pool with two waterslides, a spa, a hidden spa under the rocks (adults only after 5 pm). The staff goes overboard to ensure your stay is comfortable. Next to the pool is a small cafe...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/06/fd/fa/f1/jun-villa-queen.jpg"}]
[{"category": "hotel", "review_count": "224", "title": "Marquis Villas Resort, Palm Springs", "rating_string": "3.0", "address": "140 South Calle Encilia, Palm Springs, CA 92262", "review_list": ["\nElevators do not work. They will tell you this at check-in. The hall ways are creepy and bare. The rooms look nothing like their website. This is a former time-share property. Large rooms with 1970's furniture. Old, moldy, smelly and dirty. Please stay clear. I was so upset. If you stay here, it will spoil your vacation.\n", "\nAs of January 2, 2016 the resort is still in remodel stage. It is not a great place to stay. I am not even sure if it passes code, as you must go out to go in to the first level when coming from the garage because there is no elevator service. There are four floors of stairs from the...\n\n\nMore  \n\n\n", "\nThe location for the Marquis Villas Resort is great. Two blocks to a casino and a movie theater, one block to restaurants. Just off the main drag in Palm Springs this was a great location for an adult getaway. I say adult because there are much better destinations in Palm Springs for kids than this place.\nAs they say in...\n\n\nMore  \n\n\n", "\nFirst, the poor staff is great and trying to do their best to accommodate guests. And, second, the location is great. Otherwise...where do I begin....?\n1. Broken elevator and only way to reach room was via creepy, dirty back stairway\n2. No first floor rooms (to avoid stairs) because they were \"replacing carpet\".\n3. Broken bathroom door.\n4. Broken drawer...\n\n\nMore  \n\n\n", "\nIf you have kids this is a great place. lots of outside area with pool, spa, BBQs, tennis. If you get a room that has been renovated it is great. Very clean and has a full kitchen. a two block walk to town. next to everything. i would stay here again. It was between a three and four rating. The...\n\n\nMore  \n\n\n", "\nWe like this place so much that we'd like to discourage you from staying here (which is so hard to do)! As my hotel-appraiser sister would say, this place is functionally obsolescent. We've been here several times, and you never know what condition things will be in. The elevators have been out of commission for months, with no certain plans,...\n\n\nMore  \n\n\n", "\nThe elevators weren't working, the beds were small (but very comfortable), and there was only one bedroom and 2 baths--a funny configuration. But it was in such a good location that we decided we would stay there again--if the price was right.\n", "\nThe elevators do not work. The place is so dated. The hallways depressing. The room still had old style CRT tube TV. The furniture has been there since the 1970's. The carpet was stained and should've been changed many years ago. The patio although large, was weather beaten and looked nothing like the photos on their website. What really upset...\n\n\nMore  \n\n\n", "\nYes, the hotel is old & definitely needs some remodeling. But the price is right & the rooms are actually clean and well maintained. Plus the rooms are very large and feature nice private balconies along with a fully stock kitchen. Vlada at the desk was helpful as well. Thanks.\n", "\nThere are some good things about the Marquis: the Jacuzzi is huge and hot, the pool was heated to the point of barely feeling a tinge of cold when you get in; the view to the west is incredible; the garage underground is huge with plenty of parking. The shower had FANTASTIC pressure - no concerns about wasting water -...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/35/be/7b/exterior-view.jpg"}]
