[{"category": "hotel", "review_count": "367", "title": "Hampton Inn Charleston - Daniel Island Hotel", "rating_string": "4.5", "address": "160 Fairchild St, Charleston, SC 29492", "review_list": ["\nIN a quiet neighborhood this hotel is one of the best in its class for its serenity, staff and necessities. With a very good breakfast and wonderful evening cookies, i loved this place for its service quality and cleanliness.\n", "\nI stay at this hotel often, as it is very close to my head office location. The staff and service are just the best. Ed on the front desk, and John and Mark the shuttle drivers provide excellent service throughout.\n", "\nVisited several times on business. Great place and great staff. Rooms are clean with comfortable beds. Breakfast is complete with protein items as well as many other selections. Plan to stay here several times per year when in Charleston.\n", "\nI really enjoyed my stay here. The hotel has been recently remodeled and is very nice. Free breakfast in the morning and coffee all day, plus cookies if you are into that sort of thing. I had a great chaise lounge in my room that was a perfect place to work. The staff is very very nice and helpful and...\n\n\nMore  \n\n\n", "\nVery nice interior with a bright modern bathroom. Excellent customer service. Very clean. The guy at the front desk called us shortly after arrival to make sure everything was fine. Was recognized as a HHonors member.\n", "\nAbout a 25 minute drive to downtown Charleston but well worth it. The hotel was very clean and updated (possibly new) and the staff were very pleasant and actually seemed happy to be there. The breakfast was a real spread. Lots of options, stocked, and maintained. Would definitely stay again. The rates were very reasonable.\n", "\nBeen for 2 nights. We switch the room 3 times because they didn't sucseed to turn off the a/c .\nThey still didn't did that.\nthe recupiant didn't remember to tell the shutel to bring us back to the room unless we called 3 times.\nThe hotel is empty but they won't gave us a late chech out.\nWon't come...\n\n\nMore  \n\n\n", "\nStayed here the weekend of December 18. We were in town visiting family who live on Daniel Island. What a perfect location, as we were a minute drive from their home! We were greeted with smiles and a warm welcome from the front desk staff. The room was perfect for our family of 4 (myself, my husband and two small...\n\n\nMore  \n\n\n", "\nWe will definitely visit this Hotel and Charleston again! We only got to stay here overnight as we were leaving on the cruise for the Bahamas. The Service, rooms and Hotel as a whole were extremely nice, clean and friendly! What a great place! We have already started making plans to come back and visit, as well as stay at...\n\n\nMore  \n\n\n", "\nWe were visiting Daniel Island so it was a perfect location. The hotel is new therefore it is beautiful condition. Staff very friendly and helpful. Higher quality than a normal Hampton Inn. Breakfast was great and lobby was inviting.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/ae/e9/7f/hotel-exterior.jpg"}]
[{"category": "hotel", "review_count": "2271", "title": "French Quarter Inn Hotel, Charleston", "rating_string": "5.0", "address": "166 Church St, Charleston, SC 29401", "review_list": ["\nMaybe you're used to super high quality...and I thought I was too, but my recent stay at the FQI exceeded any luxury standard I had before. It was a special sweet sixteen trip for my daughter, and I wanted someplace really over the top. Now that I know this level of service and excess, I'll never want to settle for...\n\n\nMore  \n\n\n", "\nThis lovely small hotel caters to every need. Decor is elegant, fresh and innovative. Staff is responsive, kind and helpful with all the information about the city we needed, and ready to help with any questions or concerns about our room. Very complete and well prepared continental breakfast and evening hors'ds and wine, as well as coffee and tea all...\n\n\nMore  \n\n\n", "\nMy husband and I have stayed here multiple times. Every single time we are here, we experience truly superlative service. Whether we're talking to Joe or Matthew (two of the wonderful valets who have helped with our bags, brought our car around so my husband can fill his oxygen tank, helped us in and out of cars, etc), or talking...\n\n\nMore  \n\n\n", "\nFrom when you walk in the door everything is taken care of. Jenny and Marvin at the desk solve all your problems, starting with welcome Champain , a wine and cheese spread a 5:30, cookies and milk at 8pm, and a breakfast buffet in the morning. Probably the best hotel we ever stayed in. If your in Charleston the FQInn....\n\n\nMore  \n\n\n", "\nThis is such a great place to stay when you are in Charleston. Location is perfect.\nWe saw a special and decided to come back in January because our first visit was so nice and the second time around was just as nice.\nDelicious hot coffee in the hall on your floor in the morning (don't have to go hunting)...\n\n\nMore  \n\n\n", "\nI will remember my stay here for many, many years to come! It is by far the most impeccably kept and luxurious hotel I have ever known. We were lucky to be upgraded to a room with a fireplace and a private balcony with a view of the bridge. Our bathroom had a soaking tub and a beautiful separate tile...\n\n\nMore  \n\n\n", "\nWhat a great experience! I found myself needing a place to stay at the last moment in Charleston - preferably in the historic district. After taking a quick look at the reviews on TA, I decided to book a room. I'm so glad I did - the reviews were accurate! My positive experience began immediately when I called to make...\n\n\nMore  \n\n\n", "\nMy first trip to Charleston and the French Quarter Inn was the hilight! Of course, the city and its history are tremendous and the hotel's location puts you in the middle of it all. Right next to the market and minutes away from the heart of the historic district with its colonial homes. And of course, trendy restaurants and coffee...\n\n\nMore  \n\n\n", "\nWe stayed 3 nights in early February. It is a charming hotel. Our room was spacious with nicely thought out details and amenities but had no view. The personnel was friendliest I had encountered in any hotel with no exception. Breakfast was very good with complimentary in room breakfast option. Complimentary services included champagne on arrival, wine/ cheese at evenings...\n\n\nMore  \n\n\n", "\nOur first visit to Charleston was 12 years ago and now it has become an annual destination. We discovered the French Quarter Inn 8 years ago and ever since it has become our favorite and only hotel we will stay at while visiting the lovely city of Charleston. Our last visit was in January 2016.\nI completed a survey and...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/05/8d/c7/a3/lobby--v1847553-22.jpg"}]
[{"category": "hotel", "review_count": "2415", "title": "Belmond Charleston Place Hotel", "rating_string": "4.5", "address": "205 Meeting Street, Charleston, SC 29401", "review_list": ["\nI would not be able to rate this a four diamond property even though it has a nice location and is lovely in appearance.\nNo hot water for three out of four days. Pool closed without advance notice. No coffee or tea maker in the room.\n", "\nHeat in room didn't work, even after maintenance man checked it out. Dirty upholstery on chair and hassock. Barking dog next door. No coffee maker. This particular room was certainly NOT worth the price.\nThe only good things I can personally attest to were the friendly employees and the delicious she crab soup!\n", "\nThe staff was amazing and went out of their way on more than one occassion to help make my stay wonderful. The beds were plush and comfortable. The marble bathroom had two shower heads, one being a ceiling mounted rain shower head. The rooms, lobby, and the entire hotel was very well maintained and clean. The food was amazing and...\n\n\nMore  \n\n\n", "\nCharleston is dripping with charm and history and the only way to experience it is on foot, dining and strolling your way through this city's sunny boulevards and elegant parks. And the best location and most refined Hotel in the preferred historic downtown is Charleston Place. With it's old world style grand lobby and premiere shopping boutiques on the east...\n\n\nMore  \n\n\n", "\nI stayed at this hotel with my sisters for a long weekend. From the moment we arrived, the staff was friendly, helpful and attentive. Concierge found us good restaurants, made our reservations and even handed out cards with directions. The front desk was efficient, valet polite and helpful. The wait staff at the restaurants are top notch. And the room!!...\n\n\nMore  \n\n\n", "\nOn arrival the Porte Couchere is a bit hard to find, but then the arrival lobby, public rooms and attached shopping arcade provide a beautiful , stylish setting. Staff is very courteous and friendly. Everything works except the huge armoires ( yes I had 2 in my room ) and oversized furniture and non efficient lighting in the rooms. Bathrooms...\n\n\nMore  \n\n\n", "\nI loved the ambience and service at this hotel. I was here for a meeting, and wish I could have taken more advantage of the wonderful services of this hotel, but overall it is a great place to stay. the service shines here and the hotel is well located. Rooms and bathrooms are well designed. You are in the heart...\n\n\nMore  \n\n\n", "\nWe came to Charleston to celebrate my 30th birthday. We picked the Belmond at the recommendation of a friend, and we are glad we did. Our room was beautiful and spacious. They had a little gift waiting on us for my birthday which I appreciated. We ate several meals at the hotel at most of the restaurants and all where...\n\n\nMore  \n\n\n", "\nExcellent Hotel with very friendly staff and large, nicely appointed rooms. Right on King street with top shelf shopping! Hotel bar was nice with a good selection. While the Hotel is expensive, it is worth a trip!\n", "\nCharleston Place's newly renovated rooms and bathrooms are gorgeous-- just beautiful! Only down-side was that the walls are thin, and I could clearly hear my neighbors - all day and night... to the point that I found myself whispering just so the neighbors wouldn't hear me. Most beautiful hotel room I ever stayed in, but seemed to lack privacy given...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/08/0a/c2/76/belmond-charleston-place.jpg"}]
[{"category": "hotel", "review_count": "1359", "title": "Hampton Inn Charleston - Historic District Hotel", "rating_string": "4.5", "address": "345 Meeting St, Charleston, SC 29403", "review_list": ["\nIf visiting the city this hotel is well located to visit this historic city. The staff are friendly and helpful and the rooms are clean and tidy although the decor is a little dated.if you require help for your itinerary the front desk is very well informed and helpful. Parking is expensive however.\n", "\nWe spent 3 days in Charleston at a meeting, and found the Hampton Inn to be a reasonable and comfortable place to stay. The room was large and quiet, and the breakfast was fine for us since we do not like an excessively large one. The fruit/cereal/bread/hot selections were more than enough. The location was excellent for us, since there...\n\n\nMore  \n\n\n", "\nGood location. Right next to a parking garage - so you don't have to worry about where to park - you just have to pay. Atmosphere was nice. Best place to stay as a tourist since it is in the center of the area for shops and restaurants. It is also an older hotel - minor maintenance issues, but overall...\n\n\nMore  \n\n\n", "\nMy wife and I stayed at the Hampton to see a concert at the Charleston Music Hall, which is right next door to the Hampton. It was a great expereince and I would recommend staying at this Hampton Inn on John St. It was also walking distance to a lot of great restaurants, bars and shops. We went with another...\n\n\nMore  \n\n\n", "\nMy wife and I spent three nights in a great walking town, We parked the car and enjoyed exploring the city on foot. Our room was comfortable and we had no issues with noise. We found the staff to be helpful and friendly. We were aware of the parking charge but accepted it as the price you pay for the...\n\n\nMore  \n\n\n", "\nI stayed here one night for a brief girls trip away.\nThe hotel is clean, quiet, and comfortable and the breakfast was better than the average Hampton Inn. Parking is $17 per day in the adjacent city garage.\nIf you plan to spend most of your time sight seeing and want a conveniently located, reasonably priced room, this Hampton Inn...\n\n\nMore  \n\n\n", "\nWe recently stayed here for a two day conference. Next year we will go back to the Embassy Suites right next door. The service was non-existent. I asked several times for our bed to made up with a blanket instead of the duvet. never happened. Same with the request for different pillows. never happened. All they could do when we...\n\n\nMore  \n\n\n", "\nThe Hampton Inn was a great place to stay. Trip Advisor did say that parking was included and IT IS NOT. Be prepared to pay $17.00 a day. It is an older hotel and there was a climate control issue. However, maintenance is available 24 hours a day. The breakfast was outstanding.\n", "\nThis hotel has a good location, with a free downtown trolley stop just across the street. The staff was friendly, helpful and professional. The complimentary breakfast was unusually well-stocked with a variety of choices. The room was clean and comfortable, although a little small by Hampton Inn standards. Overall, we were pleased but encountered several issues.\nBy all appearances, this...\n\n\nMore  \n\n\n", "\nThis was my fourth stay at this property. Again, I enjoyed the spacious lobby, varied breakfast, convenience to downtown destinations, and accomodating staff. This time I had a ground floor room far from the noise of the lobby, with a comfortable king bed.\nIt adjoins the Camden Street parking garage (City of Charleston) and the Charleston Music Hall, where many...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/09/26/71/a1/carriage-wheel.jpg"}]
[{"category": "hotel", "review_count": "2305", "title": "King Charles Inn Hotel, Charleston", "rating_string": "4.5", "address": "237 Meeting Street, Charleston, SC 29401 (Formerly BEST WESTERN King Charles Inn)", "review_list": ["\nThe location, the staff, the facility, all were beyond my expectations. I'll be back. I came down for a business trip and asked my wife if she's like to come along and spend an extra day or two in Charleston. Everything we wanted to see was within walking distance, including some of the best restaurants in the area. Very happy...\n\n\nMore  \n\n\n", "\nOnly stayed here one night for business, but the friendly staff made me feel welcomed, and were attentive to ensuring a comfortable stay. Room was clean and cozy, and the hotel itself is within walking distance of Charleston's unique and historic peninsula.\n", "\nWE have stayed at King Charles Inn numerous times while in Charleston. We have never ever been disappointed. Our recently winter getaway was perfectly lovely. Once again the staff and facilities were just lovely.\n", "\nOur second time to Charleston, first time staying in the historic district. Definitely a convenient location, never took the car out until we left! Breakfast was amazing, front staff very helpful! Got lots of Fitbit steps!\n", "\nOur stay involved two couples, two rooms, and one car. The hotel is perfectly located for those focused on walking around historic Charleston, as it is a pleasant walk to numerous sites including the historic synagogue and churches, museums, and the departure point for the boat tour to Fort Sumter. The front desk staff were available and helpful; the service...\n\n\nMore  \n\n\n", "\nMy group heartily recommends the King Charles Inn for its superb service, convenient location in the heart of the historic district, the helpfulness of the front desk in recommending restaurants, pedicabs, and places of interest. The dining room and bar are excellent.\nA very worthwhile and memorable stay.\n--Tennessee Chapter of the Society of King Charles the Martyr\n", "\nHaving never been to Charleston before, looking for the correct location, price point and experience in a hotel was imperative. I of course went to Trip Advisor, narrowed it down to a couple of choices and then picked the King Charles Inn. Boy was that the correct decision. The moment the booking was made the hotel e-mailed to remind me...\n\n\nMore  \n\n\n", "\nThe King Charles Inn is a charming & well located hotel within walking distance of most of what we wanted to see in Charleston. Monica and Dana (desk clerks) were available each morning to give us tips on where to eat and what to see in the city. Our hotel room was clean & quiet, the beds were comfortable &...\n\n\nMore  \n\n\n", "\nThis hotel had beautiful rooms and friendly staff but did not meet our expectations for the $272/night price. No valet parking, hallways and rooms were still being cleaned during check-in (4pm), bathroom vent did not work in 1 room (we booked 2) the rooms were not beside each other and were booked at least 5 months out. Bags were only...\n\n\nMore  \n\n\n", "\nThe location and staff are top notch. The room was amazingly large, quiet(#528) , and comfy like home. Loved the fridge that we could actually use without penalty. Many little extras like snacks at cocktail hour , cookies, nice, in case you should somehow get hungry while in such a great food town.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/04/85/98/a7/hotel-entrance.jpg"}]
[{"category": "hotel", "review_count": "1131", "title": "Town & Country Inn and Suites Hotel, Charleston", "rating_string": "4.5", "address": "2008 Savannah Highway, Charleston, SC 29407", "review_list": ["\nHUGE property so usually always something available. 3 pools, laundry, next to shopping & trolley. I'm a local and I'd return anytime. the best part is it's in the epicenter of the best shopping in the city and very close to the beach.\n", "\nSuper nice hotel. King room was really nice. The bed was so comfortable. Would stay again. A must stay if you are going to Charleston. Only 6 or 7 miles from town. Very close to everything. Will be where I stay on my next visit. Staff was very friendly.\n", "\nThis hotel said to be recently renovated. It shows! Our room was not only among the largest we've seen, but the floor plan exceptional. There's plenty of space for a king-sized bed, with high quality linens. Also a true sitting area with two wingback chairs and table between. There's a large desk for work. Interestingly, the large screen TV was...\n\n\nMore  \n\n\n", "\nIt is as nice Hilton or similar hotels but at a better price. It is convenient to downtown and other shopping. I needed legal size copies made. Staff did it with smile and at no charge. The restaurant is good especially the breakfast baffet and they have a nice workout room.\n", "\nWe are staying at Town and Country and having a very pleasant stay. The rooms are clean and everyone is friendly. The breakfast was good.\nThe front desk was helpful and the waitstaff was super nice. It is a short drive to downtown and the hotel price is very fair.\n", "\nHuge lobby and friendly check-in.\nNice bed, quiet room, free parking, convenient by a short drive to downtown. Close to Citadel Mall and the box stores along Savannah Highway. Easy access from 526 or Savannah Highway. Cable was down supposedly but it was fixed quickly.\nLuxurious place for under $100 a night!\n", "\nWe were very pleased with our stay. It was a very nice room. The price per night was really good for the area. Took about 15 minutes to get to Charleston historical district. The food was good in the restaurant as well. I will definitely stay again.\n", "\nWe stayed at this hotel for 3 days and 2 nights. The staff were friendly and the hotel was very clean. On our last night we ordered room service and it was fantastic! The food was definitely filling. The only minor thing was that the bathtub kept draining but we only used the tub once (loved the huge shower!) so...\n\n\nMore  \n\n\n", "\nChose based on other TA reviews. Very very clean. Nicely appointed. Good restaurant onsite. Nice pool and fitness area. Rooms very clean and nicely appointed. Staff very friendly and helpful. Only 10 min to historic downtown and 1/2 the price of downtown hotels. One caveat...we had room 130 which was lovely but butts up to wall leading to outside so...\n\n\nMore  \n\n\n", "\nI stayed here for 2 nights while visiting Charleston. It's perfect. Close enough to downtown but far enough out that the prices aren't insane. I had a king air bath suite. The room was large, clean and modern. The linens were so soft. The bed was cozy and comfortable. The air bathtub was a dream. You can open the pocket...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/f0/4d/42/ashley-suite.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "2105", "title": "Francis Marion Hotel, Charleston", "rating_string": "4.0", "address": "387 King Street, Charleston, SC 29403", "review_list": ["\nVery nice room....with tall ceilings, two full size beds....excellent mattresses. Large closet and a second small one. decent size bath. large room, overall\nNegatives: window faces lovely red brick wall.\nIt took 24 minutes for shower water to get hot......every time.\nWIFI didn't seem to work. It was 'on', but I could never get my cell phone nor my\ncomputer...\n\n\nMore  \n\n\n", "\nThe France's Marion is in the center of the historic district in Charleston. The market, battery, galleries, and many great restaurants are within walking distance. At your feet is the beautiful King Street and the trolly stops at the hotel. Great southern history to the building too. The staff is very helpful, in-hotel dining is good and the rooms are...\n\n\nMore  \n\n\n", "\nMany years ago on a visit to Charleston I stayed in this wonderful old hotel and wondered if it continued it's great service and amenities.\nThe old charm is still there and the service is terrific. The rooms are small but well appointed. They show a little wear but like a grand old lady they are comfortable and a delight....\n\n\nMore  \n\n\n", "\nBeautiful hotel. A must place to stay if you want to really get the feel of the city. You can walk to shopping, site seeing, restaurants or even across the street to through a Frisbee.\nI have stayed several times and you have to get used to the slow elevators and small bathrooms. In summer the rooms are just plane...\n\n\nMore  \n\n\n", "\nWe enjoyed our stay very much. The service was terrific- very helpful and friendly. The hotel did a nice job with the renovated rooms and even though it's an older hotel, we appreciated it's charms.\nHad a lovely view from the room. The location suited our needs perfectly.\n", "\nEverything was awesome with the exception of the a/c in my room. I should have reported sooner and your attention to my request was prompt. The staff was wonderful everywhere in your facility. I would visit again if the need arises.\n", "\nThe France's Marion is in the heart of the historic district in Charleston. You can walk to the market, battery, great restaraunts and fantastic shopping on King Street. The free trolley stops right by the hotel. The is a Starbucks in the hotel and The Swamp Fox for dining. The hotel staff is wonderful. Off site parking is your only...\n\n\nMore  \n\n\n", "\nI think this hotel has the most interesting room. Our king size bedroom had 2 bathrooms. It was perfect!!! The staff was extremely friendly and their was a Starbucks downstairs. The location was also very nice. We walked to dinner and other attractions. Thanks for providing a comfortable place to stay and visit.\n", "\nWe recently stayed at the Francis Marion Hotel for business. The staff was OUTSTANDING. Each member of the Hotel Staff was so accommodating, friendly, and helpful.\nThe food at the Swamp Fox Restaurant was terrific. Several members of our conference wondered when we could schedule another conference at the hotel!\n", "\nVisited for work and enjoyed the hotel. I didn't experience any paranormal activity but the walls are fairly thin and I could hear my neighbors and folks in the hall. Probably a trade off of staying in such a lovely old building, so just beware if you're a light sleeper.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/01/cd/b1/9e/francis-marion-hotel.jpg"}]
[{"category": "hotel", "review_count": "1570", "title": "DoubleTree by Hilton Hotel and Suites Charleston - Historic District", "rating_string": "4.0", "address": "181 Church Street, Charleston, SC 29401", "review_list": ["\nI say Hotel Janus because like the Roman God of the same name, this hotel definitely has 2 faces. The location is exquisite. In the heart of the Historic District and literally across the street from City Market. The staff was deplorable. Not at all helpful or friendly. Prior to arrival I made a simple written request for an extra...\n\n\nMore  \n\n\n", "\nDoubleTree in Charleston, SC was great! Rooms were very clean, hotel staff was very friendly and helpful. This was my sixth year in a row staying at the DoubleTree and it just gets better with each visit. Would recommend this hotel to anyone looking for a great weekend get-away.\n", "\nI stayed here in Sep 15 and was very happy with my stay. Did a girls trip and returned here in Jan 16 because of the location. U can't get any closer to market street. I've decided this hotel is my favorite in Charleston... end of story. The staff is always friendly and willing to answer questions. One of my...\n\n\nMore  \n\n\n", "\nMy wife and I decided to spend the night in Charleston for our anniversary. This hotel is right next to the markets and we could walk to the shops on King Street and restaurants. We got a room in what they told us was the \"newer\" part of the hotel. We got a corner room which ended up having a...\n\n\nMore  \n\n\n", "\nThe location was great and we enjoyed the sleep, but I like to spend some time on an elliptical before starting my day. Arriving at the fitness center at 7:00, I found I could not access the fitness center until 8 AM. When I asked if I could access early the desk clerk was surly and intimated that workouts were...\n\n\nMore  \n\n\n", "\nWe were enjoying a bottle of wine in the courtyard using the plastic water glasses from our room. The bartender saw us through the windows from the bar & brought us wine glasses remarking, \"you'll enjoy the wine better with these\".\nI'd call that \"attention to detail\" & excellent guest service!\n", "\nGreat location and friendly staff. Right by the market. Hank is right next door but there are plenty of other dinner choices near by. You should plan to get up early and walk to The Battery while the city wakes up. When you get back there will be a nice breakfast buffet waiting on you. I will stay here again.\n", "\nHotel is in a great location and very clean. Our only complaint is that we had no hot water on day of check out. We reported it at the front desk and all she said was that she would make a note of it. Did not even apologize. Could not ask for a better location for downtown.\n", "\nCute southern charm. Was there for a company meeting. Rooms are fine, bathrooms a bit dated. Clean. Very well located! Great for business travel. It is what you'd expect from a doubletree. The location makes it ideal. Bed was comfortable. X\n", "\nThe Doubltree in Historic Charleston was a perfect location to walk around the city. The staff was great and the rooms were clean and had everything needed for a business trip. They went above and beyond to assist in getting to the airport for an early flight when weather was an issue.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/a6/83/b5/doubletree-by-hilton.jpg"}]
[{"category": "hotel", "review_count": "1581", "title": "The Vendue Hotel, Charleston", "rating_string": "4.5", "address": "19 Vendue Range, Charleston, SC 29401", "review_list": ["\nThe Vendue turned out to be a great choice for us on our first visit to Charleston. The location can't be beat. We were able to take long beautiful walks through history, gorgeous architecture and amazing trees. The hotel itself is lovely and interesting with it's art and decor. We loved it. The bellman, Shea, was a delightful person who...\n\n\nMore  \n\n\n", "\nMy daughter surprised by booking us a room for our quick stop over in Charleston - but I will definitely be back! The staff was so accommodating and friendly, our room was beautiful - I loved every detail from the toile to the fireplace. The art was an added bonus. I highly reccommend.\n", "\nThe Vendue had the perfect location for our recent visit to Charleston. We had two dinners at nearby restaurants, used it as a base for strolling around downtown and loved being so close to the water.\nThe staff was super helpful and friendly. The afternoon wine and art reception was great. We really enjoyed the art from the on site...\n\n\nMore  \n\n\n", "\nBetween the unique historic buildings and all the beautiful art work The Vendue is unmatched! The staff is always friendly and ready to go above and beyond! A true gem in the heart of the historic Downtown Charleston! I enjoyed the art reception in the evenings followed by a fun art tour! We took the complimentary bikes out for the...\n\n\nMore  \n\n\n", "\nThe hotel staff is always fantastic. Harris went out of his way to accommodate an adjustment to my room. The bar downstairs is great. Always stay in the signature king room. This property is great for personal or business trips.\n", "\nThe servers and bartenders were very friendly. Great place to go for a rooftop bar drink. Very happening place that seemed to have a lot of locals. A great time with reasonable prices. Great views and makes for an awesome photo.\n", "\nVendue is really nice and in a great location. Very friendly and accommodating staff. The art makes if fun to explore the hotel. Very close to the water and to the City Market. Bikes are available. I did not use one, but it would be great to use along the water and the Battery. Rooftop bar was fun and the...\n\n\nMore  \n\n\n", "\nWe had a great stay at the Vendue. It's location can't be beat. It is located within walking distance to a lot of great restaurants and activities. The rooms were spacious and clean. The beds were very comfortable. The staff were always friendly and helpful. They have a roof top bar which is a great place to have a drink...\n\n\nMore  \n\n\n", "\nOur first but not last visit to the Vendue. Cannot say enough about this hotel. Location is perfect, hotel décor is wonderful and the folk who work there are the most friendly, helpful people! It definitely is worth a visit! Cannot wait to go back.\n", "\nMy boyfriend and I returned to the Vendue to \"right a wrong.\"Last February, we anticipated a great stay at the Vendue only to face a series of unfortunate mishaps- the quiet room ended up being a noisy one on the main floor; the heat was not cooperating and the plumbing had issues. We have stayed in enough hotels to realize...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/20/b9/02/the-vendue.jpg"}]
[{"category": "hotel", "review_count": "1606", "title": "Harbourview Inn Hotel, Charleston", "rating_string": "4.5", "address": "2 Vendue Range, Charleston, SC 29401", "review_list": ["\nFor early February I was hoping for better hotel rates in Charleston. Luckily I did find a deal for the Harbourview on travelzoo which for $149.00 w/o tax, included a king room, valet parking, and a bottle of proseco. A good find, all things considered. But after spending a night there, I would have a hard time paying a dime...\n\n\nMore  \n\n\n", "\nI love this place! Very relaxing room, helpful staff, polite guests. Great stay. Breakfast is always on time and fresh. Warm cookies and milk in the evening are a great touch. I love the umbrellas that are available for guest on rainy days.\n", "\nOur board of directors has been meeting at the Harbourview Inn or one of its sister properties in Charleston for the past 8 years. It's comforting to find a facility that fulfills all your expectations from the start, but better yet to watch it start from a position of excellence and then improve year after year. The Harbourview staff, facilities,...\n\n\nMore  \n\n\n", "\nOur first adventure in South Carolina and what a pleasant experience. Beautiful location and very romantic and relaxing!!! We will return and surley reccomend the Harbourview Inn to our friends and family. Thank you for such a wonderful stay.....felt so welcomed.\n", "\nclose to every thing... run on the waters edge, look at history in the park,, go to tons of Great places to eat.... this is THE PLACE to stay.. it aint cheap but go in the winter when the rates are not too bad and the tourist traffic is not too bad\n", "\nThe staff at Harbourview Inn makes the stay wonderful. We stayed in a room with the exposed brick from the 1830's. Love the room and the bath tub for soaking after a day of walking and eating! Location is perfect. We sent my parents on a trip years ago and they stayed here. They loved it, so we booked our...\n\n\nMore  \n\n\n", "\nperfect location, everything you need within walking distance...great views of the water and the fountain in the park...the staff was amazing...the room was better than expected with old world charm and very modern bathroom...love this place and will return!!\n", "\nResearched many hotels in Charleston's historic district and finally settled on HarbourView Inn. Beautiful and well maintained hotel located next to harbour and within walking distance to all major attractions and restaurants. What makes this a great hotel is the service, friendly employees and the extras that are included. You have the option of having complimentary breakfast delivered to your...\n\n\nMore  \n\n\n", "\nFor a first time visitor to Charleston, SC, it was a rewarding experience staying at the Harbour View Inn. The staff was very friendly, customer-oriented and the rooms was in excellent condition with a large bathroom. Also, the complimentary breakfast and cheese and wine in the evening was great.\nThe location was very convenient and accessible to restaurants, bars or...\n\n\nMore  \n\n\n", "\nFrom the moment we pulled up the staff went out of their way to welcome us. The room was beautiful and we wished we could stay longer. Loved the extras - afternoon tea, evening wine and cheese, later cookies and milk. It couldn't have been convenient to restaurants, shops, and sightseeing. Thank you all!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/ee/d9/78/harbourview-inn.jpg"}]
[{"category": "hotel", "review_count": "2505", "title": "The Mills House Wyndham Grand Hotel, Charleston", "rating_string": "4.0", "address": "115 Meeting Street, Charleston, SC 29401", "review_list": ["\nReceived excellent service from the valet parking staff, to the front desk, to the room service and on and on... Staff really know how to treat customers. The hotel has all your amenities you would expect in this price range. The hotel is located in the heart of everything. A short walk to some of the greatest restaurants and shops...\n\n\nMore  \n\n\n", "\nEXCELLENT location - having lived there many years ago, I knew exactly where I wanted to stay - perfect locale for all of the walking!! Fantastic hotel!! Beautiful interior! Rooms CLEAN!!! Comfy beds! Of course the staff was polite and attentive, it is Charleston after all. Christmas tree was gorgeous! Bar/lounge relaxing after walking all day. Delicious breakfast to order,...\n\n\nMore  \n\n\n", "\nTook a weekend trip for my boyfriends birthday. The Front desk staff were professional and friendly. We visited the bar in the Barbadoes Room, the bartender Laura went above and beyond to make our first trip there extra special!!! We will definitely return to enjoy more of Charleston and the friendly staff at this hotel!!\n", "\nThis hotel was a great deal and very luxurious for the price (I still can't get over it.) They had free coffee in the am, free champagne in the afternoon and stopped by your rooms every day for as many bottle waters as you wanted. They had free wi-fi and really was in the middle of everything. You could easily...\n\n\nMore  \n\n\n", "\nThis hotel is in a fantastic location for walking to the market, bars and restaurants. The room was very clean, bed was super comfortable and bathroom was clean (I am a stickler about that). They have a cute courtyard with fountain that looked very inviting, if it had been a bit warmer. Staff was very attentive and friendly.\n", "\nBeautiful, charming hotel in a perfect location. Nearby restaurants, shopping, lots of interesting architecture. King room was spacious with a great view. Restaurant was the perfect place for afternoon tea. Convent parking in the garage next door.\nWill definitely return.\n", "\nThis hotel is in a great location and is an excellent value. The staff is courteous an helpful and the room are clean and fresh. The beds are comfortable as well. We will be back to this affordable spot!\n", "\nThe Mills House was great in it's location to all the sights . We had a great weekend there . Beautiful Hotel !! It's close to all the sights . The staff was wonderful and the food was the South Carolina comfort ! Try the shrimp and grits ! Loved Pearls restaurant and the Kickin Chicken !! Would definetly stay...\n\n\nMore  \n\n\n", "\nWhile in the USA, my Fiancé and I we decided to tie the knot. We booked here for a few nights. On arrival the hotel were fabulous, we were given a room upgrade which was a lovely touch. Within 15 minutes of being in the room, some complimentary Bubbly and chocolate fruits arrived. Im not saying this is a standard...\n\n\nMore  \n\n\n", "\nWe had a great stay at the Mills House! My husband and I stayed for six nights while attending a wedding in Charleston. The staff were extremely hospitable and willing to accommodate our every need. As part of the wedding party, I made several requests and arrangements with the help of the staff who went above and beyond to make...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/01/e2/2d/98/since-1853-at-the-corner.jpg"}]
[{"category": "hotel", "review_count": "990", "title": "Market Pavilion Hotel, Charleston", "rating_string": "4.5", "address": "225 East Bay Street, Charleston, SC 29401", "review_list": ["\nWe stayed on the concierge level and the pluses were really nice. There were cocktails and snacks in the evening and the breakfast was wonderful. The staff were very attentive.\nThe hotel is in a great location and the rooftop bar is second to none. The room was clean and the bed was very comfortable.\nThe only negatives were the...\n\n\nMore  \n\n\n", "\nDear Peter,\nThank you for such a lovely stay. I checked in on Tuesday, booked through the business office at my district, and extended my stay through Saturday personally for a weekend planned with my family. Originally, I had booked to move to the Spectator, and cancelled that reservation. Just writing to say how grateful I did. I love the...\n\n\nMore  \n\n\n", "\nThis is a perfect hotel for a visit to Charleston. The rooms are very elegant (and fairly large). The location is perfect to walk to nearly everything in Charleston. The roof top bar is excellent. The pool and the poolside service are also great- its a perfect spot to relax at the end of the day.\n", "\nCharleston has a number of lovely hotels and great restaurants, but the Market Pavilion has, hands down, the best rooftop bar. Protected by transparent plastic sheeting, with heaters for the cool days. Lovely view all around. Small pool for those who want to show off. Only flaw is no hot coffee on the roof, so no Irish Coffee.\n", "\nThe rooftop bar is a great place for late-night drinks and dessert or a meal. Our dessert was great and the waitress was attentive. Even in January the rooftop bar was warm and busy and the views were great. We will definitely go back, hopefully in warmer weather.\n", "\nWe had a wonderful time last weekend at the Market Pavilion. It was a spur of the moment trip I decided to surprise my wife with. The reservation agent, Austin, was fantastic and was able to get us a room facing the harbor with a \"Juliette\" balcony. We loved it, stepping out in the morning for a hug and a...\n\n\nMore  \n\n\n", "\nI enjoyed a long weekend in Charleston recently with my husband and in-laws. We returned to the Market Pavilion because our first experience there four years ago was so fantastic, we knew we'd return there the next time we'd go to Charleston.\nWe stayed on the concierge level again which is just wonderful. The sense of camaraderie among guests on...\n\n\nMore  \n\n\n", "\nPlanned to stay only two nights but ended staying for four due to cancelled flights headed North. This hotel is perfectly located for everything...especially great restaurants. Blossom, Magnolia, SNOB, Amen etc etc. It was particularly perfect because the weather was bad. Staff was very accommodating, rooms comfortable and inviting, upstairs rooftop bar cozy, even in bad weather and the jazz...\n\n\nMore  \n\n\n", "\nFor out anniversary/birthday celebration we stayed at the Market Pavilion for 3 nights. The service was wonderful! We had concierge access on the 4th floor and it was worth the extra money! Hot breakfast each morning, champagne, beer or wine from 6-8 every evening. The room service was timely and the beds were very comfortable. We stayed in a corner...\n\n\nMore  \n\n\n", "\nWeekend get away with my wife. The hotel and staff are top notch! Love the continental breakfast on each floor for a lazy morning wake up. You are literally next door to the market. You can be at many restaurants within 10 minutes walking. The restaurant in the hotel is beautiful and I'm sure fantastic but was not on our...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/05/8d/f9/00/rooftop-pool--v1202401-44.jpg"}]
[{"category": "hotel", "review_count": "591", "title": "The Restoration Hotel, Charleston", "rating_string": "5.0", "address": "75 Wentworth Street, Charleston, SC 29401", "review_list": ["\nMy husband and I just got back from a 4 night stay in the newly finished Restoration. The rooms and hotel are really nice. However, the service we received was by far the worst service I have ever received at any hotel! I was actually appalled. The housekeeping does an awful job, definitely bare minimum. Never refilled the kitchenware so...\n\n\nMore  \n\n\n", "\nThis is the best hotel we have been to in years ! Heath at the front desk was so helpful and understanding .. Valerie in housekeeping went above and beyond for us as well as all the staff at this hotel. We would highly recommend ! We will return again for a visit.. Hopefully soon!\n", "\nThis year we chose to spend Christmas in Charleston as the family member living there couldn't come HOME. We have spent Spring Breaks on Kiawah Island (in a modest rental through the 2nd gate) but this visit we wanted to create our home for Christmas in the heart of Charleston. The Restoration offered a living room and a full modern...\n\n\nMore  \n\n\n", "\nThree nights of luxury and great service. Excellent view of downtown Charlestown. Get a room with period furnishings.\nThe history and ambience of King street is worth the experience.\nA magical hotel with tasteful decor and professional staff.\n", "\nGiven the price of this hotel, I hold it to a higher standard than a Hampton Inn. So, that said, the good: Excellent Location! Super friendly and helpful staff! Great restaurant that just opened! And very nice condo/suite that was comfortable and nicely furnished.\nTHAT said...here is the bad! The housekeeping is terrible, and maintenance is sorely lacking! I took...\n\n\nMore  \n\n\n", "\n6 of us visited the seventh floor bar of this newly opened hotel. The views of Charleston were wonderful! They have only been opened for app. 2 weeks yet the service was prompt. Only had some drinks and appetizers but if they were a reflection of the hotel you are in for a treat.Tamara, at front desk, was friendly and...\n\n\nMore  \n\n\n", "\nWe've been to Charleston about 8 times but first time at Restoration. We were in the original building upgraded to a one bedroom with balcony facing Wentworth Street. The third floor condo & balcony were huge & nicely furnished. They were opening the new building that week & there were a few snafu's but I would absolutely go back. Our...\n\n\nMore  \n\n\n", "\nThis was our second stay at Restoration. Both times the hotel was very accommodating and very quick to please. Each time we took a one bedroom unit. The first time we had a unit overlooking King Street which was very quiet and this time we had the Wentworth Street unit with a porch. Although the spacious porch is a nice...\n\n\nMore  \n\n\n", "\nOverall I thought The Restoration on King was a good experience. The rooms are very unique in that they are more like huge loft apartments equipped with a full kitchen, washer/dryer and everything else you can possibly imagine. Overall it was pretty clean (aside from the construction that was taking place) however there was a smell of what seemed like...\n\n\nMore  \n\n\n", "\nOur suite, 203, was everything you could want in a home away from home. The hotel retains the historic Charleston architectural details (brick inner walls, high ceilings) yet is modern in all amenities. Staff is great, location is the best, and it is the best way to enhance a visit to Charleston.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/01/79/8d/99/historic-king-st-location.jpg"}]
[{"category": "hotel", "review_count": "736", "title": "Comfort Suites West of the Ashley Hotel, Charleston", "rating_string": "4.5", "address": "2080 Savannah Hwy, Charleston, SC 29407", "review_list": ["\nThe suite we stayed in was very clean and well appointed. The staff was incredibly friendly and helpful. The breakfast included was also of very high quality and plentiful. Overall it was a fantastic hotel for the price and would definitely stay again when passing through the area\n", "\nLow price but excellent room. Service was great, breakfast was above quality. Would recommend this hotel to anyone traveling. Will stay here again if ever this way again. Nice stay before boarding for our cruise\n", "\nOur first impression from the outside was clean. Entered the lobby obtained a room for the night and was very pleased. Great bed and a quiet night. Breakfast was good and the hot foods were hot and the milk was cold.\n", "\nVery well maintained hotel; spacious rooms/suites with comfortable beds; reliable internet service also. Breakfast had several options and was restocked quite often. Manager and staff were friendly and helpful. Location is right of I526 close to mall and easy trip to downtown.\n", "\nclean room, spacious, clean bath, everything about the room+hotel was nice. would recommend it. only problem is that the username and password provided for the wifi did't work :-/ ment to tell manager about it but got sidetracked.\n", "\nWe were a group of three and stayed there for 1 night and they didn't charge for the additional person, everything was clean and new, free parking and breakfast made everything perfect for us...\nWe got a discounted rate which made it quiet reasonable for 3 people!\n", "\nWhat a great hotel! Mary Landry at the front desk was superb! She had several challenges she faced the first night we were there, but you could tell her concentration was on providing a quality hotel for her customers. The hot breakfast was a major plus for us. The beds were comfortable, rooms were spacious, and the bathrooms & towels...\n\n\nMore  \n\n\n", "\nThis is a nice Comfort Suites near Charleston. We stayed here three nights leading up to New Years. The rooms are clean and spacious. The breakfast is as expected from Comfort Inns, good.. If there could be a complaint it would the noise from the pool coming up to second floor and the breakfast area to get your food is...\n\n\nMore  \n\n\n", "\nWe stayed here visiting family on Christmas break. It was clean, quiet and had a great breakfast spread. Although it was full rooms were quiet and people were friendly. Great value for the price. Only spent the night though.\n", "\nI stayed at the Comfort Suites for attending wedding June 2014. Very busy location. The service was well done and even the other hotel guests were nice. Indoor pool that my family enjoyed. Decent, typical hotel breakfast. The room was a very spacious suite, two queen beds, with a separate living room area with a pull out sofa. The bathroom...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/01/b0/6a/5c/comfort-suites-west-of.jpg"}]
[{"category": "hotel", "review_count": "780", "title": "Holiday Inn Charleston Riverview Hotel", "rating_string": "3.5", "address": "301 Savannah Highway, U.S. Highway 17, Charleston, SC 29407", "review_list": ["\nWe have an Emotional Service Dog. This property is no pets but they were so welcoming to our dog. The front desk to the cleaning staff made us feel welcomed. The shuttle to downtown was excellent. Nice to not have to park in downtown Charleston. The average parking lot fee we saw was $12 with no in/outs. Love the view...\n\n\nMore  \n\n\n", "\nWe went there for my birthday las weekend, this hotel is close to the downtown and it is really nice, well the rooms are kinda small but the view is beautiful, staff is really friendly. And their restaurant on the top floor is wonderful; food is a little expensive but really tasty!\n", "\nWe've stayed here numerous times over the years. The grounds are not very big, but no one really stays around in the day anyways. Charleston is a beautiful, amazing city! We go as much as possible and this is always a great pick! Staff is always friendly and has given us anything we asked (upon request, not always in the...\n\n\nMore  \n\n\n", "\nDo not stay here! Unless you don't mind having roaches in your room. Me and my husband left immediately after finding two monstrous cockroaches.To make matters worse, the front desk clerk tried to down play the incident by suggesting they were palmetto bugs.... which in the very definition is called the American cockroach! Just don't even bother, I suggest staying...\n\n\nMore  \n\n\n", "\nGreat staff clean rooms restaurant /bar were awesome would stay there again. Great location for both down town and the beach. The view from the restaurant was amazing both at night and during the day. We are planning a trip there again sometime in the near future.\n", "\nSome of the best views in Charleston from the restaurant and bar on top floor. Great for lunch or cocktails. Good Holiday Inn Resort for out of towners. Plenty of parking, convenient to The Citadel, Joe Riley stadium, downtown and even a quick trip across the bridge to Mt. Pleasant isn't that far.\n", "\nCharleston was beautiful and we absolutely loved it. There was so much to do - horse and carriage rides, helicopter trips and boat rides. We will certainly be back. The hotel was very conventiently located and comfortable.\n", "\nI am writing from my room. I just came back from the rooftop restaurant where I had the worst dinner ever. My room had a combination of roach infestation and clogged bathtub drain. The bed and bathroom floor had hair all over them. I am totally disgusted with this place. The roof top restaurant offers great view, but terrible food....\n\n\nMore  \n\n\n", "\nThis hotel was a great deal for the price. Room was clean and confortable. Breakfast was very good...buffet style with good choices. The shuttle from the hotel and back runs every 2-3 hours and was a real bonus. Had a great time in charleston, a city with a very different feel and look.\n", "\nView from restaurant is great. Free parking is a plus. First visit our tub was clogged. This visit we were put into a handicap room due to unavailability. There was no way to keep the water in the shower so we were moved. Room was better but tub broken again...\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "3.0"}]
[{"category": "hotel", "review_count": "518", "title": "Holiday Inn Express Charleston Motel", "rating_string": "4.5", "address": "1943 Savannah Highway, Charleston, SC 29407", "review_list": ["\nGreat service, very helpful front office staff very willing to give local information tips, warm cookies available up front in evening, good quality breakfast buffet and very comfortable beds. Clean rooms and great cleaning crew.\n", "\nStayed here prior to a cruise out of Charleston with their \"Don't Miss the Boat\" package. They are about 15 minutes from the port, giving you a nice view and ride through downtown Charleston. The hotel is also located right off the interstate and across from a mall. The hotel and grounds are very clean and inviting. The rooms were...\n\n\nMore  \n\n\n", "\nThe room is large and well organized. There is room for all your things without having to move telephones, coffee pots, chairs and other items out of your way. The bed was a little too firm for me but it was clean and comfortable. We slept well. There was no noise or other outside distractions. The food in the cafeteria...\n\n\nMore  \n\n\n", "\nWe had an excellent stay there. The trolley line is right on the corner and it takes you to the visitors center where you can get information to do a walking tour or take the trolley. There is free breakfast and the decor is contemporary. The only thing we didn't like was the heat unit for the room. It cycles...\n\n\nMore  \n\n\n", "\nStaff is fantastic, location is very convenient, breakfast great. Would recommend & will definitely stay again. My go-to place in the area.\nThis is a very nice place to stay for a moderate price. You're 10 minutes from downtown Charleston with a very easy commute & staff is so helpful and respectful.\n", "\nStayed one night and about 6:00am. The diesal trucks parked in front roared at the front door while their drivers ate breakfast. We complained to no avail. Left never to return. If you like to sleep late stay somewhere else!!! Was clean but do not protect guest from noise-- the mgmt should have not let diesal trucks park next to...\n\n\nMore  \n\n\n", "\nThe hotel has been recently updated. Everything was clean and the staff was always very helpful. Sherry at the front desk helped us with any questions we had about the local area. Coffee and tea were available 24 hours and cookies at night. The rooms had refrigerators and a microwave.\n", "\nVery Clean, entire staff was very friendly: they get it right. Great Breakfast that even includes a cinnamon roll. WOW! Really simple route to get downtown and if you don't want to drive they also offer a shuttle to downtown. There is a commuter parking area behind the hotel lot so there's never a problem parking. Only problem is the...\n\n\nMore  \n\n\n", "\nThis is my third visit to this property and I really should remember to read my own notes. The hotel is well located, plenty of parking and on the free trolley bus route into downtown. The amenities are fine the rooms are a good size and clean. The only thing to remember is to get a room on the south...\n\n\nMore  \n\n\n", "\nEveryone of their staff members were amazing, especially the cleaning ladies who went above and beyond at helping us during our stay! Loved that our room had a microwave and a refrigerator, which was nice for storing things that I hijacked from the complimentary breakfast.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/01/5d/fb/ea/front-entrance.jpg"}]
[{"category": "hotel", "review_count": "1217", "title": "Embassy Suites by Hilton Charleston - Historic Charleston Hotel", "rating_string": "4.0", "address": "337 Meeting Street, Charleston, SC 29403", "review_list": ["\nI very much enjoyed staying at this hotel. Great location with very friendly and helpful staff. Ronaldo was very helpful from valet to bringing us towels. Alysiah is the best in the breakfast area, she was wonderful.\n", "\nWalking distance to everything! Staff was super helpful regarding restaurant information, very courteous at the cocktail hour and breakfast is the best! The room was clean and nicely appointed. Our only complaint was the refrigerator made some noise in the night and we had to close the bedroom door. will definitely return!\n", "\nI was surprised the Embassy Suites was so low rated on Trip Advisor. The hotel needs a period of maintenance, but the people working here are friendly, the location is perfect, the amenities are great, and the rooms are large. The hotel is showing its age and there are areas needing maintenance. There is construction RIGHT next door but the...\n\n\nMore  \n\n\n", "\nLocated next to the park, close to attractions, shopping, bars and restaurants the Embassy Hotel was superb.\nStaff best ever!\nBreakfast, made to order!\nHistorical!\nBirds!\nGreat happy hour!\nCan't find faults as others noted. Would come back here again.\n", "\nLate the first evening and the next morning we noticed how sticky and gross the bathroom floor was. We reported it after breakfast and nothing was done during the day, no one came into the room.. towels, etc. were in their exact position when we left and the floor not taken care of. This hotel is tired and needs remodeling,...\n\n\nMore  \n\n\n", "\nDoor to HVAC unit fell open exposing probably the dirtiest and seriously health threatning condition I ever witnessed. Unit had probably never been cleaned since it's installation posing a health risk to anyone having a health condition like asthma or something more serious. The cleanliness of the room was abysmal with stains on the bed skirt, window looking like it...\n\n\nMore  \n\n\n", "\nHotel was immaculent and staff great. Location to historic Charleston was great. Specifically came to downtown Charleston to tour historic landmarks and the hotel location made it ideal. Would highly recommend the hotel to others.\n", "\nThe front desk staff was rude to me each time that I encountered them. Upon arrival, the entrance to the hotel had just been varnished (I arrived about 3:30 pm). It was difficult to see where to check in. The staff just stood around without offering assistance. Not welcoming at all. When I found the check-in, I was greeted with...\n\n\nMore  \n\n\n", "\nDid not tell us they were re-finishing the wood floors. The toxic fumes were overwhelming in our room. Called the front desk at 1:30 am telling them we could not breathe, they said they could not move us. Went to speak to the manager the next morning and was stupefied at her attitude! I was born and raised on Long...\n\n\nMore  \n\n\n", "\nOur stay was great! We showed up late at night and needed a room. We were told that they had a deal with the hospital and to just tell them why we were there. We did that, but the room they had was already taken. The man that helped us, gave us a discount on another room and was just...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/05/8d/b5/bd/the-hotel--v945667-34.jpg"}]
[{"category": "hotel", "review_count": "697", "title": "Indigo Inn Hotel, Charleston", "rating_string": "4.5", "address": "1 Maiden Lane, Charleston, SC 29401", "review_list": ["\nFound this gem through TripAdvisor! Perfect location, great for girls weekend! We had a party of 4, two rooms with 2 queen beds each. Check-in was smooth sailing, rooms were overlooking an interior Charleston courtyard with water fountain! Easy walk to Market Street, food, carriage ride, shopping. When the weather turned rainy we were given an umbrella by the front...\n\n\nMore  \n\n\n", "\nBeen a wonderful three days at this lovely Hotel. Great, great location. Walked everywhere with wonderful restaurants all around. Wonderful breakfast in lovely courtyard. Enjoyed happy hour with cheese and crackers in the evening meeting some fellow travelers. My little puppy dog Foxy loved it as well and received special little treats upon our arrival. Would definitely stay here again...\n\n\nMore  \n\n\n", "\nWe enjoyed our stay in this very comfortable little inn. The beds and furniture were very comfortable. The only problem we encountered was on our first night. Our room was near the elevator and several noisy guests decided to have a discussion outside our room at 2 am. I am happy to say that it did not happen a second...\n\n\nMore  \n\n\n", "\nThis inn offers so much! It's conveniently located to historic downtown as well as the shopping on King Street. The staff is friendly and helpful and always professional.\nBoth breakfast and happy hour are provided daily, with hot and cold options. The housekeeping staff not only makes up your room but also turns down before bed. Rooms are clean, linens...\n\n\nMore  \n\n\n", "\nWe took a weekend visit to Charleston for my husband's birthday this past weekend. A great place to visit and a great place to stay is this Inn. We arrived early (i'm not sure of the official Check in time, but i forgot to tell the hotel what time our flight was coming in). It didnt matter as our room...\n\n\nMore  \n\n\n", "\nThe people were friendly and accomodating. The free breakfast foods delicious, and the complimentary evening cocktail party well supplied. The room was comfortable, and the location is great for touring Charleston, as it's so easy to get in and out for touring and shopping. A great place!\n", "\nTook a weekend trip to Charleston, SC for the first time on a last minute notice. The staff was very polite in assisting a young couple. The hotel was in walking distance of everything. I would say very centralized. The wine and breakfast extras were a great treat. Clean rooms and overall nice feel. I actually forgot my Ipad at...\n\n\nMore  \n\n\n", "\nA favorite choice for our stays in Charleston! Our rooms are always clean and comfortable and decorated in the Charleston \"style\". The breakfast is delicious and pleasant to enjoy in the courtyard by the fountain or in our room. The location is perfect for parking our car in the on-site lot upon arrival and not moving it until departure (yet...\n\n\nMore  \n\n\n", "\nExcellent location for walking to wonderful restaurants and shopping local market or retail stores. Room was comfortable and bed was great. Breakfast in lobby was delicious and afternoon wine and appetizers were a great way to start an evening out. Staff was friendly and responsive to requests.\n", "\nThis is a most charming hotel, located conveniently in historic Charleston. The rooms are lovely, looking out at a inner courtyard. Wine and cheese are served in the afternoon which gave the opportunity to chat with some of the other guests. I hope I can visit Charleston again just to stay at the Indigo Inn.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/01/89/f2/52/indigo-inn.jpg"}]
[{"category": "hotel", "review_count": "675", "title": "Ansonborough Inn Hotel, Charleston", "rating_string": "4.5", "address": "21 Hasell Street, Charleston, SC 29401", "review_list": ["\nUnbelievably amazing little inn! Stayed here for pre-cruise stop in January. It's located within walking distance to the port, shopping, restaurants etc. This inn is charming, romantic and super comfortable. There was always free freshly squeezed lemonade, ice water, coffee available. Fresh cookies in the afternoon, wine and snacks in the evening. Wonderful breakfast buffet, the croissants were amazing! Asked...\n\n\nMore  \n\n\n", "\nCarrie Huston is the hotel manager. She sets the tone for the whole staff which leads to a warm and wonderful experience for each guest. The inn has been modernized while retaining the charm of its original construction. There is an elevator and a parking lot; two commodities not alwsys found in this city. We were on a family trip...\n\n\nMore  \n\n\n", "\nBeautiful historic inn with rooftop terrace. Great get away. There celebrating our engagement and fiancé. Once we got there, we never moved our car until we checked out. Highly recommend. Charleston is a beautiful\n", "\nLocated right on the edge of downtown Charleston. Easy, safe and fascinating walks to most of the major restaurants, theaters and museums. And if you get tired of walking, the free local trolley stops every 10 or 15 minutes within a block or two of the hotel. Hotel is apparently a converted mill of some kind with exposed beams and...\n\n\nMore  \n\n\n", "\nThe Ansonborough is very conveniently located just a few blocks north of Market St. The decor is warm and welcoming. My room was surprisingly large, well appointed and had a view of the harbor. It's a nice place and I'd recommend it. However, I could hear every single noise outside and in the hall and that impacted getting a good...\n\n\nMore  \n\n\n", "\nThe rooms were large, well-appointed. The staff was fantastic - friendly and very efficient. Yummy breakfast included. Parking was free, right across from the Inn. I would definitely stay there again.\n", "\nWe stayed here in October and it was very nice. It is on the dark side, I prefer more light in the room, bath and interior courtyard. We had a suite on an upper floor with s short flight of stairs in a narrow hallway to the main room. There was a small kitchen area, table and a sofa bed....\n\n\nMore  \n\n\n", "\nPros: very convenient location next to 24 hour grocery store, nice renovated rooms with large beds and friendly knowledgable staff, amazing interior and decor, checked in our luggage with front desk to explore after check out. Breakfast is standard continental.\nCons: the Inn charged the incorrect credit card after booking accommodation online, they charged the credit card given for incidentals...\n\n\nMore  \n\n\n", "\nFor our honeymoon, I wanted to surprise my wife with a visit to someplace charming, cozy, friendly, and a little indulgent. After reading the reviews and seeing the photos online, I chose the Ansonborough Inn. We absolutely loved it! Our room was on the third floor, it had red brick walls, high ceilings with beautiful wood beams, ornate chandeliers, and...\n\n\nMore  \n\n\n", "\nWe followed the trip advisor map and reviews to this lovely inn for a last minute stay. This inn is beautiful. It is historic and unique, comfortable and friendly. Complimentary breakfast and nightly wine and cheese only adds to the value.\nEspecially friendly service. Special thanks to Daniel and Jason who offered great insight on local info and got us...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/07/7b/a9/e4/exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "676", "title": "Wentworth Mansion Hotel, Charleston", "rating_string": "5.0", "address": "149 Wentworth St., Charleston, SC 29401", "review_list": ["\nWe stayed at WM for 4 nights and enjoyed every minute of our visit. From the king mansion room, superb breakfasts, complimentary drinks and hors d'oeuvres, the wonderful staff - Trevon, Elliot, Stephanie (and other helpful ladies at reception) - everything was excellent.\n(A special mention for the particular staff member who called us while we were out, to mention...\n\n\nMore  \n\n\n", "\nLike many Oscar winners, the set was beautiful, the supporting cast was exemplary and the experience delivered, unparalleled. We left on our long weekend wanting an \"Old Charleston\" setting in which to enjoy a luxurious and romantic get away. The Wentworth delivered on all levels.\nFrom the moment I called with a special room request the staff could not be...\n\n\nMore  \n\n\n", "\nWe stayed one glorious night. The hotel staff was very welcoming and helped show us our way around the mansion as well as suggesting local eateries. Stefanie was quickly able to accommodate us with last minute dinner and spa reservations. Pamela not only turned down our beds, but closed all the blinds, laid out robes, and left candy. The facials...\n\n\nMore  \n\n\n", "\nI stayed here this past week and truly was blown away by the entire experience - the Inn is on a \"compound\" where there is a spa and restaurant and then the mansion which has been restored to original details but offers all the modern luxuries - reliable fast wifi - big bathrooms with separate tub/big shower for two -...\n\n\nMore  \n\n\n", "\nMy wife and I stayed three nights at the Wentworth Mansion (room #15) and fully support its lofty TA rating.\nOur room was very comfortable. Old world charm with new world luxury (modern Jacuzzi, USB outlets for charging etc.). The high ceilings and decorative quality is every bit what the online photo’s tell you.\nThe service is welcoming, accommodating and...\n\n\nMore  \n\n\n", "\nMy husband researched where we should spend the one night we would be in Charleston which coincided with my birthday and the unanimous feedback was the Wentworth Mansion. We loved our stay, our room #21, the complimentary soft drinks and water in the room refrigerator, complimentary full breakfast at its Circa 1886 Restaurant, complimentary coffee and breakfast rolls in the...\n\n\nMore  \n\n\n", "\nThe mansion is beautiful. All the rooms are spacious, with all the amenities. The staff is always available to help. Was just a relaxing few days being taken care of. We also ate at their restaurant Circa 1886 and I had a signature facial at the spa. Both were also wonderful experiences. Would definitely reccommend.\n", "\nWe stayed here in December for a little couples getaway! The mansion is gorgeous and was decorated beautifully for Christmas. My only complaint was that location wise it didn't really feel close to either of the areas we spent a lot of time in. The East Bay Area was about a 15-20 min walk which at night was a little...\n\n\nMore  \n\n\n", "\nThe pictures do not do the rooms justice. The location is also perfect in the sense you are close enough to walk to the shops and restaurants on King St but far enough away that you have some quiet and great views from the Cupola of all the downtown areas. The service was on point and the onsite dining at...\n\n\nMore  \n\n\n", "\nAbsolutely gorgeous hotel with a tremendous staff. If you like staying in a pristine mansion with tons of historic character with lots of pampering this is the place for you. The architecture and the renovation is just awesome and the rooms are huge.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/ac/3e/7d/filename-wentworth-mansion.jpg"}]
[{"category": "hotel", "review_count": "545", "title": "Holiday Inn Express Charleston Downtown - Ashley River Hotel", "rating_string": "4.0", "address": "250 Spring Street, Lockwood Drive, Charleston, SC 29403-5123", "review_list": ["\nGreat Hotel to stay at in Charleston. No it is not walking distance to downtown, and is not super fancy like some of the other places you can stay, but it is also a fraction of the price. The breakfast was pretty solid. They had hot bacon, sausage, and eggs along with a pancake maker and all the other stuff...\n\n\nMore  \n\n\n", "\nThe hotel is located just OUTSIDE the historic downtown, at the intersection of highways. Easy to get to, but not walkable from anywhere. Beware, or they may fob you off with a rear room with ventilator view. The hotel does permit pets, and is a good value.\n", "\nA great hotel. The staff was very helpful, friendly. We were able to make sightseeing tour arrangements at the hotel and the staff was very good with providing recommendations. Very close to downtown, plantations,citadel.\nA great trip. Thank you\n", "\nWe booked this place because they take dogs....which they do! But, apparently rooms which allow pets have terrible views.\nTo start, getting here via gps was terrible....in the future I would call for directions.\nThe main area and parking areas are quite nice....our reservation was confirmed we had no problem getting to the room.\nThe room was clean and well...\n\n\nMore  \n\n\n", "\nI can not say enough about the front desk staff . So nice and acomadating. She went over and beyond her job . That's what I call customer service. Company's need more people working for them like her. A Big raise is in order for the whole team . The Bed .. OMG !! I want one . The house...\n\n\nMore  \n\n\n", "\nHotel is a little dated, but is in decent repair. Not enough lighting in guest room & no \"easy\" chair. Not much vanity space in bathroom. The hotel is in the landing flight path of the airport, but was not too disruptive. Room price was reasonable.\nOur first visit to Charleston & only overnight. We arrived during the 5 pm...\n\n\nMore  \n\n\n", "\nWe stayed 2 nights here with our dog. We stayed on the first floor by the outdoor pool- which was closed for the season, bummer. Our room was a little stuffy and humid ( it was 78 degrees that day) when we walked in and had a funny smell- d/t the humidity- but we turned the A/C down and that...\n\n\nMore  \n\n\n", "\nWhile the location of this hotel is not what we thought it would be, it is an easy and free bus ride to the visitor center and beyond. The rooms at this Holiday Inn were spacious, the beds very comfortable, and staff were extremely friendly and helpful. They do know and practice good customer relations! The complimentary breakfast was one...\n\n\nMore  \n\n\n", "\nWe were disappointed in this hotel.\nCons: It is not downtown...you have to drive there. Rooms are tiny & very basic. If you have a dog, you have to stay on the second floor. Rooms need updating. Neighborhood mediocre at best.\nPros:\nRoom & bathroom very clean. No dog smell even tho we were on the dog-friendly floor.\nStaff very...\n\n\nMore  \n\n\n", "\nThe address of this establishment says, \"Downtown.\" It is not downtown. While the room was very nice, beds comfortable; overall I was disappointed in this establishment. I had to go down to the front desk on my first morning and get coffee because the coffee maker in the room DID NOT have a basket for placing the coffee pod. The...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/03/bc/42/39/holiday-inn-express-charleston.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1286", "title": "Courtyard by Marriott Charleston Historic District Motel", "rating_string": "4.5", "address": "125 Calhoun St, Charleston, SC 29401", "review_list": ["\nYou can't find a better location in Charleston. This is a comfortable hotel right in the historic section, lots of sights and restaurants nearby.\nWe got - from the Charleston visitor center, only two blocks away - a self-paced walking guide to Charleston and it was great for us. There are three different routes, all starting right around the hotel....\n\n\nMore  \n\n\n", "\nVery nice hotel that is perfectly situated between the heart of the historic district and shopping/restaurants on Upper King Street. The front desk and Bell service personnel are focused on making you feel welcome from the minute you arrive. What makes this place a complete standout is their amazing Concierge, Kevin McQuade. There aren't enough stars to give him for...\n\n\nMore  \n\n\n", "\nHotel room was an average courtyard room, but what gives this hotel a 5 is Kevin, the concierge! We booked this room because of his reviews and it was SO worth it. He spent time with us on the phone prior to coming as well as when we got there. He truly is passionate about what he does and it...\n\n\nMore  \n\n\n", "\nWe thought it was great that we were able to stay in the historic district but we didn't get too much sleep. We were at the front of the motel and was kept awake from people walking around outside at all hours of the night talking loudly and yelling. There was a garbage container to the side of our room...\n\n\nMore  \n\n\n", "\nThis hotel does not have all of the character of the historic district, but I can argue that it is a great choice. I have stayed here twice.\nThe location is very good. You can easily walk the historic district from here. The parking is good (for Charleston ). I was charged $18 per night. I felt safe here and...\n\n\nMore  \n\n\n", "\nThe hotel was nice and very centrally located - perfect for walking to all the historic areas -- but the real gem here was the free concierge services. Their concierge, Kevin, was awesome - in addition to lots of great sightseeing/activity tips, he gave us a walking map of Charleston with all the best hidden spots in the city and...\n\n\nMore  \n\n\n", "\nWe were leaving on a New Year's cruise from Charleston and I chose this hotel because it was close to the port. It wound up being closer than I expected! When we checked out, there was a taxi waiting outside and we were at the port in less than 5 minutes. Staff was very friendly and helpful and they were...\n\n\nMore  \n\n\n", "\nWe went to Charleston on a last minute decision for my husband's 50th birthday. The staff from check in to the cafe were always looking for ways to make our stay exceptionsal. The location of the hotel was perfect. Not too far from great restaurants and great shopping. Would definitely stay here again.\n", "\nStayed here a couple of nights while on an escorted Tour. Room was clean but had some strange markings on the wall beneath the air conditioner ( like a lot of fluit had run out of it). Bathroom had a great shower, witch gave lesser place for the toilet.\nPeople at the check in where friendly. I made my arrangements...\n\n\nMore  \n\n\n", "\nThe concierges, Kevin and Andrea, turned this hotel from good to excellent. Whether it was recommendations about restaurants, walking tours, hidden treasures, etc., every suggestion was spot on. Thanks, you two made our stay in Charleston memorable.\nSteve and Anita\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/0a/3a/fe/35/exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1235", "title": "Andrew Pinckney Inn Hotel, Charleston", "rating_string": "4.5", "address": "40 Pinckney St, Charleston, SC 29401", "review_list": ["\nWe've stayed many times at this lovely Inn. The location is perfect for everything to see and do in Charleston. Breakfast on the terrace is so relaxing and the best way to start your day in the city. Wine and cheese in the early evening kicks off your night\n", "\nI reserved 19 rooms in this hotel for my group. Everyone loved it! The continental breakfast was delicious. Our meeting was held in the sister hotel, The French Quarter Inn, which is beautiful. There is a wine and cheese reception in both hotels every afternoon. The hotel is in a great location, you can walk everywhere.\n", "\nYou won't do better than the Andrew Pinckney Inn! Great customer service, southern charm, updated rooms, best ever continental breakfast, and amazing wine reception! Location is prime and you can walk to nearby restaurants and Charleston historical sites!\n", "\nThe Pinckney Inn is the place to stay in Charleston, SC. Conveniently located next to the Market and best restaurants, the walks are easy. The service is efficient and the overall operation is well run. All of the staff is helpful. We thoroughly enjoyed our three day weekend there and the price is very reasonable for an anniversary or birthday...\n\n\nMore  \n\n\n", "\nMy experience with Andrew Pinckney Inn from booking to check out was wonderful! I only stayed for one night, but I absolutely will go back and hopefully for a longer stay!! I loved that I could use the Valet Service even after I checked out...basically you can leave your car with them until you are done exploring downtown Charleston. They...\n\n\nMore  \n\n\n", "\nWe always love staying at the Pinckney Inn, love the rooftop breakfast and afternoon drinks. The valet staff is awesome. We had a street side room that was loud, and they moved us to a much more quiet space...excellent service.\n", "\nA small hotel centrally located, most attractions within easy walking distance. Our room was on the corner and there was some early morning noise from a nearby restaurant but nothing to cause a problem. The room was well furnished, the bed was comfortable and the bathroom had everything we needed. Breakfast was served each morning on the balcony area, biscuits...\n\n\nMore  \n\n\n", "\nWe stayed at the API for two nights, and it was quite cozy and pleasant inside. The people in the office greeted us and welcomed us back (we have stayed here several times), and they took care of our car and luggage while we went to lunch. When we returned, everything we needed was in our room and neatly stowed...\n\n\nMore  \n\n\n", "\nOverall we enjoyed the character of the hotel and the staff was very friendly. However, we stayed in the St. Phillip Suite, directly above the lobby and right on the street, It was extremely loud and so we didn't get much sleep during our stay. We also had to check out very early in the morning and asked twice that...\n\n\nMore  \n\n\n", "\nOur stay was wonderful. We especially enjoyed the 4th floor outdoor patio! The service was excellent. It is located within walking distance of almost everything. I will be back and I highly recommend it to all!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/05/ad/80/29/andrew-pinckney-inn.jpg"}]
[{"category": "hotel", "review_count": "1117", "title": "Planters Inn Hotel, Charleston", "rating_string": "4.5", "address": "112 North Market Street, Charleston, SC 29401", "review_list": ["\nThe restaurant is very good, but the service .... They don't have a mini bar in the room and room service as well. The room is goos, clean, and the bathroom has all you need. Bur the mattress is too soft!!\n", "\nExcellent service. They upgraded us upon arrive. Allow for early check in. Provided umbrellas. Provided directions and ideas on best places to visit. Well appointed rooms. Great food. Love the bar. Perfect location. Highly recommended. We will be back.\n", "\nWe have visited Charleston many times but this was our first stay at the Planters Inn. Our room on the fourth floor was very spacious, clean and comfortable! There is a bit of street noise and Monday morning brought the garbage trucks but there is nothing to be done about that. The Peninsula Grill is fabulous but if you plan...\n\n\nMore  \n\n\n", "\nI've stayed at very nice hotels around the world from The Ritz to The Grand Hyatt...I prefer the smaller venue and attention to detail that Planters Inn offers! I've found the bigger chains claim to be first class but are too big to really show it...From knowing and calling you by your last name the entire time you are there...\n\n\nMore  \n\n\n", "\nThe staff in all areas were excellent. Breakfast a bit expensive but service was excellent. We were on front and a good bit of late traffic noise but that is not the hotels fault. Valet and front desk went out of their way to help us.\n", "\nBellman unavailable - be prepared to handle your bags upon arrival.\nIf your towels are soiled when you depart for dinner, they will be there when you return.\nIf you leave the TP canister open showing no TP expect to remind staff they should leave a roll.\nIf you have a car and the keys cannot be found for 3...\n\n\nMore  \n\n\n", "\nIdeal for location and food. Quiet rooms and lovely comfortable appointments. Valet parking is easy. Short walk to all the best sights and shopping. Central to the historic sights in Charleston and tour facilities like the carriage rides. They are a great way to learn the history of the area. Enjoy!\n", "\nCharming hotel part of the Relais & Chateau chain. Located right at the Market, with one of the best restaurants in town next to it. Large rooms, comfortable beds, Victorian style, attentive service. Free wifi (a must), but unfortunately no gym\n", "\nWonderful hotel with exceptional service\nfantastic staff\nBeautiful rooms\nreally comfortable beds\nand great location\nThe restaurant is wonderful and has a great champagne bar\nwe will definitely be back\n", "\nLocation is great and such a walkable city. Beds were cozy and comfy. Wonderful to wake up to coffee in the sitting room, watching Charleston wake up. The inn was lovely and the epitome of Charleston. Would stay here again.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/9d/c0/1a/planters-inn.jpg"}]
[{"category": "hotel", "review_count": "628", "title": "Courtyard by Marriott Charleston Waterfront Hotel", "rating_string": "4.0", "address": "35 Lockwood Dr, Charleston, SC 29401", "review_list": ["\nMike, the van driver was superb!! He was willing to take and pick us up all evening as we went to dinner, clubs, etc. He has a great attitude and should be rewarded for being a great employee! Also the property was very well maintained and the front desk staff was excellent!\n", "\nEverything about our stay here was terrific. The room was nice. The hotel has a beautiful waterfront setting.. But the most impressive part of our stay here was the staff. We were checked in by Rachel who could not have been any nicer! She had such a pleasant personality and always gave us service with a smile. Also need to...\n\n\nMore  \n\n\n", "\nMy wife and I stayed here for 1 night on the way back from Miami to New York.\nWe got a room with a \"city view\" and when a got to the room it was overlooking the highway and a few buildings, no view in sight. For the money it was a rip, not in the historic Charleston as stated...\n\n\nMore  \n\n\n", "\nThis hotel is in good shape, in spite of what some reviewers have said. The staff at the front desk were very helpful.\nThe parking lot is a covered area under the hotel, with easy access to central Charleston, and to I-26 and Rte 17.\nA room with a view of the Ashley River and the marina is nice if...\n\n\nMore  \n\n\n", "\nChecked in, saw room, checked out. Did not stay the night. There are terrible reading lights in the bedroom, and there were NO lamps in the living room (we had a suite). Also, the hotel is an unpleasant mile walk from downtown Charleston, where everything is. The staff was wonderfully helpful and booked us in another Courtyard in downtown Charleston.\n", "\nStayed in 426. At 8 AM was ruddley awakened both mornings by what I learned was a ventilator fan issue, a rumble that even burying my head in pillows could not diminish. Otherwise our stay in this aging beauty was unremarkable except for the first rate kindness of our standin shuttle drivers Mark and Eddy.\nRecommend caution when looking for...\n\n\nMore  \n\n\n", "\nI couldn't have asked for a better sleeping experience than this one! The beds were very comfortable, plenty of pillows provided prior to our arrival and the room's amenities met our needs during our entire stay...right down to bottles of water delivered daily. We always had fresh linens and towels when we returned to our room.\nThe bartenders were wonderful...\n\n\nMore  \n\n\n", "\nDon't be fooled by the other reviews. The staff was friendly...but this hotel is old, damp, dated and smelly. We upgraded to a corner room with a balcony which came with a big price tag. Feeling ripped off. The room layout is strange with doors opening into each other and a tiny little bathroom with the vanity in a separate...\n\n\nMore  \n\n\n", "\nEnjoyed our evening. Great bed and pillows, slept like a baby. High ceilings in the rooms. Everyone on the staff, greeted us with a smile, and a pleasant greeting. How refreshing. One of the best omlettes for breakfast I have had in a long time. When our car wouldn't start, the GM brought their van around to boost our car....\n\n\nMore  \n\n\n", "\nThis entire hotel is old, it smells damp and musty. See photos below. The cornice boards were falling off the wall in room 346. When we first arrived our view was the air conditioning system. They switched us to another room (the one with the mold). The sink area is very narrow and barely room enough for one person to...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/0a/39/32/80/exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "385", "title": "Hilton Garden Inn Charleston Waterfront/Downtown Hotel", "rating_string": "4.0", "address": "45 Lockwood Drive, Charleston, SC 29401", "review_list": ["\nBeing the first time I have utilized a Hilton Hotel, I found that it was a great place to stay. The staff was very friendly and helpful and it really meant a lot for them to meet my accomodations. I felt that being my first stay, it was a welcoming and great experience.\n", "\nStayed at the Hilton Garden Inn for a wedding. You can tell that the hotel is new, because it's stunning! The smell when you walk into the lobby makes you feel like you're walking into an expensive spa. The staff is also outstanding. Katy took good care of us at the bar, and we loved the shuttle service from Larry...\n\n\nMore  \n\n\n", "\nWe stayed at this property in August of 2015 for 3 nights in celebration of our anniversary, and selected this location primarily because it offered a balcony with a view of the water.\nWe are Hilton Loyalty members, have stayed at many Hilton Gardens, and must say the property, other than this feature, was a big disappointment.\nThe entire hotel...\n\n\nMore  \n\n\n", "\nFigured we'd take a drive to Charleston and enjoy some good sights and food for our anniversary. We landed at the Hilton Garden. The staff were friendly. Get a room with a marina view. It's beatifiul. The hotel is very sheik, modern, and clean. Parking is free and covered! Only 5 mins from downtown. My only complaint were mattresses. I...\n\n\nMore  \n\n\n", "\nStayed at the Garden Inn Waterfront to meet with a client. Very nice hotel and friendly staff. The breakfast was good and it is a good place to meet with business associates. Overall, a very solid hotel in a good location.\n", "\nWe've visited Charleston many times in the past. This is the first time we chose this particular hotel. Really great place to stay. The location, the staff, clean rooms, everything is great. We plan to stay at this hotel on our next trip to Charleston.\n", "\nI checked in on 1/29/16 for a one night stay and ate at their restaurant. I ordered the salmon and it was outstanding! What was more outstanding was my server Kady W (109). She provided excellent service and professionally dealt with a situation of partying, annoying guests that tried to bring in their own alcohol by dragging a cooler into...\n\n\nMore  \n\n\n", "\nWe stayed on our first visit to Charleston for a birthday getaway.\nWe arrived late in the evening and the layout of the hotel was awkward, ended up getting lost because though I had a keycard and got our room number, when I got to the 4th floor our room could only be accessed from a different location.\nThe rooms...\n\n\nMore  \n\n\n", "\nThis is a nice property with modern finishes. It has a weird layout, but there are multiple entry points for guests from the parking area. The rooms are well appointed. I had a room with a partial view of the marina and the highway, but it made for some nice sunrises. It's very close to the Citadel and a few...\n\n\nMore  \n\n\n", "\nUsed Hilton points for this. Not disappointed despite it being a little out of the way from the center of town. Lovely waterfront setting. Trendy interior which was kept clean and tidy. Staff very friendly and helpful. Food and bar good. They provide an hourly free shuttle to DT. We Ubered often as we missed the shuttle times.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/3e/68/49/downtown.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "328", "title": "Zero George Street Hotel, Charleston", "rating_string": "5.0", "address": "0 George Street, Charleston, SC 29401", "review_list": ["\nI have never felt compelled to write a review before, but Zero George is so special that I had to shout it out. If you're going to Charleston this hotel is a must! It oozes cozy and superb at every turn. The rooms are insanely beyond comfortable, the service is outstanding and uber accommodating, it's gorgeous down to every detail...\n\n\nMore  \n\n\n", "\nI can think of no better way to take in the charm, history, and hospitality of Charleston, SC than to stay and/or dine at Zero George. I happened to be on a business trip which made the warmth and intimacy of the setting all the nicer. The staff treated me like an old friend, and were attentive to every detail...\n\n\nMore  \n\n\n", "\nBeautifully newly refurbished historical buildings around a central courtyard; feels small, cozy, boutiquey. Unusual in that there is an open kitchen is on your left when walk in to the front desk, which offers excellent gourmet dinners as well as cooking lessons. Free bike rentals. European style breakfast included (homemade granola, quiche, muffins, etc), free wine and cheese 5-7pm that...\n\n\nMore  \n\n\n", "\nI have never before stayed at a hotel that so seamlessly integrates with the city around it, and I say that with a very high opinion of Charleston. Charleston is the greatest example I have seen in the US of the cohesion you see in many great European cities. Nothing seems out of place, and Charleston is anchored by it's...\n\n\nMore  \n\n\n", "\nAn excellent experience at every turn. Although a small property they were well staffed at all times. Valet parking worked well. The complimentary breakfast provided many delicious choices and the afternoon wine and cheese a pleasant interlude before dinner. Our room didn't miss a detail. The bed was wonderful and amenities included everything from robes and slippers to nightly bedside...\n\n\nMore  \n\n\n", "\nThis property is the ideal place to stay in Charleston. Not on the \"main drag\" but close enough. The buildings are authentic, beautifully restored and maintained, and the amenities are first class as well. The staff is charming, knowledgeable and well trained. The bar is quaint and intimate. Now for the important part--the restaurant. OUTSTANDING. Not easy to seem fabulous...\n\n\nMore  \n\n\n", "\nWe were upgraded to a lovely garden level room that exceeded our expectations. From the moment we arrived we were treated with great consideration and care. The room was spacious and beautifully furnished. We loved the daily wine and cheese from 5-6 as well as the breakfast. All the historic sites of Charleston are within easy walking distance of this...\n\n\nMore  \n\n\n", "\nI joined my parents at this hotel for a 3-day family trip to Charleston. We had read great things about this hotel and it exceeded the hype. The staff oozed southern charm and the accommodations were luxurious with classic southern style. Our rooms included sumptuous Frette sheets, complimentary minibar, and a steaming hot shower with wonderful bath products. We enjoyed...\n\n\nMore  \n\n\n", "\nI don't think I could imagine a better place to stay in Charleston. The historic building maintain the sense of the city's history, but are updated to 21st century luxury. Marvelous beds and bathrooms. The rooms have spacious layout that never feels cramped. The public areas--garden, piazzas and verandas are perfectly suited to quiet relaxation. The front-desk staff was always...\n\n\nMore  \n\n\n", "\nWe stayed at Zero George during our first trip to Charleston, SC for three nights. It is a very beautiful, charming small hotel with nods to the historic feel of Charleston. The location is excellent as it is just a short stroll along past gorgeous homes and mansions into the main town centre. The breakfasts each morning were lovely with...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/af/75/c9/zero-george.jpg"}]
[{"category": "hotel", "review_count": "464", "title": "SpringHill Suites Charleston Downtown/Riverview Hotel", "rating_string": "4.0", "address": "98 Ripley Point Drive, Charleston, SC 29407", "review_list": ["\nWe were fortunate to stay here for several nights. Checking in without a prior reservation was fortunately not a problem. The desk clerk was friendly and helpful and with a room on the fourth floor complete with balcony and wonderful view of the marshes, river and bridge and boats, it was very relaxing. The room and beds were very clean....\n\n\nMore  \n\n\n", "\nStayed here 1 night on a trip back home because I thought it would allow me the chance to be in Charleston proper. It is on the outskirts and they offer an hourly shuttle downtown, which does eliminate some of the travel problem. The staff was very nice and the breakfast was OK.\nI would recommend if you are not...\n\n\nMore  \n\n\n", "\nPulled into Charleston about half past 6. Easy to find, nice check in, wow, great room. Very clean and spacious. The TVs were high def, something that you do not get every where. Nice marina, though I should have taken the shuttle to down town, instead of the rest/bar at the end of the marina.\n", "\nThe rooms were very clean and spacious. I was here with my friends for a girls getaway. Having a small kitchen area was nice. The staff was very supportive and knowledgeable. Breakfast was good but the person restocking could use more help. They had a little trouble keeping coffee and food filled. I'll definitely return.\n", "\nI have been to several Marriott hotels but the staff here, specifically Jacquelin and Joe at the front desk was superior to any other stay. They are the best! Our flight arrived early and they were able to accommodate us. They even had a welcome gift ready for us. No complaints at all about the staff, room, location, or shuttle....\n\n\nMore  \n\n\n", "\nThis was a great hotel just a mile or two outside of downtown Charleston. Hotel had ample parking and some limited covered parking. Registration is one the 2nd floor, you can either take the stairs or take the elevator. First floor is well decorated and they have a business center on the first floor.\nWe were greeted at the registration...\n\n\nMore  \n\n\n", "\nWe were glad we picked this hotel for Charleston. It was not located in historic downtown but provided a free shuttle service to historic downtown from about 5 in the evening until around 11 at night. This was one of the main reasons we stayed here. Fantastic hot breakfast!\n", "\nJacqueline & Brian at the front desk could not be more helpful. They have printed up directions to the various islands (to and from the hotel). The hotel has a free shuttle to the historic district of Charleston. The hotel has different activities such as wine tasting, beer tasting, etc. Our room was large and the bed was very comfortable.\n", "\nStayed here for several days during Christmas week. Room was nice, breakfast adequate and front desk staff was helpful and professional. I left a couple of items in the room (left very early in the morning), called the hotel, and rec'd the items in the mail less than a week later. Kudos to Jacqueline and her staff!\n", "\nWe stayed here the night before leaving on a cruise from the Charleston port which was less than 10 minutes away. There are 5 of us including 3 children 18 and older. We're used to being cramped, particularly in $300+ big city hotels. Our suite appeared much bigger than the picture indicated, with two double beds in one room and...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/46/8f/e5/riverview.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "494", "title": "Holiday Inn Charleston Historic Downtown Hotel", "rating_string": "4.5", "address": "425 Meeting Street, Charleston, SC 29403", "review_list": ["\nThe hotel is right at downtown Charleston and within walking distance of King Street. The city of Charleston has a free downtown trolley service and there's a stop in front of the hotel. Our room was quiet and clean. They were doing construction right outside our window but it wasn't loud (we brought a fan to block out noise). We...\n\n\nMore  \n\n\n", "\nThe staff is awesome, friendly and helpful. The property is located on the edge of the Historic District. Wonderful place to begin an adventure and head deep into the shopping, galleries and delicious restaurants and spirits. The rooms are large, spacious with a refrigerator and coffee maker. The price is considerably less than properties deep within the historic district. We...\n\n\nMore  \n\n\n", "\nVery friendly staff! Valet John was especially helpful! The hotel is new and very clean. Rooms are nice and spacious. We traveled with an infant and there was plenty of room to set up his pack and play to sleep in!\n", "\nUpon the recommendation of colleagues we decided to stay here for the Charleston marathon weekend. The hotel is in midtown so it's just outside the really fancy part of downtown Charleston. Everything you could want to do is within easy reach without a high price tag. The hotel itself is clean and modern. Nothing fancy but a great way to...\n\n\nMore  \n\n\n", "\nThis hotel is on the corner of Meeting Street and Wolfe Street at one end of the FREE tourist trolley line. This location is extremely convenient whether you want to walk or catch a ride to all of the tourist locations in Historic Charleston.\nWe typically walked to our destination (including the Fort Sumter boat dock) in a leisurely 15...\n\n\nMore  \n\n\n", "\nHotel is very upscale and nice. Room was clean and comfortable however no microwave. All staff were very friendly and helpful with visitor information. Dining area was also very nice. Parking is by valet only and a little expensive. Hotel is located within an easy walking distance from King street were all of the shopping is. Only con is no...\n\n\nMore  \n\n\n", "\nThe modern 5-story Holiday Inn Charleston Historic Downtown on Meeting St/corner Wolfe St is conveniently located on the northern end of the Museums Mile, near the Visitor Center complex, Marion Square Park and the Charleston Museum. The location is still in walking distance of the historic district and many other cultural and sightseeing venues. King St with its variety of...\n\n\nMore  \n\n\n", "\nNice, newer hotel just a few blocks from the historic section of Charleston, and one block over from King St, where all the retaurants, pubs, and trendy shops are.\nIt was the place I wanted to spend 2 relaxing days with my wife in/near historic Charleston.\nSomewhat difficult to find until you're on top of it due to the signage...\n\n\nMore  \n\n\n", "\nI wanted to stay somewhere close to downtown so we could walk and enjoy our stay. Although that proved to be good, the very first morning we awoke to a loud pounding...literally a pile driver...next door at the construction site. The construction was just at the foundation stage, so my assumption is that the construction sounds will continue for sometime....\n\n\nMore  \n\n\n", "\nWe had the Corner Suite on the 5th floor and the room was awesome. Lots of space and well appointed. Had a great view of the sunrise out over the harbor. The location is exactly perfect but not far from attractions. As with just about any place in Charleston, parking is an issue but the valet service was great.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/e9/31/13/hotel-exterior.jpg"}]
[{"category": "hotel", "review_count": "904", "title": "Inn at Middleton Place Hotel, Charleston", "rating_string": "4.5", "address": "4290 Ashley River Road, Charleston, SC 29414", "review_list": ["\nRealy enjoyed our two days there. Weather was excellent. Short walk from the Innn to the. plantation. Mayflowers were in. Bloom even. Through it was the very beginning of February.\nTours on plantation were wonderful. Thankthevoluteers.\n", "\nHere for our honeymoon & were treated like royalty! Middleton Place Admission included - must see! The staff was warm & helpful & couldn't do enough for us. Tranquil - beautiful grounds. Great Historical value.\n", "\nThis is the perfect place to unwind, relax, and enjoy the beauty of the South Carolina Lowcountry. The grounds are gorgeous- we loved walking, exploring, and even lounging on a blanket playing backgammon by the Ashley River. The rooms are clean-love the hardwood floors- and the fireplace was so romantic. The floor to ceiling windows were made for appreciating the...\n\n\nMore  \n\n\n", "\nWe enjoyed out stay at Middleton. Just wish there had been a microwave in the room to warm up some leftovers from dinner. Breakfast at the lake house was very good. Fireplace in the room is great, however our wood was damp and didnt burn very well. Other than that, it was a great stay and enjoyable evening.\n", "\nThe Inn is reminiscent of a Dutch style modern building. Many floor to ceiling windows that are shuttered. The outside of the windows could have used some cleaning as could the floor inside immediately around the windows. The room shows a bit of age, but is still very nice. We had a king riverside room with a fireplace (wood provided)....\n\n\nMore  \n\n\n", "\nWhen you pull into the property you begin to enter another world. The Inn itself is modern yet inviting. Our room was very comfortable and spacious and the grounds are landscaped very elegantly. We had a free pass to go tour the plantation and took advantage early in the morning before it got too hot. The plantation is utter opulence....\n\n\nMore  \n\n\n", "\nWe really enjoyed our night here. The room was comfortable and the staff was friendly. Also, getting access to the grounds included in your room rate is a huge plus. We toured the house, walked the gardens, and visited the farm/handicraft workers. The complementary management reception from 5pm-7pm is very nice (some appetizers--basically cheese and crackers and fruit and a...\n\n\nMore  \n\n\n", "\nThis is the place a parent needs when they need the quiet to be real. As a parent of three children, ranging from 6 months old to six years old, I cannot begin to explain how beautiful it was. To run in that garden at 7 am; to go to bed and have the room completely silent the whole night...\n\n\nMore  \n\n\n", "\nThis contemporary styled inn on the banks of the Ashley River is a fun destination. Our grand river view room was very large and the natural wood shutters are beautiful. The inn is located next to Middleton Place Plantation and you get tickets for the house tour and gardens which is a nice touch. We really enjoyed the wine and...\n\n\nMore  \n\n\n", "\nBeautiful, rustic inn completely focused on nature. Fireplace in room with view of the Ashley river was just gorgeous. Employees were welcoming and couldn't do enough for you to make you comfortable and relaxed. Room charge included evening reception, continental breakfast and access to the middleton plantation which was excellent as well.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/4e/0f/e6/inn-at-middleton-place.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "828", "title": "Renaissance Charleston Historic District Hotel", "rating_string": "4.0", "address": "68 Wentworth St, Charleston, SC 29401", "review_list": ["\nThe hotel common areas are very nice as are the rooms. Well appointed, very comfortable bedding. Large lobby area. Plenty of staff around to assist if you need it. You can valet park or self park across the street. My only real dislike was the horrible carpeting in the hallways - the color was hideous.\n", "\nBusiness trip. Service was excellent. Seamless check in and check out. Beautiful lobby. Great Valet Parking. Provided bicycles, umbrellas, etc. Beautiful lobby, nice bar. Room was clean, updated, climate controls excellent. Bathroom, excellent.\n", "\nI have never said this before about the brands but the Courtyard in Charleston looks like it's better than this Renaissance. That's where I'll book the next time I'm in town. This is an old hotel and it shows. I found the staff to be underwhelming as well and for someone who spends about 100 nights per year in just...\n\n\nMore  \n\n\n", "\nWe stayed at the Renaissance Charleston Historic District Hotel and thoroughly enjoyed it. Our room was well appointed with a comfortable king bed, sitting area, beautiful bathroom, and a balcony. This is an older hotel, but verynicely maintained. The location was fabulous and the lobby was gorgeous!\nThe staff was professional, friendly, courteous and gave great advice for touring the...\n\n\nMore  \n\n\n", "\nI stayed at this Marriott property for three nights over New Year's Eve using my points. If you are looking for a Renaissance Hotel experience like the Renaissance 57 in New York, this is not it. As a Marriott Platinum member, I expected far better service. At most Marriotts, I am fortunate to be acknowledged at check-in and receive a...\n\n\nMore  \n\n\n", "\nWe stayed at the Renaissance on New Year's Eve. It is a nice hotel; clean, comfortable and with nice staff. However, for the price you pay, a toast or a croissant with coffee in the morning would not hurt their bottom line. Same as Wi-Fi.\nAgain, it is a nice hotel with a good location. However, for the price and...\n\n\nMore  \n\n\n", "\nI visited Charleston for the first time and stayed at The Renaissance Hotel. Very nice lobby and clean rooms. I would have to say Cameron the bellman was our spotlight of service and there was another bellman who took our bags up I think his name was Jason African American Male. Thank you all for a great stay. Thanks Gloria...\n\n\nMore  \n\n\n", "\nStill had all the Christmas decorations up and they looked lovely. The staff couldn't be more helpful. Great beds, but the room could use a little update. We had the continental breakfast, fresh eggs, bacon, fresh squeezed orange juice, etc.\n", "\nThis hotel is right in the center of all the Charleston action! It is between King Street (all the modern shopping) and the Charleston Market. It is in the historic district and most destination are no more than a 5 minute walk. We even walked to Fort Sumter/Aquarium one day and it only took us about 20 minutes-- about a...\n\n\nMore  \n\n\n", "\nThis is a great location for walking around Charleston. It is close to the market and shopping and lots of good restaurants. Although the lobby isn't large, it is inviting and elegant. There is a concierge to help make dining reservations and provide information. Plus, they have free snacks! Our room was decorated in an old Southern style. I'm not...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/09/30/ea/3a/renaissance-charleston.jpg"}]
[{"category": "hotel", "review_count": "492", "title": "Elliott House Inn Hotel, Charleston", "rating_string": "4.0", "address": "78 Queen Street, Charleston, SC 29401", "review_list": ["\nMy wife and I just spent the weekend at the Elliot House, and we couldn't have been more impressed. From our interaction with the staff everyone was extremely pleasant and helpful. Neil gave us some incredible history and maps of the area and town which really helped us to identify the best places to go. Breakfast, wine and cheese nightly...\n\n\nMore  \n\n\n", "\nWarm and inviting atmosphere. Excellent location. While we had to pay for parking in the deck that is very convenient to the hotel it was worth the price because the accommodations were a great value.\n", "\nGreat location for on-foot accessibility to many historical venues. So many excellent restaurants in the immediate area. The property is charming and the staff are friendly and very helpful. Loved it!\n", "\nOnly stayed one night. Wish it was longer. Upon arrival last night the sweetest young lady checked us in and she even let us put our ice oaks in the office freezer, she went above and beyond. Also when we arrived they had wine and cheese I didn't partake but my husband said it was very tasty. The rooms are...\n\n\nMore  \n\n\n", "\nWhat a cool place to stay and in a perfect location. This was our second time and loved it as much as the first. Cozy Rooms, wine tasting, continental breakfast in the heart of the city next to Husk. Huge hotub in the courtyard is a plus and with walking distance of shopping and eateries.\n", "\nAmong the best locations in Charleston. Very attractive setting. The lack of on site parking is an issue. There is very limited on street parking, a garage is available across the street at $20 a night. You are left on your own.\n", "\nAMAZING location. It's on the same block as three of the best restaurants in town and within walking distance of all major points of interest. Neil was incredibly helpful and willing to do anything asked to make our stay absolutely perfect. He was so knowledgeable and passionate when speaking about the history of Charleston. Breakfast was consistently served on-time and...\n\n\nMore  \n\n\n", "\nThis inn has a great location in the heart of historic Charleston. Within steps of four great restaurants and only blocks from East Bay or Market St restaurants. The inn itself is historic and the rooms are very nice. Park your car because you can walk everywhere from here. The staff will help you with recommendations if you need advice.\n", "\nworth staying - the staff, every detail I was very pleased. It is a quiet space and to have them deliver my breakfast was a nice added feature- It was in a great location surrounded by many different types of stores and shops and a nice restaurant right next door. I enjoyed every minute of it. thank you\n", "\nWhat a lovely place- the staff was exceptional- so kind, friendly and willing to help. The court yard was gorgeous. And what an addition to the usual to have an evening reception of wine/ cheese for the guests. Then to have room service for breakfast- delightful. We even requested a large coffee and a big pot arrived promptly at the...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/7b/72/aa/the-elliott-house-inn.jpg"}]
[{"category": "hotel", "review_count": "576", "title": "Hampton Inn & Suites Charleston / West Ashley Hotel", "rating_string": "4.0", "address": "678 Citadel Haven Drive, Charleston, SC 29414", "review_list": ["\nHad the friendliest staff and cleanest rooms! Great experience overall. I will be staying at the hotel again due to the wonderful service I received. Staff assisted with directions; the hotel is located close to attractions. Best price for the room.\n", "\nEveryone at the hotel was very helpful and friendly. Couldn't have been any nicer. Hotel was clean, and breakfast was fine too...Would recommend this hotel as we were very satisfied. The rooms were very clean and it was very quiet while we were there.\n", "\nNice enough hotel about 5-6 miles right outside Charleston historic district. Nothing special to tell. The staff was friendly. Breakfast buffet had just the basics but it was clean. Rooms are dated and in need of upgrading. Fast food close by. Target, CVS, Wal-mart close by.\n", "\nStayed here for one night before our cruise. The hotel is a nice location with lots of food options nearby. Transfer to port was easy in vans and parking lot was safe for our vehicle. The staff was very friendly pointing us to local attractions to visit.\n", "\nThis Hampton Inn is more like a Hilton Garden Inn or Homewood Suites. The amenities and build lay out far exceed all of the Hampton Inn's I've stayed at in other states. For example, there is a complimentary wine/beer happy hour from 5-7 weekdays; this is more akin to a Homewood Suites. It is very clean and the housekeeping service...\n\n\nMore  \n\n\n", "\nWe arrived early in the evening and checked in at the front desk since the room has already been selected in advance using our HHonors member account. This is the first time that we selected our room using online process so not sure if there is anything else needs to be done at the front desk during check in process....\n\n\nMore  \n\n\n", "\nEnjoyed a good breakfast. We were impressed with the attention that the buffet ladies took making sure the buffet was topped up and that the guest was happy. Also appreciated clean laundry facilities. A favourable experience.\n", "\nFriendly , clean, helpful, I could just go on and on. Great hotel , wonderful staff and the Japanese Steakhouse next door is really good and easy to get to, without having to get back in the car. The breakfast of the morning is great, hot coffee, hot food, lots of options especially for a hotel breakfast. My picky husband...\n\n\nMore  \n\n\n", "\nThis Hotel was extremely nice, I paid a little extra for a suite and found it to be well worth the extra money. I wish I could have stayed two nights It was well worth the little bit of extra money I paid.\n", "\nI was very impressed with this hotel. There's a happy hour with free wine and beer and light finger foods that was great. I really thought the hotel was new but it's not - they've just kept it up very well. I can't say enough about the friendliness of the staff - they went above and beyond to help our...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/7a/d6/df/enjoy-your-breakfast.jpg"}]
[{"category": "hotel", "review_count": "341", "title": "Creekside Lands Inn Motel, Charleston", "rating_string": "3.5", "address": "2545 Savannah Hwy, Charleston, SC 29414", "review_list": ["\nThe good points: The tidal marsh is beautiful and the whole place if fairly attractive, with nice landscaping and big shady trees in the parking area. We saw two women at the front desk and both the PM and AM shift were very friendly. There are wide stairs from the parking lot to the first level of rooms. These are...\n\n\nMore  \n\n\n", "\nI stayed in this hotel for nearly a month after being displaced from my home. After driving through the local extended stay hotel, I didn't feel it would be safe and spent one night here to check it out. My room was very clean, comfortable, and quiet. I decided to stay and ended up here for nearly a month. I...\n\n\nMore  \n\n\n", "\nNothing fancy. Matress was broken down on the sides and bottom sheet was a flat sheet that would move during the night. Bathroom was small and a pink color was seen on the shower head which indicates bacteria. Peeling paint and patched tub present. We travel a lot on business so I take discount rooms whenever available. Bottom line? No...\n\n\nMore  \n\n\n", "\nI chose this place because it seemed to be the cheapest around that looked decent on line. I was pleasantly surprised that the exterior of the motel did look kind of like an inn and was on the side of a creek - very pretty. I also thought the location was convenient and navigable and felt safe. The interior of...\n\n\nMore  \n\n\n", "\nI made reservations 6 weeks in advance because I use a wheelchair so getting around was difficult. We arrived hours before check-in and they gave our room away! They said the couple who stayed their last night wanted to stay another night and they were handicapped. I suggested putting them in another handicapped room and giving us our reserved room...\n\n\nMore  \n\n\n", "\nWe stayed at the Creekside Lands Inn on November 7, 2015. Because of the reviews, and the price, I was really holding my breath. However,that was not needed. The office staff was friendly and brought up towels and wash clothes and she was pregnant. The room was bigger than our previous night at the Hampton Inn, in Columbia. There was...\n\n\nMore  \n\n\n", "\nWe stayed here in May 2015 and were surprised when we arrived to find that it was a motel. When we had checked the website prior to booking, nowhere did it mention that it was a motel. On arrival, we signed a form to say we wouldn't smoke and if we did, we would pay a fine. We got to...\n\n\nMore  \n\n\n", "\nThis is a simple motel that could use a little freshening, but the lovely grounds make up for that. Watching the beautiful herons and cranes along the creek was a delight. Pleasant and helpful staff was a plus. When we checked in and the woman at the front desk saw that we were seniors, she changed our room to a...\n\n\nMore  \n\n\n", "\nHonestly, for the price, I expected much less than what we got. We stayed Fri, Oct 23 and Sat, Oct 24th. We were blown away with the property. Great views, awesome pond with dock access and fishing, the bed was spectacular. Really happy with the choice. The location was near perfect for our trip, as it was centralized to the...\n\n\nMore  \n\n\n", "\nThe date says 2014 but it was around may of 2013.. with all the other hotels being high on rates we found this one that was around 80 a night.. the grounds were very nice and well kept. the marsh area was very nice and had a little gazebo and mini dock type area to fish off of. The room...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/03/cc/59/de/creekside-lands-inn.jpg"}]
[{"category": "hotel", "review_count": "108", "title": "Sleep Inn Charleston Hotel", "rating_string": "4.5", "address": "1524 Savannah Highway, US 17 S, Charleston, SC 29407", "review_list": ["\nOutstanding!! Room was spotless, comfortable, and almost perfect! We would have preferred a couch or chair/ottoman for my wife, whose disability makes sleeping in a regular bed very uncomfortable. However, we were able to position the extra pillows to make it more comfortable for her.\nBreakfast was excellent! Omelettes were hot & delicious. The buffet layout was complete with selections...\n\n\nMore  \n\n\n", "\nThis was the best hotel ever. The staff was attentive and went beyond and above to make me comfortable. I witness them giving the same caring service to others. The hotel was priced right, had microwave and refrigerator, and the room was clean. experience. The best front desk staff ever.. Sade, Barbara and Brittinai..omg!\nIt's now the only place that...\n\n\nMore  \n\n\n", "\nI am writing this review to stress how pleased I am with my stay at the Sleep Inn in Charleston. First off, the room was very clean and cozy. I could not believe the quality of the overall rooms for the cheap price we paid for our overnight stay. The bathrooms were immaculate and spotless. The beds were made with...\n\n\nMore  \n\n\n", "\nEvery person at work for this hotel was so helpful with any questions we had. The room was great the the pricing was not too bad. Breakfast was good also. Everyone seemed to have a great spirit. When there was an issue with one of our beds within 10mins housekeeping was there to fix the problem!\n", "\nI stayed here while vacationing in Charleston. The room was clean, the staff was friendly, the breakfast was free, and the wifi was fairly quick. The hotel is also pretty close to many attractions and good restaurants. The only complaint is that being along the Savannah Highway may make entering and exiting the hotel lot a little tricky when traffic...\n\n\nMore  \n\n\n", "\nI recently relocated to the area and stayed at Sleep Inn Charleston while apartment hunting. The woman who checked me in, Sadé, was amazing. She went as far as to give me the number of her landlord. Because of the apartment hunting, I was unsure how many days I'd be staying at the hotel and she was incredibly flexible and...\n\n\nMore  \n\n\n", "\nWe stayed here and did the snooze and cruise package. For the price you can't beat it. Late check out as well as breakfast and comfortable rooms. The shuttle to and from the cruise port is wonderful, they clearly have done it a thousand times. We were off the boat and back to our car at the hotel by 830....\n\n\nMore  \n\n\n", "\nI have stayed at Choice Hotels from Ft Lauderdale to NYC. I have NEVER had the experience I had at this location. ALL staff friendly and cordial. ALL cheerful, saying good morning upon entering building. I have no clue what the manager is doing but apparently it is GREAT. HE SHOULD BE PROUD TO HAVE THESE EMPLOYEES. ...GREAT PLACE TO...\n\n\nMore  \n\n\n", "\nFriendly staff, close to fantastic restaurants, and a good price all made this a great place for us to stay during our recent overnight trip. A very nice breakfast, including waffles & omelets, is available until 10:30am on the weekends, allowing extra time to sleep in after a late night enjoying Charleston. The noon check-out time is great for relieving...\n\n\nMore  \n\n\n", "\nWanted a place near historic downtown Charleston at a good price. Sleep Inn was near everything that we wanted to see and was a good value for the time we spent there. The hotel and more importantly, the room, was clean. The staff was very friendly and answered all of our questions about Charleston in a knowledgeable manner.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/06/fe/25/db/exterior.jpg"}]
[{"category": "hotel", "review_count": "877", "title": "Charleston Marriott Hotel", "rating_string": "4.0", "address": "170 Lockwood Boulevard, Charleston, SC 29403", "review_list": ["\nGood service from bellman to front desk staff to catering personnel. Stayed here for a conference. Catered meals were good but the restaurant dinner was disappointing and waiter was lacking. Bed was soft and comfortable. USB port did not work. Double shower heads were appreciated though it took awhile for hot water. Meeting rooms were often cold. Wifi was unreliable.\n", "\nMy husband and I stayed here for three nights in February 2016. He attended a conference at the hotel and I did some shopping and sightseeing. We had a room with a king bed on the top floor of the hotel. We arrived at 9:30 PM and were able to get some desserts and snacks in the concierge lounge which...\n\n\nMore  \n\n\n", "\nI have eaten here and have family members who stayed here many times. Reviews were always great however I didn't understand how exemplary their service could be until I met Jermaine. I was stranded across the street from the hotel on a rainy night due to a dead battery. Jermaine, a valet, took time to get his personal car, trust...\n\n\nMore  \n\n\n", "\nWe stayed here instead of conference hotel for SC Bar Convention. We were glad we did. The service was out of this world. From the front desk to the restaurant to the van driver all courteous, helpful and knowledgable.\n", "\nI would love to say that enjoyed my stay at the Marriott, especially the staff they make you feel so warm and friendly. I meet an awesome person that works at concierge lounge there her name is Tia; she was so nice and friendly, she's a native of Charleston and was very pleased to help everyone that walks into the...\n\n\nMore  \n\n\n", "\nBest Friend Getaway.. Awesome location, Beautiful Views. Conveniently located. Looking forward to spending the weekend in Historic Charleston. Tours, Good Food, Lots of Drinks.\nTyler at the front desk is amazing. Will be back to visit.\n", "\nThis hotel is a winner (perhaps even my favorite in 5 years of traveling around the US for work).\nQuality, comfortable rooms.\nEnormous work out facility (have never waited in the past 6 months of coming here).\nStaff that remembers you, and sticks around (no revolving door of staff which means they are happy, too).\nA shuttle to the historic...\n\n\nMore  \n\n\n", "\nNice night. Wonderful meal. Comfy room always. My favorite beds going!! I came across a personal hindrance, but, the staff helped me get through the night. I love hot water! Nice well priced location and large, clean relaxing by the big pool a must!\n", "\nIt was a getaway for my wife's birthday having dinner at her favorite restaurant Peninsula Grille and a day of shopping on King St. We have stayed at this Marriott a number of times and enjoy the concierge level where a great breakfast is included, I recommend this hotel highly.\n", "\nNot far from Downtown Charleston, this hotel is a full-service Marriott. Quiet and comfortable. Good service, nice restaurant. Park your car and take the shuttle to Downtown, eat and drink and meet the shuttle, which runs every 1/2 hour. A good choice, not too far from the action. Close enough, but not too far away.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/39/26/f1/exterior.jpg"}]
[{"category": "hotel", "review_count": "485", "title": "Residence Inn Charleston Downtown/Riverview Hotel", "rating_string": "4.0", "address": "90 Ripley Point Drive, Charleston, SC 29407", "review_list": ["\nWe stayed here on a Saturday night in December and we were very pleased with the experience. The room was large, clean and comfortable. It was advertised as a one bedroom suite but the bedroom did not have a separate door. If that is a concern to you, I would call them to double check. We were there for just...\n\n\nMore  \n\n\n", "\nWe were in a 2 bedroom suite and it felt like a spacious apartment with modern furnishings. The hotel is a 5 minute drive from downtown Charleston and within 30-40 minutes of IOP and Hilton Head beaches.\n", "\nMy experience here was one of the best that I had on my trip through South Carolina. The parking lot was spacious and free of charge, the room was clean and comfortable (with a balcony I might add), there was shuttle service to the historic district, and the two young ladies at the front desk were super friendly. Plus... there...\n\n\nMore  \n\n\n", "\nRooms are spacious, and very clean. Free parking and yummy full (free) breakfast. Free shuttle to downtown after 530pm which saves on trying to find a space to park.\nNice that you can bring your pet for an extra $100 because kennels cost much more than that!\nSuper quiet, not a party spot so perfect for families with small kids.\n", "\nMy husband and I spent a few days between the holidays in Charleston, and since we decided to take our two Chihuahuas, options are a bit more limited. We decided on the Residence Inn and it was a good choice.\nI had reserved earlier by phone, just to make sure I got a pet friendly room, and the person who...\n\n\nMore  \n\n\n", "\nWe enjoyed our stay here with our dog. The room was nice and clean with plenty of space for four of us (plus dog) for a few days. Great small kitchen with all basic supplies, too. There's not much within walking distance other than a small marina and plenty of lawn space, however everything is close by. Downtown Charleston is...\n\n\nMore  \n\n\n", "\nWe just returned from a 4 day stay at this lovely hotel. Very nice property, nice clean and large rooms, can't beat the free breakfast and dinner on Monday, Tuesday nights and dessert on Wednesday nights all included in the rate.\nThe rooms were clean, the staff very friendly. Just an enjoyable stay.\n", "\nI've had the pleasure of staying at this Residence Inn for the last few months while on a company business trip. All I can say is the people here really make the difference and go the extra mile to keep their customers happy. They also take the time to get to know their long term guests which makes it a...\n\n\nMore  \n\n\n", "\nJust finished up a three day business trip to Charleston. This is my favorite Marriott on business or personal travel in the Carolinas. I have been staying at this location for over eight years now business and pleasure. The Residence Inn is in a great location only a few minutes from downtown. The property has gone under a major renovation...\n\n\nMore  \n\n\n", "\nThe best part of this hotel is the shuttle service downtown. Decent continental breakfast. The rooms were tired and you can get a view of the ugly roof out your window as I had. Did also hear dogs barking and smelled wet dog as well. This would not be a hotel I'd return to.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/46/94/51/riverview.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "556", "title": "Hawthorn Suites by Wyndham Charleston Hotel", "rating_string": "3.5", "address": "2455 Savannah Highway, Charleston, SC 29414", "review_list": ["\nStayed here midweek in January '16. We rented a suite with a parlor, bathroom and king bedroom. The sofa and armchair in the parlor were worn, but comfortable. The bathroom was a little tight and the sink was missing the drain stop. Outside temp was 40 and the temp on the room thermostate read 75. I tried turning it down...\n\n\nMore  \n\n\n", "\nThe room was very spacious. The workers were very polite and courteous. I loved the Jacuzzi!!! Would def recommend!!\n", "\nMy girlfriend and I really enjoyed our stay at the Hawthrone Suites. I was in town to perform at the Charleston Comedy Festival and was looking for something close to downtown without breaking my wallet. Right off highway and quick access to everything in the area.\nWas surprised by the size of the room! Bigger than my apartment in Atlanta....\n\n\nMore  \n\n\n", "\nHotel is a bit worn. We stayed 3 nights. Breakfast was so disappointing that we did not eat there again. We stayed here because of the indoor pool. I have stayed at other hotels nearby and they are nicer for about the same price.\n", "\nThank you Hawthorne for the comfort,courteous, respectful and the staff is so wonderful I love them all happy holiday. My Hawthorne.\n"], "img_url": "http://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "448", "title": "Kings Courtyard Inn Hotel, Charleston", "rating_string": "4.5", "address": "198 King Street, Charleston, SC 29401", "review_list": ["\nNice room, very friendly staff and concierge. Made restaurant reservations after the recommendation. All excellent.\nHotel is unique as the name implies All rooms are located on various floors around a courtyard.\nOld hotel with modern amenities. Super location right in the heart of the historic part of the city.\n", "\nWe were visiting Charleston for the weekend and brought our dog. He is normally allowed in other hotels but we pay a huge fee and the hotel doesn't do anything to make him feel at home. The Kings Courtyard staff was wonderful -- everyone was polite to us and they even had extra bowls, treats, a toy, and a list...\n\n\nMore  \n\n\n", "\nWe chose the Kings Courtyard because of its central location and historic vibe. We were not disappointed. After arriving on Thursday afternoon, we parked our car, only retrieving it two days later when we left. All of historic Charleston--walking tours, churches, Fort Sumter boat trip, aquarium, shopping, and many restaurants--were within a fifteen or twenty minute stroll. We enjoyed the...\n\n\nMore  \n\n\n", "\nWe have been staying in the same room for 25 years. It is a king with a fireplace and canopy bed. It is the older section of the hotel. You can walk to most of Charleston's historic attractions and world class dining. You can park the car and not move it for days. I cannot recommend this inn enough!\n", "\nLovely place to stay.\nNice wine and snacks at happy hour. Comfy bed.\nI love the open air space in the middle of the hotel. I felt like I was in Italy or France...at least what I imagine a hotel in Italy or France..I haven't been there yet. Haha.\nFriendly staff! Walking distance to all shops. Right on the main...\n\n\nMore  \n\n\n", "\nWe stay on the second floor, typically on the road side to watch things going on. The rooms are very nice, very comfortable. So many places to eat and drink within a minute walking. We typically rent a car to leave for sight seeing, but if you want to relax, eat, drink, shop, don't bother with a rental car.\n", "\nThis is our fourth time staying here and really we never consider staying anywhere else. It is a fantastic place with Charleston Decor and most especially Charleston hospitality !\nAll of the people here are wonderful, so warm and friendly and a most delicious complimentary breakfast is offered. It is the place to stay in Charleston.\n", "\nMy wife and I recently spend two nights at the Kings Courtyard Inn. Due to its age, it's a little quirky inside, with numerous interior courtyards, and some uneven floors. We had a fireplace in our room and a king size bed, although it was a little tight getting into one side of the bed due to the fireplace mantel....\n\n\nMore  \n\n\n", "\nwe stayed at this inn for a week and really enjoyed our stay. The staff was friendly and helpful. The accommodations were very comfortable. The breakfast was just what we needed before we began walking around the city and the wine and cheese was a nice way to relax before going out to dinner. The location is also great we...\n\n\nMore  \n\n\n", "\nWe stayed in this little b&b for one night, and we really liked it. We were about 10 minutes late for cheese and wine, so we were a little sad we missed out on that, but we did enjoy the sherry that was out for the evening. That was a lovely touch for when we returned from dinner. The location...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/ac/3c/ce/filename-kings-courtyard.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "367", "title": "Hampton Inn Charleston - Daniel Island Hotel", "rating_string": "4.5", "address": "160 Fairchild St, Charleston, SC 29492", "review_list": ["\nIN a quiet neighborhood this hotel is one of the best in its class for its serenity, staff and necessities. With a very good breakfast and wonderful evening cookies, i loved this place for its service quality and cleanliness.\n", "\nI stay at this hotel often, as it is very close to my head office location. The staff and service are just the best. Ed on the front desk, and John and Mark the shuttle drivers provide excellent service throughout.\n", "\nVisited several times on business. Great place and great staff. Rooms are clean with comfortable beds. Breakfast is complete with protein items as well as many other selections. Plan to stay here several times per year when in Charleston.\n", "\nI really enjoyed my stay here. The hotel has been recently remodeled and is very nice. Free breakfast in the morning and coffee all day, plus cookies if you are into that sort of thing. I had a great chaise lounge in my room that was a perfect place to work. The staff is very very nice and helpful and...\n\n\nMore  \n\n\n", "\nVery nice interior with a bright modern bathroom. Excellent customer service. Very clean. The guy at the front desk called us shortly after arrival to make sure everything was fine. Was recognized as a HHonors member.\n", "\nAbout a 25 minute drive to downtown Charleston but well worth it. The hotel was very clean and updated (possibly new) and the staff were very pleasant and actually seemed happy to be there. The breakfast was a real spread. Lots of options, stocked, and maintained. Would definitely stay again. The rates were very reasonable.\n", "\nBeen for 2 nights. We switch the room 3 times because they didn't sucseed to turn off the a/c .\nThey still didn't did that.\nthe recupiant didn't remember to tell the shutel to bring us back to the room unless we called 3 times.\nThe hotel is empty but they won't gave us a late chech out.\nWon't come...\n\n\nMore  \n\n\n", "\nStayed here the weekend of December 18. We were in town visiting family who live on Daniel Island. What a perfect location, as we were a minute drive from their home! We were greeted with smiles and a warm welcome from the front desk staff. The room was perfect for our family of 4 (myself, my husband and two small...\n\n\nMore  \n\n\n", "\nWe will definitely visit this Hotel and Charleston again! We only got to stay here overnight as we were leaving on the cruise for the Bahamas. The Service, rooms and Hotel as a whole were extremely nice, clean and friendly! What a great place! We have already started making plans to come back and visit, as well as stay at...\n\n\nMore  \n\n\n", "\nWe were visiting Daniel Island so it was a perfect location. The hotel is new therefore it is beautiful condition. Staff very friendly and helpful. Higher quality than a normal Hampton Inn. Breakfast was great and lobby was inviting.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/ae/e9/7f/hotel-exterior.jpg"}]
[{"category": "hotel", "review_count": "507", "title": "John Rutledge House Inn Hotel, Charleston", "rating_string": "4.5", "address": "116 Broad Street, Charleston, SC 29401", "review_list": ["\nWe stayed at John Rutledge House Inn for our anniversary. Room was nice and clean. Tempur-Pedic mattress slept great. Service was excellent. We parked on Friday and didn't get in the car again until we left Sunday; we were able to walk everywhere. We walked to Hall's Chophouse (~3/4 mile), Poogan's Porch (~1/4 mile), and Peninsula Grill (~1/2 mile). We...\n\n\nMore  \n\n\n", "\nThe Rutledge house is a wonderful place to stay when you visit Charleston. It's located close to wonderful restaurants and shopping but it's very quiet and comfortable. The concierge was very helpful. They had great recommendations for restaurants and things to do. Room 19 in the carriage house was great and had everything we needed. Afternoon tea and breakfasts were...\n\n\nMore  \n\n\n", "\nMy friend and I spent five days at this Inn. It's lovely, so many good things to say about it! First, the concierges (Jim, Mike, and Cici) are top notch. Every question we had--and we asked a lot) was easily and quickly answered and/or personally addressed by them. By the end of the trip, they felt like old friends. Breakfast...\n\n\nMore  \n\n\n", "\nFirst of all, we agree 100% with juliemariegoldilocks' review! We, too, spent four nights at the Inn over Christmas and enjoyed every moment. Some key points to consider:\n- The Inn is centered in the heart of the city on Broad Street and it's an easy stroll to most historical homes and restaurants\n- The interior is well maintained and...\n\n\nMore  \n\n\n", "\nApart from a nice location, this B&B offered nothing special. In fact, one morning it didn't even offer breakfast. We were told that the chef didn't show up. But only told that after we inquired, twice. It took a while to learn about the problem because there is ONE desk person who is also the concierge and reservations-taker. Although I...\n\n\nMore  \n\n\n", "\nWe were looking for a pet friendly way to enjoy the center of Charleston. Trip Advisor guided us to this historic Inn. It was a congenial choice for my husband, me and our two dogs. The staff is responsive, informative and friendly. Breakfasts are delicious, customized and can be enjoyed in room. Pets are well treated. Take your afternoon tea...\n\n\nMore  \n\n\n", "\nWe stayed at The John Rutledge House Inn for 4 nights over Christmas, and hated having to leave! The location is perfection. When you walk out the front door any time day or night, head in any direction, you find charm, beautiful architecture, lovely shops, good restaurants, it couldn't get any better! We are huge fans of historic locations, so...\n\n\nMore  \n\n\n", "\nStayed one night wish we could have stayed longer traveling to see family. Brought our three year old and dog and stayed in the carriage house. Very welcoming and accommodating staff. Inn is located in the heart of the city and within walking distance to shops and restaurants. Highly recommend it!\n", "\nWe enjoy staying at The John Rutledge House Inn each time we visited Charleston. The Inn Keeper, Cathy Leslie is a gracious host and her staffs is personable and accommodating. They give you that southern hospitality of welcoming you. The John Rutledge House Inn is also a bed and breakfast inn. Good choices on the menu, try the southern biscuits...\n\n\nMore  \n\n\n", "\nThe John Rutledge House never disappoints. We've stayed there several times and are as enchanted by the architecture as the history. There is something about sharing the same space as a signer of the Declaration of Independence that gives one a sense of connection to past.\nOn this visit we were fortunate to enjoy room number 8, which is spacious...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/08/06/45/a4/john-rutledge-house-inn.jpg"}]
[{"category": "hotel", "review_count": "492", "title": "Elliott House Inn Hotel, Charleston", "rating_string": "4.0", "address": "78 Queen Street, Charleston, SC 29401", "review_list": ["\nMy wife and I just spent the weekend at the Elliot House, and we couldn't have been more impressed. From our interaction with the staff everyone was extremely pleasant and helpful. Neil gave us some incredible history and maps of the area and town which really helped us to identify the best places to go. Breakfast, wine and cheese nightly...\n\n\nMore  \n\n\n", "\nWarm and inviting atmosphere. Excellent location. While we had to pay for parking in the deck that is very convenient to the hotel it was worth the price because the accommodations were a great value.\n", "\nGreat location for on-foot accessibility to many historical venues. So many excellent restaurants in the immediate area. The property is charming and the staff are friendly and very helpful. Loved it!\n", "\nOnly stayed one night. Wish it was longer. Upon arrival last night the sweetest young lady checked us in and she even let us put our ice oaks in the office freezer, she went above and beyond. Also when we arrived they had wine and cheese I didn't partake but my husband said it was very tasty. The rooms are...\n\n\nMore  \n\n\n", "\nWhat a cool place to stay and in a perfect location. This was our second time and loved it as much as the first. Cozy Rooms, wine tasting, continental breakfast in the heart of the city next to Husk. Huge hotub in the courtyard is a plus and with walking distance of shopping and eateries.\n", "\nAmong the best locations in Charleston. Very attractive setting. The lack of on site parking is an issue. There is very limited on street parking, a garage is available across the street at $20 a night. You are left on your own.\n", "\nAMAZING location. It's on the same block as three of the best restaurants in town and within walking distance of all major points of interest. Neil was incredibly helpful and willing to do anything asked to make our stay absolutely perfect. He was so knowledgeable and passionate when speaking about the history of Charleston. Breakfast was consistently served on-time and...\n\n\nMore  \n\n\n", "\nThis inn has a great location in the heart of historic Charleston. Within steps of four great restaurants and only blocks from East Bay or Market St restaurants. The inn itself is historic and the rooms are very nice. Park your car because you can walk everywhere from here. The staff will help you with recommendations if you need advice.\n", "\nworth staying - the staff, every detail I was very pleased. It is a quiet space and to have them deliver my breakfast was a nice added feature- It was in a great location surrounded by many different types of stores and shops and a nice restaurant right next door. I enjoyed every minute of it. thank you\n", "\nWhat a lovely place- the staff was exceptional- so kind, friendly and willing to help. The court yard was gorgeous. And what an addition to the usual to have an evening reception of wine/ cheese for the guests. Then to have room service for breakfast- delightful. We even requested a large coffee and a big pot arrived promptly at the...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/7b/72/aa/the-elliott-house-inn.jpg"}]
[{"category": "hotel", "review_count": "839", "title": "BEST WESTERN Sweetgrass Inn Hotel, Charleston", "rating_string": "4.0", "address": "1540 Savannah Highway, Charleston, SC 29407-7845", "review_list": ["\nWe were on a business trip to Charleston Sc. I was Very tired when I arrived at the motel. When i went to the front desk there was no hassle. Everything was ready for me. The Lady at the front desk couldn't have been any nicer and helpful. I have been to a lot of motels around the Country and...\n\n\nMore  \n\n\n", "\nLovely rooms soft bed and very sweet check in lady. She was very helpful and inviting. When you are tired and have been on the road for a long time it is nice to see a friendly face. Once I got in my room it was very clean. and the bed was so soft. I loved it. Then I found...\n\n\nMore  \n\n\n", "\nWe had a newly renovated room - nicely done.... Great decor. While interior configuration of room was similar to most, the entry was odd. You park in front of your room (like most motels) but there are no windows on that side. You're simply facing a blank wall with doors spaced out along it. Practically, it makes sense, no one...\n\n\nMore  \n\n\n", "\nThe room was fabulous. It was neat and clean and very homey. We definitely enjoyed our stay! The flooring was new and very attractive. The beds were very comfortable. The front desk and breakfast service attendants were very friendly.\n", "\nOur family thoroughly enjoyed our stay at this location! Our truly smoke-free room was neat and clean, with pillow-top beds and crisp, clean sheets that helped us wake refreshed and energized each day. The staff were welcoming, friendly and helpful, from DaQuonna, who courteously welcomed us with her beautiful smile and provided us with info and maps re: the attractions...\n\n\nMore  \n\n\n", "\nThe hotel staff have always been exceptional at this Best Western. The beds and cleanliness of the rooms are excellent. We have stayed at this hotel many times and have always been very pleased. The breakfast is always great as well.\n", "\nWe drove down from Maryland the day before a cruise, the only problems we had were that the water was lukewarm, which obviously is a first world problem and not worth crying over, and that when we booked, the booking process didn't catch that we were doing the cruise package, so an unexpected $20 per person was added to the...\n\n\nMore  \n\n\n", "\nI have stayed here multiple times and will return when I am in the area. The breakfast attendant carol is awesome. She knows me by name and always ask how I am doing and when I will be back. I miss not having the option to have a smoking room at this location now though.\n", "\nWe visited Charleston straight after the October flooding, so I expected the area to be damp. The hotel hadn't been flooded. Our room was on the first floor (American second floor) in the building at the rear. It smelt appalling and we asked for another room. Housekeeping were extremely cooperative in changing our room, but did have a slight air...\n\n\nMore  \n\n\n", "\nWe spent two nights here staff was awesome and the rooms newly remodeled are great and it was a quiet place as well. Place is close to downtown and close to other area interests. Breakfast was good with both hot and cold choices. Will definitely stay here next time we are in the area and want a clean comfortable room....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/78/ca/6b/pool.jpg"}]
[{"category": "hotel", "review_count": "485", "title": "Fulton Lane Inn Hotel, Charleston", "rating_string": "4.5", "address": "202 King St, Charleston, SC 29401", "review_list": ["\nWe really liked everything about this hotel, excellent large room, great bathroom, closet, good wifi, right in the middle of the antique district. Parking right behind the building. All the folks we encountered were very friendly. The free breakfast and wine hour were very nice as well. Walking distance to everything in Historic Charleston. I'd recommend it without hesitation.\n", "\nThis is a really nice place to stay if downtown Charleston, it had lots of character and gives the feel of old south charm. Stayed on second floor overlooking King st.\nParking is in a safe lot behind building. Bed was comfortable, staff were very attentive, place was clean. All good food and drink locations are within a block or...\n\n\nMore  \n\n\n", "\nIt was a great romantic weekend, right in walking distance to everything and if we wanted nothing the hotel was romantic and cozy. The fireplace and tub were extra bonus , romance package came with flower and champagne. The wine and cheese happy hour was a great place to meet others and discuss things to see and do in town\n", "\nWe were looking for something affordable in Charleston and founds deal on Hotwire for this place. What a great deal. We got it for half price ($83) before tax and service fees.\nThe good:\nAlmost everything. Location is fantastic. Just park and walk to everything. Free breakfast brought to your room. Great choices and good food. My barometer is whether...\n\n\nMore  \n\n\n", "\nThe location of this charming Inn was perfect for a girls mini-vacation. My husband and I have stayed several times in Charleston, including at The Francis Marion Hotel. The Fulton Lane Inn was hands-down my favorite. The continental breakfast brought to my room daily, the complimentary wine & cheese hour each day, and the exemplary service I received all made...\n\n\nMore  \n\n\n", "\nMy wife and I recently stayed here to explore some of Charleston for a couple days. Despite the inability to check-in early and their lack of explanation concerning parking which could've saved us some money, I was impressed with the room itself and the services available. They offer wine and cheese in the evenings and nightly sherry complimentary. I was...\n\n\nMore  \n\n\n", "\nStayed here with my wife for a get away. Had a great time. Parking is convenient. Able to walk everywhere in the downtown area with ease from this location. Our room was older, but very nice. Spacious and well appointed. All staff very friendly. Evening reception was nice/convenient. Did not take advantage of breakfast options, except for in-room breakfast one...\n\n\nMore  \n\n\n", "\nWe stayed at the Fulton Lane Inn the first week of Jan. and renovations began on approx. the 4th. The workers were very polite and tried very hard not to disturb the few remaining guests. I rated the Inn average as that was our experience, however I look forward to staying in a renovated, upgraded room in the future. The...\n\n\nMore  \n\n\n", "\nNot at all like a chain hotel so don't expect that ...\nRooms are charming and have everything you need, including a small refrigerator.\nOur room overlooked King Street which we LOVED because we never felt \"stuck in a room\" - the happenings on the street were entertainment! We've stayed multiple times and have never turned on the TV!\nThe...\n\n\nMore  \n\n\n", "\nThis little gem is the perfect hotel in the perfect location in Charleston. The staff is wonderful and the rooms are clean and tastefully decorated. Susu was especially gracious and kind during our check in process. I loved having the convenience of coffee in the lobby and the \"happy hour\" at the King Charles next door. I would most definitely...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/c0/ef/b0/fulton-lane-inn.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "345", "title": "Lodge Alley Inn Hotel, Charleston", "rating_string": "4.0", "address": "195 E Bay St, Charleston, SC 29401", "review_list": ["\nPerfect location for a night out in Charleston. Location is right on East Bay St and close to everything. Room was nice and had the lovely Charleston feel. The staff was very helpful and assisted us when needed. Valet was quick and the coffee in the lobby was hot and delicious as well :)\n", "\nWe have stayed here for several years and have loved it. They have a variety of different rooms, all with character. Most rooms have full kitchens if you choose to stay in. The private courtyard is beautiful and well set up and the staff is helpful. You are literally seconds away from everything you can imagine downtown from great restaurants...\n\n\nMore  \n\n\n", "\nSpent the night before flying out of Charleston. Staff are amazing and so nice and helpful. Everything was clean and fresh. Very old building but highly maintained. Perfect for historic Charleston. The location is perfect. Valet parking is $18 but worth not having to park and retrieve your car. Overall such a nice visit. Will be back! Todd and Chelsea...\n\n\nMore  \n\n\n", "\nThis Bluegreen resort is top of the line. If you want to stay in a wonderful suite with the feel of a great southern inn with modern amenities and comfort, Lodge Alley Inn is perfect. A block from City Market, and dozens of great places to eat within a couple of blocks, make the location ideal for a weekend or...\n\n\nMore  \n\n\n", "\nWe have stayed here at least 5 times and have never been disappointed in the service here. It is close enough to so many restaurants and shopping too. Love it here not matter what season it is always beautiful.\n", "\nSpent the weekend downtown for our family Christmas weekend. Love the Lodge Alley Inn. Everyone so helpful and friendly from Molly at the front desk to Julie and Meghan as Concierge. Loved our room with a fireplace, which was so handy in 36 degree weather! We'll be back next year!!\n", "\nThis resort is perfectly located for visitors who enjoy exploring Charleston on foot. We walked everywhere! The staff are very nice and courteous, always willing to print out directions for you and recommend restaurants. The weather allowed us to enjoy the beautiful courtyard. You are walking distance to Waterfront Park along the Cooper River. The Market is close by and...\n\n\nMore  \n\n\n", "\nWe had a great stay over Thanksgiving. From the moment we pulled to the curb until checkout we were treated like royalty. The staff was superb - some of the best customer service reps ever. This was our 1st time in Charleston and because of our experience at The Lodge Alley Inn we will be back.\n", "\nWe were at the Lodge Alley Inn for 3 nights and wish that it had been longer! I've never been anywhere with friendlier, more helpful staff members. Every single person on the staff was so kind and cheerful. They all really made our trip exceptional.\nThe inn itself is charming. We had a one bedroom and had more than enough...\n\n\nMore  \n\n\n", "\nWe are Bluegreen owners and have stayed at Lodge Alley several times in the past and as always we had a great stay. The staff members are friendly and accommodating. Coffee and tea are available around the clock and sherry and cookies are served between 4:00 and 5:00 each afternoon. We stayed in a studio suite which was beautifully decorated...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "3.0"}]
[{"category": "hotel", "review_count": "34", "title": "Value Place Leeds Hotel, Charleston", "rating_string": "4.5", "address": "4475 Leeds Place West, Charleston, SC 29405", "review_list": ["\nThe first thing I noticed upon entering the hotel was how wonderful and patient the young woman (Leslie) was at the desk. I checked in during the middle of the night and had a bunch of questions. Despite this, Leslie was super pleasant and helpful. She even recommended our family's new town favorite restaurant.\nThe rooms themsleves were very clean...\n\n\nMore  \n\n\n", "\nIf you are a business traveler or contractor like me, you are probably familiar with Value Place hotels. This is one of three in Charleston I think, and it's the best one I've been to. I have also stayed at the Rivers Ave location and they have nothing on this one. The best thing is the front desk staff. For...\n\n\nMore  \n\n\n", "\nI've been staying at Value Place Leeds for about a year now, and what keeps me coming back, aside from the spotless rooms and safe location, is the incredibly friendly staff. They're always available and genuinely friendly. I've stayed in other VP properties, but this is the best, as is the staff. Highly recommended if you're in town for a...\n\n\nMore  \n\n\n", "\nI travel with my hubby for his job with or 6 month old son and we spent our 3-4 week stay here. The room was nice and clean with great space. The employees are pleasant, one in particular was Desmond. He's very patient, reliable, and inviting. I must say he made my stay enjoyable and if needed for more travels...\n\n\nMore  \n\n\n", "\nWe stayed in a studio- double bed with kitchenette and bathroom. The location was great, we felt safe at the hotel, the staff were very friendly and helpful, and ample parking. The hotel is a short 10 minute drive to Charleston. However, the bed was the most uncomfortable I've ever slept in at a hotel. My husband and I both...\n\n\nMore  \n\n\n", "\nMy experience there was awesome. I was treated with great respect from Clerk (Desmond) He was very professional and i was please and grateful for his service. The room was very clean and smell nice and clean... I really enjoyed my stay .. I am looking forward to my next visit....\n", "\nI'll start by saying Desmond's hospitality was very much appreciated from the moment I walked through the door. I will stay here every time I visit Charleston. I had a wonderful week stay here. Hotel was very quiet and clean. Thank you Demond!\n", "\nI stayed here for 3 weeks and I loved it! My room was very quiet and clean. The hotel employees were helpful and courteous. Internet and laundry are convenient to use and reasonably priced. Conveniently located to all points of Charleston; easy access to West Ashley, Mt. Pleasant, and downtown. Minutes away from The Citadel Mall, Tanger Outlets, and Walmart...\n\n\nMore  \n\n\n", "\nWe have travelled the world and appreciate helpful customer service like that of Desmond, the friendly desk clerk, who checked us in. He keeps track of everything and is very helpful. This hotel has proved to be ideal for a long-term stay as well as for just a few nights because of the security and reliable staff. Easy access from...\n\n\nMore  \n\n\n", "\nI travel a lot, across the country actually, for a leading sales company. I personally choose to stay in 5 star hotels with room service, but this booking was for my daughter who's a sophomore at CSU. This year she will be having her own apartment off campus, but the apartment wasn't ready, so we needed somewhere affordable, safe, comfortable...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/03/f9/39/f7/value-place-leeds.jpg"}]
[{"category": "hotel", "review_count": "109", "title": "The Spectator Hotel, Charleston", "rating_string": "5.0", "address": "67 State Street, corner of State and Linguard, Charleston, SC 29041", "review_list": ["\nI just returned from a two night stay at the Spectator hotel in Charleston. It was, hands down, one of my best hotel stays. The hotel itself is gorgeous and well situated in Charleston. The bed was divine and our King suite was impeccable and clean. Based on the aesthetics alone I'd be happy but the stuff truly pushed or...\n\n\nMore  \n\n\n", "\nThis was by far the best hotel we have ever stayed in, and every hotel we stay in from now on will be compared to The Spectator Hotel. A lot of care was taken to make sure we were happy during our stay. Our room was flawless. We loved having the breakfast delivered to our door so we could eat...\n\n\nMore  \n\n\n", "\nThis boutique hotel is gorgeous with a great staff. Jordan our butler was fantastic, and made sure we were well taken care of. And Michael Curley , their director of operations, was a terrific host and so very knowledgeable about places to visit and eat at. I didn't get the names of the young ladies who did turn down, but...\n\n\nMore  \n\n\n", "\nWe stayed at The Spectator for a girl's weekend...beautiful property, fabulous service. Wish that the bar stayed open past midnight. But other than that service was on point from a specialty cocktail at check-in to breakfast in the morning. We will definitely be back!\n", "\nBoutique hotels are my favorite but you also run the risk of not knowing EXACTLY what you are going to get -- and this hotel blew me away.\nNot only is it in the middle of everything but they have BUTLER service that reminds me of the St Regis to handle all of your wants and needs -- my wants...\n\n\nMore  \n\n\n", "\nEverything about this new hotel is stunning, every detail perfectly prepared and the staff goes the extra mile to ensure that your stay is perfect and over-the-top special. Extra call-out to the Guest Services rep Victoria for going the extra mile in ensuring that everything was surpassing expectations! Impeccably located and worth every penny. Thank you for taking care of...\n\n\nMore  \n\n\n", "\nWe very much enjoyed our one night at the Spectator. The decor of our Grand Suite was very contemporary and soothing. Perfect after having spent the previous nights in a Victorian Inn. The staff was very effecient and accomodating. Someone came up immediately after being notified that the bathtub stopper would not work. It was fixed with 15 minutes. They...\n\n\nMore  \n\n\n", "\nOur reservation at this hotel is not until next month but I did want to sing the praises of a hotel staffer named Victoria who I have spoken to a number of times. She has already gone above the call of duty to accommodation our questions, and needs. It is appreciated before we have even walked in the door. If...\n\n\nMore  \n\n\n", "\nMy best friend and I took a long weekend trip to Charleston and Savannah in October to celebrate 26 years of friendship. While in Charleston, we stayed at the Spectator and it was a wonderful stay.\nFor those familiar with my other reviews, you will know that I conduct extensive research before I stay anywhere and this hotel met my...\n\n\nMore  \n\n\n", "\nHeard so much about Charleston, its historical town, it's foods, it's people. But probably just because it is not that far from us, we waited and waited until a recent short three days getaway. AND, it didn't disappoint at all. Everything we heard is true. It's a town that America used to be before modernization erased so many chapters of...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/3d/86/1e/the-spectator-hotel.jpg"}]
[{"category": "hotel", "review_count": "53", "title": "Grand Bohemian Hotel Charleston", "rating_string": "5.0", "address": "55 Wentworth St, Charleston, SC 29401", "review_list": ["\nMy husband and I planned a quick one night trip to Charleston and stayed at this new hotel. We decided upon the Grand Bohemian for its funky interior and emphasis on art. It was like staying in a Jeff Koons' art work with the over-the-top interior design. Nice bar with good drinks. Would recommend the roof top terrace in warmer...\n\n\nMore  \n\n\n", "\nI Was Born And Raised In Arizona, I Didn't Know What To Expect In Charleston, So My Close Friend Who Is Familiar With That Of Charleston Area, Told Me I Should Try Either The Renaissance Hotel Or The Bohemian Hotel, Which You Knew I Tried The Bohiemian A While Ago, BEST CHOICE EVER! Fantastic Room, Incredible View, Great Food, And...\n\n\nMore  \n\n\n", "\nWe went to Eleve at the Grand Bohemian for a birthday celebration with some girlfriends. Everything was superb, the atmosphere was great, the food was absolutely amazing and it was some of the best service I've ever had in Charleston. Jason, our server was beyond attentive and made sure we had everything we needed throughout the night, there was never...\n\n\nMore  \n\n\n", "\nI was born and raised in Charleston, however I no longer live there. While visiting my family for the weekend, I chose to stay here because it was new and I had heard great things. It is my far my favorite hotel! The decor is chic, and its a stone's throw from EVERYTHING! The valet takes a really long time,...\n\n\nMore  \n\n\n", "\nRichard Kessler and his team have done it again. The Grand Bohemian Charleston delivers on being cool without being unapproachable.\nThe rooms are spacious, edgy and well appointed. We ordered In-Room Dining and it arrived quickly and as ordered. Our In-Room Dining server was an absolute delight.\nThe roof-top bar and restaurant Eleve is a can't miss. Our only disappointment...\n\n\nMore  \n\n\n", "\nLove this Marriott property. Great location and rooms are very nice. We have stayed a couple times using points and it's our new favorite. Nice coffee shop on first level too!\nStaff is always friendly and the wine bar has a great selection.\nGreat place to stay!\n", "\nThe property and staff are first rate and our wine blending class with sommelier Scott was educational and fun. We look forward to taking friends to the wine blending and enjoying the new boutique hotel again. We enthusiastically recommend the hotel and particularly the wine blending class.\n", "\nI cannot say enough great things about the Grand Bohemian Charleston! The property itself is gorgeous! From the travertine at the entrance to the eclectic art perfectly placed throughout you feel you are in a gallery, but one where you can relax.\nI had my team of 15 visit for a three day meeting. From my first phone call with...\n\n\nMore  \n\n\n", "\nConveniently located & walking distance to historic downtown & waterfront district. New boutique hotel by the Kessler Group and Marriott. Everything was excellent during our stay. We will definitely visit again. Thank you to the friendly, helpful, professional staff.\n", "\nMy husband and I stayed here last week on a visit to Charleston. We usually stay somewhere else, but decided to try something new. The Grand Bohemian did not disappoint. The hotel is only 4 months old. The rooms have plenty of room and very clean. I love the cool funky decor. We loved the rooftop bar- great ambience! All...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/98/3a/11/grand-bohemian-hotel.jpg"}]
[{"category": "hotel", "review_count": "45", "title": "Hyatt House Charleston - Historic District Hotel", "rating_string": "4.5", "address": "560 King Street, Charleston, SC 29403", "review_list": ["\nHyatt House has all of the conveniences of home and all the amenities of a hotel. I wish we'd stayed longer. It is a convenient walk to the Center and the apartment style and friendly atmosphere of the hotel really makes you feel like a local right away. The kitchen is well equipped for a meal in and the services,...\n\n\nMore  \n\n\n", "\nHotel is located about 10 minutes walk from the busy part of King Street and backs up to a large grocery store (Bi-LO) so easy to stock up. There are cranes surrounding the place so lots of newness going in....likely two years away from being a robust location as it borders a tougher area about three/four blocks further up that...\n\n\nMore  \n\n\n", "\nMade unexpected trip to Charleston, SC because of snow in Asheville. Made reservations in the car and on the way from Asheville to Charleston. Once we arrived we were met with a great staff that met every expectation. The studio was just the right size for two for an overnight stay, The morning breakfast was exceptional. The staff was the...\n\n\nMore  \n\n\n", "\nLoved the new Hyatt House Hotel in Downtown Charleston! Suite is like a small apartment. Loved the convenience of the hotel. Will be staying there again for business and pleasure. Breakfast was great too!\n", "\nWe booked this room to work with Jan 2016 practice dates for Charleston Fashion week, and I got more than I bargained for: King bed, double bed pull out couch and a full working kitchen with fridge, microwave, a two burner cook top, dish washer and crockery/kitchen tools. Amazing!\nThe beds were comfy, no complaints except that you can't set...\n\n\nMore  \n\n\n", "\nStaying at Hyatt House is like being home, with a well-equipped kitchen, a lovely sitting area, a cozy bedroom and a fantastic bathroom. The location is ideal. My only problem was that I was unable to adjust the room temperature.\n", "\nThe folks were very friendly and helpful and rooms nice and new. My favorite thing was the double black out curtins which allowed us to sleep late. My least favorite thing was twice in our four day stay, King Street was closed for events which delayed our departures. Not a problem if you are walking every where. Lots of cool...\n\n\nMore  \n\n\n", "\nThis hotel would be perfect if it was a mile south. I liked the large quiet room. The breakfast was nice. We even had a partial view of the bridge. However if you stay, consider budgeting some money for Uber. I think the hotel could compensate for their location if they had a shuttle going up and down King St....\n\n\nMore  \n\n\n", "\nOur experience at the Hyatt House was above what we had expected. Normally we stay at the Grand Hyatt or Regency, depending on which is available. I would have rated this hotel Excellent, but we had to change rooms due to a nonfunctional bathroom door lock. The staff were very accommodating and were prompt in there response. I will definitely...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/3e/00/9c/exterior-and-front-drive.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "61", "title": "Hyatt Place Charleston/Historic District Hotel", "rating_string": "4.5", "address": "560 King Street, Charleston, SC 29403", "review_list": ["\nEnjoyed a quick visit over the New Year weekend. Modern and clean with a very helpful front desk staff. Great location, close to numerous spots in the gentrifying Historic District. We hired a bike cab to give us a tour and it was great\n", "\nWe stayed one night on our way to Hilton Head and were delighted with the decision. The Hyatt Place is centrally located with a public parking garage ($16/day) or valet parking done well by Brandon and his colleagues ($30/day). The lobby is attractive and staffed with pleasant, professional people like Jean and Stanley. Our room was ready, attractive, comfortable. The...\n\n\nMore  \n\n\n", "\nMy husband and I travel quite a bit and have stayed in many hotels. I can honestly say that the Hyatt Place, hands down, had two of the best front desk staff we have ever encountered! Stanley and Brittney could have not been nicer, helpful and just all around top notch when it came to customer service. We were there...\n\n\nMore  \n\n\n", "\nThe Hyatt Place is located in the Historic District of down town Charleston, SC. The staff is very friendly. Valet parking is available. My wife and I got 8th floor so we can see the city. It's very close to great places to eat. Plenty of shopping. In general, a very nice place to walk around and see the sites....\n\n\nMore  \n\n\n", "\nClean and new! Just a lovely hotel and the staff is superior! Wish the bar/lounge area was developed further. Everything was wonderful. The location is ideal for bars and eats. The outdoor fire pit was such a bonus! Sheets and bed were very comfortable!\n", "\nWe had a wonderful stay at this hotel. It was brand new and everything was so nice and clean. The staff went over and above to accommodate our every need! Would definitely stay there again when in Charleston!\n", "\nThank you! Place was clean, and excellent. Tammy at the front desk was always on point and everyone was professional, Gym and pool clean and new. Like the key to the door, it work every time, Thank you, Thank you, Thank you, Thank you! F.\n", "\nThis is a new hotel so the cleanliness might have been a reflection of that. The pool was perfect and the fitness room was well equipped. The friendliness of the staff, however, was a big surprise. Everyone I ran into made a point of offering to help. The breakfast buffet was above average as well!!\n", "\nGreat location easily able to walk to all major attractions. Parking being available was important and resonable .Many very good restaurants near by easy access to highway. Rooms very zen like large comfortable . Breakfast had many options and was good.The staff very helpful and pleasant on all levels. Highly recommend\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/3e/04/0c/hyatt-place-exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "443", "title": "Comfort Inn Downtown Charleston Hotel", "rating_string": "3.0", "address": "144 Bee Street, Charleston, SC 29401", "review_list": ["\nOne of my college aged children (and classmates) spent most of last week at this hotel during a theater conference and competition.\nOne evening, my son and one of his roommates was stopped by a woman that identified herself as the General Manager. She asked their room number and then motioned them over. With her finger. She then stated that...\n\n\nMore  \n\n\n", "\nI wanted to take a moment to express my sincere and heartfelt thanks for the excellent customer service experience that my family and I had this past week. \nFor starters, I am active duty military stationed in Germany and I have to travel a few times a year to Charleston for my program at MUSC and had originally elected to...\n\n\nMore  \n\n\n", "\nMy best friend and I stayed here for her 23rd birthday. We booked on Hotwire, and we are not the type to be TOO concerned with what hotel we're staying in because we're always out and about doing things and we are rarely actually in the room. There were definitely some pros and cons to this Comfort Inn.\nPros:\n-The...\n\n\nMore  \n\n\n", "\nthe only good thing was the staff: very gentle and ready to help and solve problems.\ncarpet, walls, elevator very old and scratched, also looking dirty. Bad smell along the corridor. Room was ok enough\n", "\nDon't let the fact that the lobby needs updating skew your opinion, we had a great stay. After a heart procedure at MUSC we stayed in a very clean, warm room. The TV worked, lots of towels, and very quiet. All employees were welcoming. Great shower, nice bathroom and this wasn't arranged by the hospital so our room was random,...\n\n\nMore  \n\n\n", "\nI have stayed at this property 2 times in the last 45 days and the experience was excellent. This is a good lower cost alliterative tot eh HI or Marriott. I was in Charleston for the marathon and they were very accommodating to the runners.\n", "\nQuick overnight stop at this hotel. Everything was clean, our 2 double bed room had plenty of space, and there were complimentary cookies at the front desk. Who doesn't love a free cookie :) The staff were friendly and also kept our bags while we went out for breakfast after checking out (very helpful to not have to lug around...\n\n\nMore  \n\n\n", "\nWe stayed here in mid-December, the hotel was nice enough but we were double charged for our stay and are still struggling to sort this out.\nWe used booking.com to book our stay, paid upfront via credit card, approximately $150. This payment was made a month in advance.\nUpon check in the hotel charged our credit card with a further...\n\n\nMore  \n\n\n", "\nThe room was Clean and the King sized bed was comfortable. We planned on staying for 6 nights but had to leave a few days early. Holly at the front desk was very understanding and checked us out quickly. The breakfast was good but the hot selection didn't vary much. it was either biscuits and gravy with eggs or biscuits...\n\n\nMore  \n\n\n", "\nWe are given a rate by phone that was cheaper than when we checked in. It was late and we didn't want to go searching for another motel.\nWhile sitting on the couch a small brown bug was discovered on my clothing. The next day both my husband and I had several bites. When checking out, we told the clerk...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/25/d7/02/scexterior.jpg"}]
[{"category": "hotel", "review_count": "7", "title": "Market Street Inn Hotel, Charleston", "rating_string": "4.5", "address": "48 North Market Street, Charleston, SC 29401", "review_list": ["\nI love this place. It's located in the heart of the historic part of town.We walked to every place we wanted to see from here. It's very near the huge city market, and near the water, other shopping, and restaurants. The hotel has a good breakfast included, and wine and snacks in late afternoon. We only needed to pay for...\n\n\nMore  \n\n\n", "\nStayed here in the historic area of Charleston for one night. Our room was located on the second floor accessed by a wooden porch that was noisy when other guests walked by. It was a cold night and the room itself was cold. As said, this is an old B&B where you could see daylight around the doors with a...\n\n\nMore  \n\n\n", "\nWe spent four days in Charleston this summer and wanted to be in the middle of all the action. We could not have stayed at a nicer place! The Inn offers hands down the best breakfast in town, the courtyard is quaint and comfortable, wine and a little something is free to guests in the late afternoon. Staff is friendly....\n\n\nMore  \n\n\n", "\nThe Market Street Inn is close to the the shops on Market Street, the shops on King Street, a short walk to the harbor, to Rainbow Row, the Battery, etc. The staff are friendly and helpful. The breakfast was great and so too was the wine and cheese hour. You have to park about 2 blocks away in a parking...\n\n\nMore  \n\n\n", "\nIf you want a lovely inn that offers a great breakfast, afternoon drinks and refreshments, and puts you in the heart of the historic city, this is the inn for you. The staff members were courteous and professional in every way. The rooms were nicely appointed and very comfortable. Wish we had more time to enjoy the garden courtyard and...\n\n\nMore  \n\n\n", "\nLiving only an hour away from Charleston, I visit frequently. This is my favorite place to stay. The value is great! Walking distance to everything, beautiful rooms and friendly staff. Owner even showed his appreciation for my boyfriend who is a Marine. :)\n", "\nWonderful hotel, great staff and all the bells and whistles. Perfect location surrounded by wonderful restaurants and shopping. Great tour carriage rides right outside the door. Roof top bar was perfect for evening breaks and we received coupons for beverages, which made it even better. Coffee and pastries in the hall every morning, everyone in robs getting breakfast made for...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/05/19/b6/41/a-view-from-meeting-street.jpg"}]
[{"category": "hotel", "review_count": "1542", "title": "Charleston - Days Inn Historic District Motel", "rating_string": "3.0", "address": "155 Meeting Street, Charleston, SC 29401", "review_list": ["\nWe had booked two rooms for the Chaleston Days Inn Historic District through a \"pet friendly\" booking site. My mother-in-law's dog became sick so we decided to push on through to get the puppy home as soon as possible. Despite an initial determination by the front desk staff that our reservation was non-refundable, when I spoke with the General Manager...\n\n\nMore  \n\n\n", "\nThis is an older motel, so it's not fancy like others in the vacinty....but it's clean, the staff is helpful, and the price is significantly less than those fancy ones. .. Our group has been coming here every year for 10 years or so because of a conference, and we leave our cars in place and walk. Since last year...\n\n\nMore  \n\n\n", "\nIt's a Days Inn- I'm rating based on that fact. I don't expect a four star hotel when I book a Days Inn, but for what it was, it well exceeded my expectations. The location could not be better- walkable to everything Charleston had to offer. Moreover, the parking was included and we had no issues. The room was quiet...\n\n\nMore  \n\n\n", "\nWe stayed at this hotel in November and in January. Both times we had great difficulty with the hot water, like NO hot water when we were wishing to take showers in the evening. After some delay the problem was mostly corrected. The water was never as hot as it should have been, and this happened on three different days....\n\n\nMore  \n\n\n", "\nI was amazed by the staff at the reception, the lady was very kind to write and point the popular places to eat on the map, she also allowed me to check in early. The reasons I have not given 5 rating are :\n1. No complimentary breakfast\n2. The rooms are closely attached and can literally hear the occupants...\n\n\nMore  \n\n\n", "\nStaff was great.. room not modern, Blowdryer not attached to wall, coffee pot outlet didn't work, roach inside water cup! Wish I would have spent the extra money and stayed in another inn!\n", "\nIt was a good location and staff was great. Basic amenities. Cleaning staff messed up a bunch: didn't leave new coffee service, didn't replace sheets/towels when replacement card used,etc\n"], "img_url": "http://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "806", "title": "La Quinta Inn & Suites Charleston Riverview Hotel", "rating_string": "3.5", "address": "11 Ashley Pointe Dr, Charleston, SC 29407", "review_list": ["\nThe room was clean and the breakfast area was also clean. Free shuttle to downtown for dinning or site seeing is a plus. The price was Great! Free parking. I will be using this La Quinta Riverview in downtown Charleston for future bookings in Charleston.\n", "\nYour standard La Quinta, but a great location for the money paid. Minutes away from historic district, but you don't pay historic district prices. They tried to charge a higher rate than what I had booked at through Trip Advisor, but when I showed them the email, they quickly fixed the problem.\n", "\nFirst, the pros. The hotel seems to have been renovated and the rooms are very nice and a fair price. The beds are very comfortable. The free parking and wifi are added bonuses. It was nice to be able to grab a free, quick breakfast in the morning. The front desk and breakfast staff are very friendly. The location was...\n\n\nMore  \n\n\n", "\nUnfortunately there had been a water line break in the main hotel so we were placed in the older adjacent section of the hotel, which isn't connected to the main building. While our room was clean and recently upgraded, I did not feel safe staying in a room that opened directly to the outside, especially when the deadbolt lock was...\n\n\nMore  \n\n\n", "\nOne of the best La Quinta's we have stayed. Super staff and our room was very clean and comfortable. Staff is breakfast area were the best We will be sure and make this our address when in Charleston in the future.\n", "\nStayed here twice on a round trip drive from DC to Florida and back. Pet friendly. Recently renovated interiors with modern decor. Large parking lot. Seems to be a popular hotel for the price. Reserved a marina view king size room in the main building both stays, which was recommended by other viewers. I highly recommend as I hear the...\n\n\nMore  \n\n\n", "\nThe bed is comfortable. It's the only good thing I have to say about my room. They need to spray for roaches. The new were building looks nicer. The older building is loud being located next to the connector. Lots of traffic to and from downtown may keep you up if you're a light sleeper.\n", "\nWe helped move our daughter to Charleston SC and decided to stay at this La Quinta Inn. We are so glad we did. This is where we will definitely stay whenever we come to visit our daughter who lives downtown. This location is perfect for being within minutes of downtown Charleston without paying the high prices of downtown. The manager...\n\n\nMore  \n\n\n", "\nBooked two rooms, \"Marina-side\" at higher rate through Expedia. Only got one on the Marina side and one overlooking a parking lot. Complained and told there is no such booking as a Marina side room (although it is still up on Expedia). Was told would be given a $40.00 rebate to be processed on checkout. Ar checkout they would not...\n\n\nMore  \n\n\n", "\nPleasant and cost effective location when visiting Charleston. Friendly Staff, and decent amenities. Shuttle service to the center city is convenient as parking can be a problem in Charleston. There is a lack of eating places in the immediate area, but downtown Charleston is a culinary delight, at all price levels.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/d4/57/57/exterior.jpg"}]
[{"category": "hotel", "review_count": "7", "title": "Motoryacht Southern Comfort Hotel, Charleston", "rating_string": "3.0", "address": "17 Lockwood Drive, Charleston, SC 29401", "review_list": ["\nReading the other reviews I am laughing at how old I have suddenly become when I look around and agree that this Yacht would probably be an EPIC place to have a raging Bachlor/ette party - except for the fact that the owners of this place clearly love their boat and don't want it trashed by uncaring, drunken douche/ettes.\nFor...\n\n\nMore  \n\n\n", "\nMy wife and I had been married about 4 months, and we went down in January to get out of Charlotte for the weekend, the weather was a little cold, but the boat was so nice. We took advantage of the free taxi into town and went and walked around the shops. The boat was clean and a great spot...\n\n\nMore  \n\n\n", "\nMy daughter just turned nine while we were on vacation in Charleston and we stayed on Southern Comfort for her birthday. It's a gorgeous vessel with lots of amenities and a great view! Chris, the owner was very accommodating with our scheduling and booking and promptly answered any questions I had. We had a WONDERFUL time! (My daughter even watched...\n\n\nMore  \n\n\n", "\nWe booked the yacht for my friend's bachelorette party for the weekend of July 4th. We've had the reservation for quite awhile and just a few days ago they informed us that we could not use the yacht because the last group caused too much damage to it. We are now stuck, 2 weeks out, trying to find a new...\n\n\nMore  \n\n\n", "\nI was very disappointed to learn today that the owner, Chris, of Southern Comfort Yachts cancelled our reservation because our reservation was for 9 women to stay on the yacht. The owner cited in his extremely short email that, \"The owners feel the yacht is no longer suitable for girls weekends.\" This is not only discrimination because we are women,...\n\n\nMore  \n\n\n", "\nLet me start by saying that we did truly enjoy our stay on the Southern Comfort, and had plans to return. However, the memory of our trip has been tainted by Chris, the boat owners after charges.\nOur trip coordinator works in vacation rentals, and had the due diligence to contact Chris is advance to make sure our balance was...\n\n\nMore  \n\n\n", "\nWe loved the ship and had a wonderful time until the owner charged our credit card for charges more than a month after our stay and confused us with prior visitors. we had such high hopes for a return stay once our daughter goes to college in Charleston but will know have to find different lodging.\nPlease beware and make...\n\n\nMore  \n\n\n"], "img_url": ""}]
[{"category": "hotel", "review_count": "12", "title": "Evergreen Motel, Charleston", "rating_string": "3.0", "address": "1909 Savannah Hwy, Charleston, SC 29407", "review_list": ["\nFor $55 per night what do you expect. It was super clean. Yes it was an old motel. But the econo lodge was $115 per night. We only slept in room. We were out and about touring etc. family running the place is super nice. We didn't need a pool, we didn't need a valet. We wanted a clean place...\n\n\nMore  \n\n\n", "\nNot a fancy place and a Lil out dated but found it to be very clean compared to Econo lodge up the road. The family running it are awesome. Will definitely stay here again.Have stayed at several hotels in the area and this I found to be best for the dollar,Gene, Louisiana\n", "\nA very friendly family run motel that was more than reasonably priced.The room had double beds,cable,internet,a microwave,and a small refrigerator.It was immaculately clean and I wouldn't hesitate to book a room again.\n", "\nWe spent 2 nights here & had no issues at all. Yes the rooms are run down and not the prettiest looking but for $50 a night who cares. The sheets, towels & bathroom were really clean. The AC worked really well, the shower pressure was fantastic and the owners really lovely.\nThis is a budget motel & you get...\n\n\nMore  \n\n\n", "\nVery nice rooms, staff were friendly, close to downtown, and surrounded by many restaurants. Also shopping areas are very close and convenient stores. I would recommend this place to anyone traveling by in Charleston!\n", "\nHad room at EconoInn down the rode but it was smelly and creepy. Got our money back and Evergreen was the only motel left that had a room. Next time I'll pay 200 a night. The staff was friendly until they got our money. Never have I been mistreated like this before. They wanted to tow my car because I...\n\n\nMore  \n\n\n", "\nWe were driving through Charlestown. This was the ONLY motel or hotel with vacancies. Yes... we tried basically every single place. There were no special events going on that weekend so it was puzzling why everywhere was booked solid. Charlestown is just severely under-motel'ed, I guess. Do not expect to find lodging there if you are just passing through!\nThe...\n\n\nMore  \n\n\n", "\nWe had reservations at the EconoLodge up the road but there was NO way we were going to stay there--it was creepy, scary, and dirty. The evergreen was our miracle and salvation. It is owned by a family it was safe and clean and cheap. There are no bells or whistles, just honest people attempting to find the American dream....\n\n\nMore  \n\n\n", "\nI was in Charleston to visit with my daughter, and did not make reservations in advance. I arrived in town about 4:30 on Saturday,and the first two hotels I stopped at either did not have a vacant room or were outrageously expensive. As I went down Highway 17, I saw the Evergreen Motel. It is old, but the outside looked...\n\n\nMore  \n\n\n", "\nWe spent our first night here before moving on to a B&B. This was a nice way to balance the budget. Even with the huge SEWE expo in town, the rate was only $43. The rooms are fairly large, and the furnishings are old, but not beat-up. The bathroom is small but clean. I did forget to ask for a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-p/01/af/f8/9b/evergreen-motel.jpg"}]
[{"category": "hotel", "review_count": "Unknown", "title": "The Dewberry Charleston Hotel", "rating_string": "Unknown", "address": "334 Meeting Street, Charleston, SC 29403", "review_list": [], "img_url": ""}]
[{"category": "hotel", "review_count": "Unknown", "title": "InTown Suites Charleston Northwest / I-26 Hotel", "rating_string": "Unknown", "address": "7371 Mazyck Rd, Charleston, SC 29406", "review_list": [], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/01/ac/f6/ac/intown-suites.jpg"}]
[{"category": "hotel", "review_count": "9", "title": "InTown Suites Charleston Southwest Hotel", "rating_string": "2.0", "address": "2236 Savannah Highway, Charleston, SC 29414", "review_list": ["\nProceed with caution. The motel insists that it has 24-hour security however even if it does, it still manages to attract a criminal element although in a safe part of Charleston. I suppose the low rates attract long-term guests who find the motel convenient to use for illicit purposes. The online police reports speak for themselves. On Wednesday, March 25,...\n\n\nMore  \n\n\n", "\nWe wanted to visit Charleston for two weeks and had to find a way to not break the bank. This filled the bill. Our room was very clean. Bare bones no frills but found the mattress comfortable and loved having the stove and full sizes refrigerator. We come down to visit beach walker park on kiawah and see the sights...\n\n\nMore  \n\n\n", "\nWe had to buy ant spray for the ants in our room. We had roaches all in the \"kitchen\" area. The microwave didn't work properly. There is no wi-fi! The laundry facility was out of order. There were beer caps under the beds. Even though we had 4 people in the room, we were told that we could only have...\n\n\nMore  \n\n\n", "\nHusband is staying here for a 6 weeks for work. Clean room, queen suite is remodeled with granite countertops. They do not provide dishes, silverware or pans in the unit. Sheets were very thin so he bought a couple sets and are using those. Mattress in queen suit is new. Good value for the money.\n", "\nThis motel chain is the worst place i have ever seen. There were cockroaches swarming all over i had to combat them daily!! This place is dirty i had to throw away several items after my stay for fear of roach eggs in my stuff. i had to leave my room so they could clean, and my deposit has not...\n\n\nMore  \n\n\n", "\nbeds are very uncomforable the front desk should offer inftormation about the town of Charleston like bus routes schedules places to go and things to do and just be a little more friendly a smile never hurt anybody or a hello .\n", "\nHorrible!!! I am writing this review at midnight, becoz i cannot go to sleep because of bed bugs, dirty bed sheets.Internet sucks.I cannot check out as i had paid for a week.Please stay away from this Motel.\n", "\nLocation: 5035 North Arco Lane, North Charleston, SC; General Manager: Nicole Ortiz\nThis was the second time that I've stayed at a weekly hotel. The first time was tolerable, but this time was miserable. A few minutes after check-in we noticed two roaches on the floor of the bathroom. One was twitching, the other was dead. I decided to use...\n\n\nMore  \n\n\n", "\nAfter helping family relocate from West Ashley SC we stayed at the Intown on Hwy 17S. This was the biggest mistake I have ever made and I have traveled all over. Unfortunately for us, this was Spring Break week and all accomodations were full and this was our only choice.\nThree people (the maxium) stayed in our room for two...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "107", "title": "Motel 6 Charleston South", "rating_string": "2.5", "address": "2058 Savannah Highway, I-526 at US 17, Charleston, SC 29407", "review_list": ["\nVery comfortable beds and bedding was very clean. Overall, this is a cheap motel and feels like exactly that. Right beside the expressway so it is very convenient. About 30 minutes to Folly Beach, 40 to Kiawah Island.\nNice clean pool!\nIf you are looking for a low end hotel, just a place to sleep for the night, this is...\n\n\nMore  \n\n\n", "\nI stayed on the ground level by choice but I was not actually expecting all of the super neatness and 5 star customer service that I received. They are the most accurate, insightful and professional staff that you come across any day of the week paying 10 times more. The General Manager named Ralph saw to it that all my...\n\n\nMore  \n\n\n", "\nWell, they've gone up -- from $40 my last stay to $50 today. But, my goodness, they are courteous at the front desk. As you may know, Charleston SC was voted \"most courteous\" destination in some travel mag, so now all the rude Yankees who moved down here to work the hospitality trade have become Southern gentry; and some of...\n\n\nMore  \n\n\n", "\nThis was the third place wifee and I stayed on our 17 day on the ground trip across Georgia, S & N Carolina. This place is hard to find, especially at night. There is a McDonald's right before the driveway to the hotel. A pedestrian walkway between the properties makes it nice to get breakfast. Reggie at the front desk...\n\n\nMore  \n\n\n", "\nHaving read the latest reviews, I was about to cancel my visit. Traveling with my dog, I knew my options were limited for an inexpensive hotel for the night. I wanted a place that was relatively close to the beach, ~20 minutes to Folly, inexpensive, and dog friendly. This Motel 6 met all the criteria. I decided to give it...\n\n\nMore  \n\n\n", "\nI only needed about 6 hour of rest, so I checked into this Motel 6. I took a shower, turned down the covers on the bed and this is what I found.(pictures says a thousand words clearly,see pictures below). FILTH!!!!!!!!!!!. I requested, A ROOM CHANGE. BENIFIT OF THE DOUBT, ( I sprayed the mattress with be bugs and flea spray).........\n\n\nMore  \n\n\n", "\nStayed for one night to sight see charleston and take a night to rest on a road trip back home. ....Atleast the room was clean which is what was most important to me.......TV did not work, all channels fuzzy.....cost 60 plus tax on a weekend in september. Cheapest motel I found in the area. About 6 Mikes from downtown area.\n", "\nI stay at the one on savannah hwy ,the first couple night were alright but the last night they wash our cover and a bed bug was on the. Covers .Now he could have walk in or was brought in any way we left in the middle of the night .The manger Paul Walla e said he would refund that...\n\n\nMore  \n\n\n", "\nI have never stayed at a Motel 6 before, and I must admit that when I pulled in I was a bit skeptical. Not because of the property, but because of the other guests that were hanging out. Check in was fast and friendly. The room was spotless! At one time I was a Director of Housekeeping for a major...\n\n\nMore  \n\n\n", "\nNot too bad for a two star hotel. You're obviously not going to be staying at the Grand Majestic, so don't expect too much but it is well over bare-bones. We probably lucked out, but our room was in very nice condition! There were no bedbugs in the room did not stink. The TV was...old but it worked. The showers...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/07/28/54/45/motel-6-charleston-south.jpg"}]
[{"category": "hotel", "review_count": "30", "title": "Quality Inn Hotel, Charleston", "rating_string": "1.5", "address": "2237 Savannah Hwy., Charleston, SC 29414 (Formerly Econo Lodge Charleston)", "review_list": ["\nI've been in places cheaper than this hotel and they have much better rooms than this. First thing I saw the soonest I walk in was how nasty the carpet was among the edges of the room, then the Cockroach, dust here and there, the table it wasn't even clean. Total of Cockroaches that I found 2. This pictures are...\n\n\nMore  \n\n\n", "\nBasic. Clean. Economical. Friendly service. Close to the airport: 3 miles from the Charleston, NC airport.\nWe stayed here for one night. Was impressed with the cleanliness of the room. A very basic motel room, but a way to save money. included soap only. Bring your own shampoo, etc.\n", "\nNot actually pet friendly. The guy at the counter was rude and cranky. The room was gross. One of the dresser drawers were broken. Dusty. Awful awful awful. We left immediately and stayed at the motel 6 down the street, MUCH better for a one night stay\n", "\nThis is the worst Choice Hotel's MOTEL I've ever stayed in, its a dump. Choice should not have its name on this hotel. I'm a Platinum traveler and this hotel does them NO justice at all.\nIts A DUMP!\nI don't smoke, but I was given a smoking room. I went up to ask for a non-smoking room but was...\n\n\nMore  \n\n\n", "\nMy husband and i decided to set out on a drive south and decide where we will go, decided to stay in Savannah booked, Beaufort booked, Charleston, everything we wanted booked.Had to look at less than desirable places. Worried when we booked. Went up to our room and opened our door. Wow i thought we were at a different hotel...\n\n\nMore  \n\n\n", "\nStincky, barely clean. A smoky smell, dirty bathroom and dusty carpet. The first room I was given has a c... on the handle. And that for around 80$. Avoid it. Everything else was booked, even this one was quite full.\n", "\nAs I stepped into the room the smell was horrible. My kids were so excited to be on vacation I didn't want to ruin it but I knew I could not stay there, my husband ran out to get the boys some food and I stayed in the room to make an inspection.... First the bed. There was a faint...\n\n\nMore  \n\n\n", "\nUnfit, bugs in beds, dressers, on walls. Carpet had drywall slabs placed into missing areas in walking path to bathroom, not vacuumed for days as crap was along bedspread lines on floor. Run away! Can't even relive the gross bathroom -get ill thinking about the conditions!\n", "\nI am not a fussy traveller. I am used to staying in rodeway inns and econolodges, and other budget hotels; but this one really needed a little TLC.\nCheck-in: arrived at about 1:00am. Staff member was on the phone with a personal call. Seemed annoyed to be interrupted. Process was quick but staff was a little rude and unfriendly.\nRoom:...\n\n\nMore  \n\n\n", "\nGot here late at night and we should have known to move on by the smell in the lobby... At first he gave us a smoking room and it wasn't until I made up a story about being allergic to cigarette smoke that he magically found a non smoking room. The chain lock on the door had been broken off,...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif"}]
