{'category': 'hotel', 'review_count': u'1597', 'title': u'Harbourview Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'2 Vendue Range, Charleston, SC 29401', 'review_list': [u"From the moment we pulled up the staff went out of their way to welcome us. The room was beautiful and we wished we could stay longer. Loved the extras - afternoon tea, evening wine and cheese, later cookies and milk. It couldn't have been convenient to restaurants, shops, and sightseeing. Thank you all!", u'We stayed at the Harbour View Inn for two nights, when we checked in we were upgraded to a large and beautiful suite! Two large four poster beds, a big room with lots of light, space and a beautiful bathroom, filled with gorgeous products! Our car was parked in their garage with valet, which we thought was quite expensive at...\n\n\nMore', u"This hotel is in our top 5 world-wide, although my wife feels it's top two. The service is impeccable, the amenities are first rate and the bed is incredible. The bathroom has a shower that urges you to stay until the hot water runs out, which, of course never happened. Breakfast delivered to the room (they even call to tell...\n\n\nMore", u'The most amazing bed! Also, their WiFi speeds were good (about 5 MB download). The view is amazing from the room, they include a wine and cheese reception, and fresh baked cookies in the evening. Plan on paying $24 a day for their valet, or parking several blocks away for less.', u'As far as the hotel goes, it is over priced.For the majority, lovely efficient staff. However, having booked a waterview room & getting a brick building view with about 1" water viewed I was less than happy. We arrived exhausted so went to bed, the next morning (Tue 20th Sept \'2015) we went to reception to complain - they said...\n\n\nMore', u'The Harborview Inn is a charming, well appointed and comforting home away from home that epitomizes southern hospitality at its best. My wife and I can offer an enthusiastic recommendation to use it as your base of operations while visiting Charleston. It is situated within easy walking distance of excellent restaurants, charming nineteenth century residences and historic buildings. Ask for...\n\n\nMore', u'Harbourview Inn is located within an easy walking distance to the Market area, shops, and area restaurants. Our room was large, clean, and quiet with a great view of the bay and park. We stayed here for 2 nights - January 20-22, 2016, at a very good price which included valet parking and breakfast. The breakfast was delicious with fresh...\n\n\nMore', u'This is our fifth time visiting your hotel. Everything is top notch, one of the most relaxing and comfortable places to stay. The location is great and walking every morning along the battery is an excellant way to start a day.\nComing back to our room for a nutriously breakfast is also a plus. The wine and cheese in the...\n\n\nMore', u'My husband and I stayed at Harbourview earlier this month for an overnight getaway without our children. We saw it on a Travelzoo deal and booked it as part of our Christmas present to each other. We were very impressed! From the moment we arrived and checked in, we felt like valued guests. The front desk and valet staff were...\n\n\nMore', u'A plus - first class service - Amazing location - the views are outstanding - love the hot tea, fireplace in the room - free cheese and cracker everyday - free cookies every night - if you are looking for a great place to stay - this is it! You will be very happy!!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/ee/d9/78/harbourview-inn.jpg'}
{'category': 'hotel', 'review_count': u'341', 'title': u'Creekside Lands Inn Motel, Charleston', 'rating_string': u'3.5', 'address': u'2545 Savannah Hwy, Charleston, SC 29414', 'review_list': [u'The good points: The tidal marsh is beautiful and the whole place if fairly attractive, with nice landscaping and big shady trees in the parking area. We saw two women at the front desk and both the PM and AM shift were very friendly. There are wide stairs from the parking lot to the first level of rooms. These are...\n\n\nMore', u"I stayed in this hotel for nearly a month after being displaced from my home. After driving through the local extended stay hotel, I didn't feel it would be safe and spent one night here to check it out. My room was very clean, comfortable, and quiet. I decided to stay and ended up here for nearly a month. I...\n\n\nMore", u'Nothing fancy. Matress was broken down on the sides and bottom sheet was a flat sheet that would move during the night. Bathroom was small and a pink color was seen on the shower head which indicates bacteria. Peeling paint and patched tub present. We travel a lot on business so I take discount rooms whenever available. Bottom line? No...\n\n\nMore', u'I chose this place because it seemed to be the cheapest around that looked decent on line. I was pleasantly surprised that the exterior of the motel did look kind of like an inn and was on the side of a creek - very pretty. I also thought the location was convenient and navigable and felt safe. The interior of...\n\n\nMore', u'I made reservations 6 weeks in advance because I use a wheelchair so getting around was difficult. We arrived hours before check-in and they gave our room away! They said the couple who stayed their last night wanted to stay another night and they were handicapped. I suggested putting them in another handicapped room and giving us our reserved room...\n\n\nMore', u'We stayed at the Creekside Lands Inn on November 7, 2015. Because of the reviews, and the price, I was really holding my breath. However,that was not needed. The office staff was friendly and brought up towels and wash clothes and she was pregnant. The room was bigger than our previous night at the Hampton Inn, in Columbia. There was...\n\n\nMore', u"We stayed here in May 2015 and were surprised when we arrived to find that it was a motel. When we had checked the website prior to booking, nowhere did it mention that it was a motel. On arrival, we signed a form to say we wouldn't smoke and if we did, we would pay a fine. We got to...\n\n\nMore", u'This is a simple motel that could use a little freshening, but the lovely grounds make up for that. Watching the beautiful herons and cranes along the creek was a delight. Pleasant and helpful staff was a plus. When we checked in and the woman at the front desk saw that we were seniors, she changed our room to a...\n\n\nMore', u'Honestly, for the price, I expected much less than what we got. We stayed Fri, Oct 23 and Sat, Oct 24th. We were blown away with the property. Great views, awesome pond with dock access and fishing, the bed was spectacular. Really happy with the choice. The location was near perfect for our trip, as it was centralized to the...\n\n\nMore', u'The date says 2014 but it was around may of 2013.. with all the other hotels being high on rates we found this one that was around 80 a night.. the grounds were very nice and well kept. the marsh area was very nice and had a little gazebo and mini dock type area to fish off of. The room...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/03/cc/59/de/creekside-lands-inn.jpg'}
{'category': 'hotel', 'review_count': u'574', 'title': u'Hampton Inn & Suites Charleston / West Ashley Hotel', 'rating_string': u'4.0', 'address': u'678 Citadel Haven Drive, Charleston, SC 29414', 'review_list': [u'Nice enough hotel about 5-6 miles right outside Charleston historic district. Nothing special to tell. The staff was friendly. Breakfast buffet had just the basics but it was clean. Rooms are dated and in need of upgrading. Fast food close by. Target, CVS, Wal-mart close by.', u'Stayed here for one night before our cruise. The hotel is a nice location with lots of food options nearby. Transfer to port was easy in vans and parking lot was safe for our vehicle. The staff was very friendly pointing us to local attractions to visit.', u"This Hampton Inn is more like a Hilton Garden Inn or Homewood Suites. The amenities and build lay out far exceed all of the Hampton Inn's I've stayed at in other states. For example, there is a complimentary wine/beer happy hour from 5-7 weekdays; this is more akin to a Homewood Suites. It is very clean and the housekeeping service...\n\n\nMore", u'We arrived early in the evening and checked in at the front desk since the room has already been selected in advance using our HHonors member account. This is the first time that we selected our room using online process so not sure if there is anything else needs to be done at the front desk during check in process....\n\n\nMore', u'Enjoyed a good breakfast. We were impressed with the attention that the buffet ladies took making sure the buffet was topped up and that the guest was happy. Also appreciated clean laundry facilities. A favourable experience.', u'Friendly , clean, helpful, I could just go on and on. Great hotel , wonderful staff and the Japanese Steakhouse next door is really good and easy to get to, without having to get back in the car. The breakfast of the morning is great, hot coffee, hot food, lots of options especially for a hotel breakfast. My picky husband...\n\n\nMore', u'This Hotel was extremely nice, I paid a little extra for a suite and found it to be well worth the extra money. I wish I could have stayed two nights It was well worth the little bit of extra money I paid.', u"I was very impressed with this hotel. There's a happy hour with free wine and beer and light finger foods that was great. I really thought the hotel was new but it's not - they've just kept it up very well. I can't say enough about the friendliness of the staff - they went above and beyond to help our...\n\n\nMore", u'The Hampton meet my expectations. MY room was clean and all the appliances worked. The hotel staff were professional and addressed all of my needs and questions with a minimum of fuss. I was able to secure a room at the last minute as my wife was seriously ill and was transported by ambulance to the Medical University of South...\n\n\nMore', u"This is the prettiest Hampton I've stayed in. The lobby is fantastic, and the rooms were very well maintained. It's in a quiet area, and near a lot of amenities. I would (and will) definitely stay here again."], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/7a/d6/df/enjoy-your-breakfast.jpg'}
{'category': 'hotel', 'review_count': u'104', 'title': u'Sleep Inn Charleston Hotel', 'rating_string': u'4.5', 'address': u'1524 Savannah Highway, US 17 S, Charleston, SC 29407', 'review_list': [u'I stayed here while vacationing in Charleston. The room was clean, the staff was friendly, the breakfast was free, and the wifi was fairly quick. The hotel is also pretty close to many attractions and good restaurants. The only complaint is that being along the Savannah Highway may make entering and exiting the hotel lot a little tricky when traffic...\n\n\nMore', u"I recently relocated to the area and stayed at Sleep Inn Charleston while apartment hunting. The woman who checked me in, Sad\xe9, was amazing. She went as far as to give me the number of her landlord. Because of the apartment hunting, I was unsure how many days I'd be staying at the hotel and she was incredibly flexible and...\n\n\nMore", u"We stayed here and did the snooze and cruise package. For the price you can't beat it. Late check out as well as breakfast and comfortable rooms. The shuttle to and from the cruise port is wonderful, they clearly have done it a thousand times. We were off the boat and back to our car at the hotel by 830....\n\n\nMore", u'I have stayed at Choice Hotels from Ft Lauderdale to NYC. I have NEVER had the experience I had at this location. ALL staff friendly and cordial. ALL cheerful, saying good morning upon entering building. I have no clue what the manager is doing but apparently it is GREAT. HE SHOULD BE PROUD TO HAVE THESE EMPLOYEES. ...GREAT PLACE TO...\n\n\nMore', u'Friendly staff, close to fantastic restaurants, and a good price all made this a great place for us to stay during our recent overnight trip. A very nice breakfast, including waffles & omelets, is available until 10:30am on the weekends, allowing extra time to sleep in after a late night enjoying Charleston. The noon check-out time is great for relieving...\n\n\nMore', u'Wanted a place near historic downtown Charleston at a good price. Sleep Inn was near everything that we wanted to see and was a good value for the time we spent there. The hotel and more importantly, the room, was clean. The staff was very friendly and answered all of our questions about Charleston in a knowledgeable manner.', u'This was a great place to stay for our one night stopover in Charleston. It is easy to access the historic downtown area by car from the hotel. The staff were friendly and professional. The furnishings were comfortable. The breakfast was good. We had limited choices for lodging because we had our pet with us, and this hotel exceeded our...\n\n\nMore', u"Best for the price hotel. Well kept with friendly staff that we found always helpful. Very nice breakfast, and breakfast area. Shower only bathrooms with pocket door, but not an issue. Could probably do something to improve the door key card so they don't get erased so easily by magnetic strip items. Over all our stay was great. I wouldn't...\n\n\nMore", u'Hotel was in a very good location 10 minutes outside of downtown Charleston. Hotel was clean staff was friendly and parking was ample. Breakfast was served every morning with a good selection. Rooms are small but pleasant and clean overall a excellent experience.', u'We received prompt, professional service from the front desk staff, breakfast attendant, and our housekeeper Martha. Stayed here for convenience to James Island and peninsula and affordable rates. Will return for those reasons and because we were treated so well.\nI will say that the mattress was as hard as a rock. Not what I would prefer.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/06/fe/25/db/exterior.jpg'}
{'category': 'hotel', 'review_count': u'484', 'title': u'Residence Inn Charleston Downtown/Riverview Hotel', 'rating_string': u'4.0', 'address': u'90 Ripley Point Drive, Charleston, SC 29407', 'review_list': [u'We were in a 2 bedroom suite and it felt like a spacious apartment with modern furnishings. The hotel is a 5 minute drive from downtown Charleston and within 30-40 minutes of IOP and Hilton Head beaches.', u'My experience here was one of the best that I had on my trip through South Carolina. The parking lot was spacious and free of charge, the room was clean and comfortable (with a balcony I might add), there was shuttle service to the historic district, and the two young ladies at the front desk were super friendly. Plus... there...\n\n\nMore', u'Rooms are spacious, and very clean. Free parking and yummy full (free) breakfast. Free shuttle to downtown after 530pm which saves on trying to find a space to park.\nNice that you can bring your pet for an extra $100 because kennels cost much more than that!\nSuper quiet, not a party spot so perfect for families with small kids.', u'My husband and I spent a few days between the holidays in Charleston, and since we decided to take our two Chihuahuas, options are a bit more limited. We decided on the Residence Inn and it was a good choice.\nI had reserved earlier by phone, just to make sure I got a pet friendly room, and the person who...\n\n\nMore', u"We enjoyed our stay here with our dog. The room was nice and clean with plenty of space for four of us (plus dog) for a few days. Great small kitchen with all basic supplies, too. There's not much within walking distance other than a small marina and plenty of lawn space, however everything is close by. Downtown Charleston is...\n\n\nMore", u"We just returned from a 4 day stay at this lovely hotel. Very nice property, nice clean and large rooms, can't beat the free breakfast and dinner on Monday, Tuesday nights and dessert on Wednesday nights all included in the rate.\nThe rooms were clean, the staff very friendly. Just an enjoyable stay.", u"I've had the pleasure of staying at this Residence Inn for the last few months while on a company business trip. All I can say is the people here really make the difference and go the extra mile to keep their customers happy. They also take the time to get to know their long term guests which makes it a...\n\n\nMore", u'Just finished up a three day business trip to Charleston. This is my favorite Marriott on business or personal travel in the Carolinas. I have been staying at this location for over eight years now business and pleasure. The Residence Inn is in a great location only a few minutes from downtown. The property has gone under a major renovation...\n\n\nMore', u"The best part of this hotel is the shuttle service downtown. Decent continental breakfast. The rooms were tired and you can get a view of the ugly roof out your window as I had. Did also hear dogs barking and smelled wet dog as well. This would not be a hotel I'd return to.", u"My parents and I are visiting Charleston for a quick two-days before I run a half-marathon in Savannah. We arrived late Wednesday night after flying into Savannah from Minneapolis/St. Paul, and that's when the hotel started to exceed our expectations. Upon check-in, the hotel staff let us know that there is a free shuttle that takes guests into the historic...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/46/94/51/riverview.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'873', 'title': u'Charleston Marriott Hotel', 'rating_string': u'4.0', 'address': u'170 Lockwood Boulevard, Charleston, SC 29403', 'review_list': [u"I would love to say that enjoyed my stay at the Marriott, especially the staff they make you feel so warm and friendly. I meet an awesome person that works at concierge lounge there her name is Tia; she was so nice and friendly, she's a native of Charleston and was very pleased to help everyone that walks into the...\n\n\nMore", u'Best Friend Getaway.. Awesome location, Beautiful Views. Conveniently located. Looking forward to spending the weekend in Historic Charleston. Tours, Good Food, Lots of Drinks.\nTyler at the front desk is amazing. Will be back to visit.', u'This hotel is a winner (perhaps even my favorite in 5 years of traveling around the US for work).\nQuality, comfortable rooms.\nEnormous work out facility (have never waited in the past 6 months of coming here).\nStaff that remembers you, and sticks around (no revolving door of staff which means they are happy, too).\nA shuttle to the historic...\n\n\nMore', u'Nice night. Wonderful meal. Comfy room always. My favorite beds going!! I came across a personal hindrance, but, the staff helped me get through the night. I love hot water! Nice well priced location and large, clean relaxing by the big pool a must!', u"It was a getaway for my wife's birthday having dinner at her favorite restaurant Peninsula Grille and a day of shopping on King St. We have stayed at this Marriott a number of times and enjoy the concierge level where a great breakfast is included, I recommend this hotel highly.", u'Not far from Downtown Charleston, this hotel is a full-service Marriott. Quiet and comfortable. Good service, nice restaurant. Park your car and take the shuttle to Downtown, eat and drink and meet the shuttle, which runs every 1/2 hour. A good choice, not too far from the action. Close enough, but not too far away.', u'i went to Charleston for a 2 day stay & turned into 7.this hotel was great,nice clean room,excellent friendly staff,bar/restaurant has great wings & drinks,& recommendations for where to go,Karen at the bar was awesome,if i go back it will be here.', u"I was there over the Christmas holiday and the hotel was beautifully decorated. The staff however was the most outstanding feature of this hotel. They could not do enough for me and I am so grateful. Especially Richard, don't know last name and Price, don't remember first name. I understand why you gentlemen moved to Charleston and stayed. Loved the...\n\n\nMore", u'somewhat dates, but well maintained. room was well appointed, clean and had a fine river view off small balcony. downtown location allows for easy access to historic area and interstate routes to beaches and all avenues into and out of the city. staff are proud of their hotel and it show. we account wait to return.', u'Several years ago we started a tradition of jumping in the car the day after Christmas to embark on a family roadtrip vacation [call it forced togetherness]. We live in Tampa so Charleston was on the outer perimeter of how far everyone is willing to sit in the car. This Marriott truly made our stay! Charleston is a wonderful city...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/0a/2a/01/fe/exterior.jpg'}
{'category': 'hotel', 'review_count': u'447', 'title': u'Kings Courtyard Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'198 King Street, Charleston, SC 29401', 'review_list': [u"We were visiting Charleston for the weekend and brought our dog. He is normally allowed in other hotels but we pay a huge fee and the hotel doesn't do anything to make him feel at home. The Kings Courtyard staff was wonderful -- everyone was polite to us and they even had extra bowls, treats, a toy, and a list...\n\n\nMore", u'We chose the Kings Courtyard because of its central location and historic vibe. We were not disappointed. After arriving on Thursday afternoon, we parked our car, only retrieving it two days later when we left. All of historic Charleston--walking tours, churches, Fort Sumter boat trip, aquarium, shopping, and many restaurants--were within a fifteen or twenty minute stroll. We enjoyed the...\n\n\nMore', u"We have been staying in the same room for 25 years. It is a king with a fireplace and canopy bed. It is the older section of the hotel. You can walk to most of Charleston's historic attractions and world class dining. You can park the car and not move it for days. I cannot recommend this inn enough!", u"Lovely place to stay.\nNice wine and snacks at happy hour. Comfy bed.\nI love the open air space in the middle of the hotel. I felt like I was in Italy or France...at least what I imagine a hotel in Italy or France..I haven't been there yet. Haha.\nFriendly staff! Walking distance to all shops. Right on the main...\n\n\nMore", u"We stay on the second floor, typically on the road side to watch things going on. The rooms are very nice, very comfortable. So many places to eat and drink within a minute walking. We typically rent a car to leave for sight seeing, but if you want to relax, eat, drink, shop, don't bother with a rental car.", u'This is our fourth time staying here and really we never consider staying anywhere else. It is a fantastic place with Charleston Decor and most especially Charleston hospitality !\nAll of the people here are wonderful, so warm and friendly and a most delicious complimentary breakfast is offered. It is the place to stay in Charleston.', u"My wife and I recently spend two nights at the Kings Courtyard Inn. Due to its age, it's a little quirky inside, with numerous interior courtyards, and some uneven floors. We had a fireplace in our room and a king size bed, although it was a little tight getting into one side of the bed due to the fireplace mantel....\n\n\nMore", u'we stayed at this inn for a week and really enjoyed our stay. The staff was friendly and helpful. The accommodations were very comfortable. The breakfast was just what we needed before we began walking around the city and the wine and cheese was a nice way to relax before going out to dinner. The location is also great we...\n\n\nMore', u'We stayed in this little b&b for one night, and we really liked it. We were about 10 minutes late for cheese and wine, so we were a little sad we missed out on that, but we did enjoy the sherry that was out for the evening. That was a lovely touch for when we returned from dinner. The location...\n\n\nMore', u"Great location for seeing all the sites and the free parking was a real plus even though we parked the car and didn't use it again for the whole time we were there. Room was nice and the staff was very helpful."], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/02/ac/3c/ce/filename-kings-courtyard.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'506', 'title': u'John Rutledge House Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'116 Broad Street, Charleston, SC 29401', 'review_list': [u"The Rutledge house is a wonderful place to stay when you visit Charleston. It's located close to wonderful restaurants and shopping but it's very quiet and comfortable. The concierge was very helpful. They had great recommendations for restaurants and things to do. Room 19 in the carriage house was great and had everything we needed. Afternoon tea and breakfasts were...\n\n\nMore", u"My friend and I spent five days at this Inn. It's lovely, so many good things to say about it! First, the concierges (Jim, Mike, and Cici) are top notch. Every question we had--and we asked a lot) was easily and quickly answered and/or personally addressed by them. By the end of the trip, they felt like old friends. Breakfast...\n\n\nMore", u"First of all, we agree 100% with juliemariegoldilocks' review! We, too, spent four nights at the Inn over Christmas and enjoyed every moment. Some key points to consider:\n- The Inn is centered in the heart of the city on Broad Street and it's an easy stroll to most historical homes and restaurants\n- The interior is well maintained and...\n\n\nMore", u"Apart from a nice location, this B&B offered nothing special. In fact, one morning it didn't even offer breakfast. We were told that the chef didn't show up. But only told that after we inquired, twice. It took a while to learn about the problem because there is ONE desk person who is also the concierge and reservations-taker. Although I...\n\n\nMore", u'We were looking for a pet friendly way to enjoy the center of Charleston. Trip Advisor guided us to this historic Inn. It was a congenial choice for my husband, me and our two dogs. The staff is responsive, informative and friendly. Breakfasts are delicious, customized and can be enjoyed in room. Pets are well treated. Take your afternoon tea...\n\n\nMore', u"We stayed at The John Rutledge House Inn for 4 nights over Christmas, and hated having to leave! The location is perfection. When you walk out the front door any time day or night, head in any direction, you find charm, beautiful architecture, lovely shops, good restaurants, it couldn't get any better! We are huge fans of historic locations, so...\n\n\nMore", u'Stayed one night wish we could have stayed longer traveling to see family. Brought our three year old and dog and stayed in the carriage house. Very welcoming and accommodating staff. Inn is located in the heart of the city and within walking distance to shops and restaurants. Highly recommend it!', u'We enjoy staying at The John Rutledge House Inn each time we visited Charleston. The Inn Keeper, Cathy Leslie is a gracious host and her staffs is personable and accommodating. They give you that southern hospitality of welcoming you. The John Rutledge House Inn is also a bed and breakfast inn. Good choices on the menu, try the southern biscuits...\n\n\nMore', u"The John Rutledge House never disappoints. We've stayed there several times and are as enchanted by the architecture as the history. There is something about sharing the same space as a signer of the Declaration of Independence that gives one a sense of connection to past.\nOn this visit we were fortunate to enjoy room number 8, which is spacious...\n\n\nMore", u"From the moment you arrive in front of the Rutledge House Inn you know immediately it's going to be an amazing experience. The staff is warm and welcoming and the Inn is beautifully appointed. Clean, sophisticated and warm. We can't wait to return!"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-p/08/06/45/a4/john-rutledge-house-inn.jpg'}
{'category': 'hotel', 'review_count': u'364', 'title': u'Hampton Inn Charleston - Daniel Island Hotel', 'rating_string': u'4.5', 'address': u'160 Fairchild St, Charleston, SC 29492', 'review_list': [u'I really enjoyed my stay here. The hotel has been recently remodeled and is very nice. Free breakfast in the morning and coffee all day, plus cookies if you are into that sort of thing. I had a great chaise lounge in my room that was a perfect place to work. The staff is very very nice and helpful and...\n\n\nMore', u'Very nice interior with a bright modern bathroom. Excellent customer service. Very clean. The guy at the front desk called us shortly after arrival to make sure everything was fine. Was recognized as a HHonors member.', u'About a 25 minute drive to downtown Charleston but well worth it. The hotel was very clean and updated (possibly new) and the staff were very pleasant and actually seemed happy to be there. The breakfast was a real spread. Lots of options, stocked, and maintained. Would definitely stay again. The rates were very reasonable.', u"Been for 2 nights. We switch the room 3 times because they didn't sucseed to turn off the a/c .\nThey still didn't did that.\nthe recupiant didn't remember to tell the shutel to bring us back to the room unless we called 3 times.\nThe hotel is empty but they won't gave us a late chech out.\nWon't come...\n\n\nMore", u'Stayed here the weekend of December 18. We were in town visiting family who live on Daniel Island. What a perfect location, as we were a minute drive from their home! We were greeted with smiles and a warm welcome from the front desk staff. The room was perfect for our family of 4 (myself, my husband and two small...\n\n\nMore', u'We will definitely visit this Hotel and Charleston again! We only got to stay here overnight as we were leaving on the cruise for the Bahamas. The Service, rooms and Hotel as a whole were extremely nice, clean and friendly! What a great place! We have already started making plans to come back and visit, as well as stay at...\n\n\nMore', u'We were visiting Daniel Island so it was a perfect location. The hotel is new therefore it is beautiful condition. Staff very friendly and helpful. Higher quality than a normal Hampton Inn. Breakfast was great and lobby was inviting.', u'I planned to stay two nights and ended up staying an extra night due to the outstanding service and room at the Daniel Island Hampton Inn. Super clean (the bath tub was sparkling clean), quiet, friendly front desk etc.', u'Great time and fun had by all. I highly recommend this Hampton Inn to anyone who is looking to stay on Daniel Island. The staff was very accommodating and friendly to all of our needs. They had a service shuttle that took us to the Daniel Island Country Club and they will even take you the Airport if need be.', u'We were in town for one night for a wedding. The hotel is in a very nice area. It is conveniently located. The hotel itself is nice and clean. the staff is excellent. They even offered to have the shuttle take us to the wedding venue, which was about 10 minutes away, and pick us up just in case we...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/ae/e9/7f/hotel-exterior.jpg'}
{'category': 'hotel', 'review_count': u'489', 'title': u'Elliott House Inn Hotel, Charleston', 'rating_string': u'4.0', 'address': u'78 Queen Street, Charleston, SC 29401', 'review_list': [u"Only stayed one night. Wish it was longer. Upon arrival last night the sweetest young lady checked us in and she even let us put our ice oaks in the office freezer, she went above and beyond. Also when we arrived they had wine and cheese I didn't partake but my husband said it was very tasty. The rooms are...\n\n\nMore", u'What a cool place to stay and in a perfect location. This was our second time and loved it as much as the first. Cozy Rooms, wine tasting, continental breakfast in the heart of the city next to Husk. Huge hotub in the courtyard is a plus and with walking distance of shopping and eateries.', u'Among the best locations in Charleston. Very attractive setting. The lack of on site parking is an issue. There is very limited on street parking, a garage is available across the street at $20 a night. You are left on your own.', u"AMAZING location. It's on the same block as three of the best restaurants in town and within walking distance of all major points of interest. Neil was incredibly helpful and willing to do anything asked to make our stay absolutely perfect. He was so knowledgeable and passionate when speaking about the history of Charleston. Breakfast was consistently served on-time and...\n\n\nMore", u'This inn has a great location in the heart of historic Charleston. Within steps of four great restaurants and only blocks from East Bay or Market St restaurants. The inn itself is historic and the rooms are very nice. Park your car because you can walk everywhere from here. The staff will help you with recommendations if you need advice.', u'worth staying - the staff, every detail I was very pleased. It is a quiet space and to have them deliver my breakfast was a nice added feature- It was in a great location surrounded by many different types of stores and shops and a nice restaurant right next door. I enjoyed every minute of it. thank you', u'What a lovely place- the staff was exceptional- so kind, friendly and willing to help. The court yard was gorgeous. And what an addition to the usual to have an evening reception of wine/ cheese for the guests. Then to have room service for breakfast- delightful. We even requested a large coffee and a big pot arrived promptly at the...\n\n\nMore', u'The beds are great. Nice and comfortable. Loved the breakfast delivered straight to the room at the time you indicated. It was nice to relax and enjoy my morning coffee in bed!! Will be back again!!!!', u'The photo of the courtyard all lit up captured my imagination, so I booked this inn. They should turn on the lights! The courtyard was quite lovely, with greenery, balconies, stairways and the hot tub. The lighting would have made it prettier still. The wine and cheese reception was welcome, varied and plentiful. Meeting other guests was interesting; some told...\n\n\nMore', u'We really enjoyed our one night stay to celebrate our anniversary. Great location!! We were able to walk every where for shopping and restaurants.\nCons: you have to pay for parking at the parking garage'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/7b/72/aa/the-elliott-house-inn.jpg'}
{'category': 'hotel', 'review_count': u'556', 'title': u'Hawthorn Suites by Wyndham Charleston Hotel', 'rating_string': u'3.5', 'address': u'2455 Savannah Highway, Charleston, SC 29414', 'review_list': [u"Stayed here midweek in January '16. We rented a suite with a parlor, bathroom and king bedroom. The sofa and armchair in the parlor were worn, but comfortable. The bathroom was a little tight and the sink was missing the drain stop. Outside temp was 40 and the temp on the room thermostate read 75. I tried turning it down...\n\n\nMore", u'The room was very spacious. The workers were very polite and courteous. I loved the Jacuzzi!!! Would def recommend!!', u'My girlfriend and I really enjoyed our stay at the Hawthrone Suites. I was in town to perform at the Charleston Comedy Festival and was looking for something close to downtown without breaking my wallet. Right off highway and quick access to everything in the area.\nWas surprised by the size of the room! Bigger than my apartment in Atlanta....\n\n\nMore', u'Hotel is a bit worn. We stayed 3 nights. Breakfast was so disappointing that we did not eat there again. We stayed here because of the indoor pool. I have stayed at other hotels nearby and they are nicer for about the same price.', u'Thank you Hawthorne for the comfort,courteous, respectful and the staff is so wonderful I love them all happy holiday. My Hawthorne.'], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'category': 'hotel', 'review_count': u'484', 'title': u'Fulton Lane Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'202 King St, Charleston, SC 29401', 'review_list': [u'This is a really nice place to stay if downtown Charleston, it had lots of character and gives the feel of old south charm. Stayed on second floor overlooking King st.\nParking is in a safe lot behind building. Bed was comfortable, staff were very attentive, place was clean. All good food and drink locations are within a block or...\n\n\nMore', u'It was a great romantic weekend, right in walking distance to everything and if we wanted nothing the hotel was romantic and cozy. The fireplace and tub were extra bonus , romance package came with flower and champagne. The wine and cheese happy hour was a great place to meet others and discuss things to see and do in town', u'We were looking for something affordable in Charleston and founds deal on Hotwire for this place. What a great deal. We got it for half price ($83) before tax and service fees.\nThe good:\nAlmost everything. Location is fantastic. Just park and walk to everything. Free breakfast brought to your room. Great choices and good food. My barometer is whether...\n\n\nMore', u'The location of this charming Inn was perfect for a girls mini-vacation. My husband and I have stayed several times in Charleston, including at The Francis Marion Hotel. The Fulton Lane Inn was hands-down my favorite. The continental breakfast brought to my room daily, the complimentary wine & cheese hour each day, and the exemplary service I received all made...\n\n\nMore', u"My wife and I recently stayed here to explore some of Charleston for a couple days. Despite the inability to check-in early and their lack of explanation concerning parking which could've saved us some money, I was impressed with the room itself and the services available. They offer wine and cheese in the evenings and nightly sherry complimentary. I was...\n\n\nMore", u'Stayed here with my wife for a get away. Had a great time. Parking is convenient. Able to walk everywhere in the downtown area with ease from this location. Our room was older, but very nice. Spacious and well appointed. All staff very friendly. Evening reception was nice/convenient. Did not take advantage of breakfast options, except for in-room breakfast one...\n\n\nMore', u'We stayed at the Fulton Lane Inn the first week of Jan. and renovations began on approx. the 4th. The workers were very polite and tried very hard not to disturb the few remaining guests. I rated the Inn average as that was our experience, however I look forward to staying in a renovated, upgraded room in the future. The...\n\n\nMore', u'Not at all like a chain hotel so don\'t expect that ...\nRooms are charming and have everything you need, including a small refrigerator.\nOur room overlooked King Street which we LOVED because we never felt "stuck in a room" - the happenings on the street were entertainment! We\'ve stayed multiple times and have never turned on the TV!\nThe...\n\n\nMore', u'This little gem is the perfect hotel in the perfect location in Charleston. The staff is wonderful and the rooms are clean and tastefully decorated. Susu was especially gracious and kind during our check in process. I loved having the convenience of coffee in the lobby and the "happy hour" at the King Charles next door. I would most definitely...\n\n\nMore', u'We loved staying at the Fulton Inn- location is great and everyone was friendly. The bed is so comfortable- we slept so well after a long drive. Also you have the choice to have your continental breakfast brought up to your room- huge plus! the room size is very spacious. And they have parking that is secured 24hrs. Would stay...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/02/c0/ef/b0/fulton-lane-inn.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'835', 'title': u'BEST WESTERN Sweetgrass Inn Hotel, Charleston', 'rating_string': u'4.0', 'address': u'1540 Savannah Highway, Charleston, SC 29407-7845', 'review_list': [u'Our family thoroughly enjoyed our stay at this location! Our truly smoke-free room was neat and clean, with pillow-top beds and crisp, clean sheets that helped us wake refreshed and energized each day. The staff were welcoming, friendly and helpful, from DaQuonna, who courteously welcomed us with her beautiful smile and provided us with info and maps re: the attractions...\n\n\nMore', u'The hotel staff have always been exceptional at this Best Western. The beds and cleanliness of the rooms are excellent. We have stayed at this hotel many times and have always been very pleased. The breakfast is always great as well.', u"We drove down from Maryland the day before a cruise, the only problems we had were that the water was lukewarm, which obviously is a first world problem and not worth crying over, and that when we booked, the booking process didn't catch that we were doing the cruise package, so an unexpected $20 per person was added to the...\n\n\nMore", u'I have stayed here multiple times and will return when I am in the area. The breakfast attendant carol is awesome. She knows me by name and always ask how I am doing and when I will be back. I miss not having the option to have a smoking room at this location now though.', u"We visited Charleston straight after the October flooding, so I expected the area to be damp. The hotel hadn't been flooded. Our room was on the first floor (American second floor) in the building at the rear. It smelt appalling and we asked for another room. Housekeeping were extremely cooperative in changing our room, but did have a slight air...\n\n\nMore", u'We spent two nights here staff was awesome and the rooms newly remodeled are great and it was a quiet place as well. Place is close to downtown and close to other area interests. Breakfast was good with both hot and cold choices. Will definitely stay here next time we are in the area and want a clean comfortable room....\n\n\nMore', u'I love the breakfast here. Ms. Carol is absolutely awesome!! She is very nice and helpful! I enjoy and look forward to seeing her in the morning at breakfast when I stay here. I love the renovations. I enjoy everything about my stay at this hotel!!', u'Room was clean and comfortable. Happy that this is a pet-friendly location. Very happy that they had multigrain bagels for breakfast as I try to avoid white bread.\nClose to the city, so it was easy to head out to see the sights in the morning.\nStaff is friendly. Very helpful when asking about a restaurant with vegan choices nearby.', u'3 nights in Charleston was the start of our "Antebellum" trip to Charleston, Savannah and St Augustine. The Sawgrass Inn was great and offered an included breakfast that rivals anything at IHOP or any other breakfast spot. The location is south and over the bridge from downtown Charleston and offers a close enough location(6 miles, 15 minutes) to the downtown...\n\n\nMore', u'Had an fabulous time staying at the Best Western in a suite..... fit for a queen. The room was clean and the service was out of this world!!! The front desk clerk help me decide on what dress to wear, can you believe that. The term out of your way service is definitely this place!!!!!!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/78/ca/6b/pool.jpg'}
{'category': 'hotel', 'review_count': u'345', 'title': u'Lodge Alley Inn Hotel, Charleston', 'rating_string': u'4.0', 'address': u'195 E Bay St, Charleston, SC 29401', 'review_list': [u'Perfect location for a night out in Charleston. Location is right on East Bay St and close to everything. Room was nice and had the lovely Charleston feel. The staff was very helpful and assisted us when needed. Valet was quick and the coffee in the lobby was hot and delicious as well :)', u'We have stayed here for several years and have loved it. They have a variety of different rooms, all with character. Most rooms have full kitchens if you choose to stay in. The private courtyard is beautiful and well set up and the staff is helpful. You are literally seconds away from everything you can imagine downtown from great restaurants...\n\n\nMore', u'Spent the night before flying out of Charleston. Staff are amazing and so nice and helpful. Everything was clean and fresh. Very old building but highly maintained. Perfect for historic Charleston. The location is perfect. Valet parking is $18 but worth not having to park and retrieve your car. Overall such a nice visit. Will be back! Todd and Chelsea...\n\n\nMore', u'This Bluegreen resort is top of the line. If you want to stay in a wonderful suite with the feel of a great southern inn with modern amenities and comfort, Lodge Alley Inn is perfect. A block from City Market, and dozens of great places to eat within a couple of blocks, make the location ideal for a weekend or...\n\n\nMore', u'We have stayed here at least 5 times and have never been disappointed in the service here. It is close enough to so many restaurants and shopping too. Love it here not matter what season it is always beautiful.', u"Spent the weekend downtown for our family Christmas weekend. Love the Lodge Alley Inn. Everyone so helpful and friendly from Molly at the front desk to Julie and Meghan as Concierge. Loved our room with a fireplace, which was so handy in 36 degree weather! We'll be back next year!!", u'This resort is perfectly located for visitors who enjoy exploring Charleston on foot. We walked everywhere! The staff are very nice and courteous, always willing to print out directions for you and recommend restaurants. The weather allowed us to enjoy the beautiful courtyard. You are walking distance to Waterfront Park along the Cooper River. The Market is close by and...\n\n\nMore', u'We had a great stay over Thanksgiving. From the moment we pulled to the curb until checkout we were treated like royalty. The staff was superb - some of the best customer service reps ever. This was our 1st time in Charleston and because of our experience at The Lodge Alley Inn we will be back.', u"We were at the Lodge Alley Inn for 3 nights and wish that it had been longer! I've never been anywhere with friendlier, more helpful staff members. Every single person on the staff was so kind and cheerful. They all really made our trip exceptional.\nThe inn itself is charming. We had a one bedroom and had more than enough...\n\n\nMore", u'We are Bluegreen owners and have stayed at Lodge Alley several times in the past and as always we had a great stay. The staff members are friendly and accommodating. Coffee and tea are available around the clock and sherry and cookies are served between 4:00 and 5:00 each afternoon. We stayed in a studio suite which was beautifully decorated...\n\n\nMore'], 'img_url': u'http://static.tacdn.com/img2/x.gif', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'34', 'title': u'Value Place Leeds Hotel, Charleston', 'rating_string': u'4.5', 'address': u'4475 Leeds Place West, Charleston, SC 29405', 'review_list': [u"The first thing I noticed upon entering the hotel was how wonderful and patient the young woman (Leslie) was at the desk. I checked in during the middle of the night and had a bunch of questions. Despite this, Leslie was super pleasant and helpful. She even recommended our family's new town favorite restaurant.\nThe rooms themsleves were very clean...\n\n\nMore", u"If you are a business traveler or contractor like me, you are probably familiar with Value Place hotels. This is one of three in Charleston I think, and it's the best one I've been to. I have also stayed at the Rivers Ave location and they have nothing on this one. The best thing is the front desk staff. For...\n\n\nMore", u"I've been staying at Value Place Leeds for about a year now, and what keeps me coming back, aside from the spotless rooms and safe location, is the incredibly friendly staff. They're always available and genuinely friendly. I've stayed in other VP properties, but this is the best, as is the staff. Highly recommended if you're in town for a...\n\n\nMore", u"I travel with my hubby for his job with or 6 month old son and we spent our 3-4 week stay here. The room was nice and clean with great space. The employees are pleasant, one in particular was Desmond. He's very patient, reliable, and inviting. I must say he made my stay enjoyable and if needed for more travels...\n\n\nMore", u"We stayed in a studio- double bed with kitchenette and bathroom. The location was great, we felt safe at the hotel, the staff were very friendly and helpful, and ample parking. The hotel is a short 10 minute drive to Charleston. However, the bed was the most uncomfortable I've ever slept in at a hotel. My husband and I both...\n\n\nMore", u'My experience there was awesome. I was treated with great respect from Clerk (Desmond) He was very professional and i was please and grateful for his service. The room was very clean and smell nice and clean... I really enjoyed my stay .. I am looking forward to my next visit....', u"I'll start by saying Desmond's hospitality was very much appreciated from the moment I walked through the door. I will stay here every time I visit Charleston. I had a wonderful week stay here. Hotel was very quiet and clean. Thank you Demond!", u'I stayed here for 3 weeks and I loved it! My room was very quiet and clean. The hotel employees were helpful and courteous. Internet and laundry are convenient to use and reasonably priced. Conveniently located to all points of Charleston; easy access to West Ashley, Mt. Pleasant, and downtown. Minutes away from The Citadel Mall, Tanger Outlets, and Walmart...\n\n\nMore', u'We have travelled the world and appreciate helpful customer service like that of Desmond, the friendly desk clerk, who checked us in. He keeps track of everything and is very helpful. This hotel has proved to be ideal for a long-term stay as well as for just a few nights because of the security and reliable staff. Easy access from...\n\n\nMore', u"I travel a lot, across the country actually, for a leading sales company. I personally choose to stay in 5 star hotels with room service, but this booking was for my daughter who's a sophomore at CSU. This year she will be having her own apartment off campus, but the apartment wasn't ready, so we needed somewhere affordable, safe, comfortable...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/03/f9/39/f7/value-place-leeds.jpg'}
{'category': 'hotel', 'review_count': u'107', 'title': u'The Spectator Hotel, Charleston', 'rating_string': u'5.0', 'address': u'67 State Street, corner of State and Linguard, Charleston, SC 29041', 'review_list': [u"This boutique hotel is gorgeous with a great staff. Jordan our butler was fantastic, and made sure we were well taken care of. And Michael Curley , their director of operations, was a terrific host and so very knowledgeable about places to visit and eat at. I didn't get the names of the young ladies who did turn down, but...\n\n\nMore", u"We stayed at The Spectator for a girl's weekend...beautiful property, fabulous service. Wish that the bar stayed open past midnight. But other than that service was on point from a specialty cocktail at check-in to breakfast in the morning. We will definitely be back!", u'Boutique hotels are my favorite but you also run the risk of not knowing EXACTLY what you are going to get -- and this hotel blew me away.\nNot only is it in the middle of everything but they have BUTLER service that reminds me of the St Regis to handle all of your wants and needs -- my wants...\n\n\nMore', u'Everything about this new hotel is stunning, every detail perfectly prepared and the staff goes the extra mile to ensure that your stay is perfect and over-the-top special. Extra call-out to the Guest Services rep Victoria for going the extra mile in ensuring that everything was surpassing expectations! Impeccably located and worth every penny. Thank you for taking care of...\n\n\nMore', u'We very much enjoyed our one night at the Spectator. The decor of our Grand Suite was very contemporary and soothing. Perfect after having spent the previous nights in a Victorian Inn. The staff was very effecient and accomodating. Someone came up immediately after being notified that the bathtub stopper would not work. It was fixed with 15 minutes. They...\n\n\nMore', u'Our reservation at this hotel is not until next month but I did want to sing the praises of a hotel staffer named Victoria who I have spoken to a number of times. She has already gone above the call of duty to accommodation our questions, and needs. It is appreciated before we have even walked in the door. If...\n\n\nMore', u'My best friend and I took a long weekend trip to Charleston and Savannah in October to celebrate 26 years of friendship. While in Charleston, we stayed at the Spectator and it was a wonderful stay.\nFor those familiar with my other reviews, you will know that I conduct extensive research before I stay anywhere and this hotel met my...\n\n\nMore', u"Heard so much about Charleston, its historical town, it's foods, it's people. But probably just because it is not that far from us, we waited and waited until a recent short three days getaway. AND, it didn't disappoint at all. Everything we heard is true. It's a town that America used to be before modernization erased so many chapters of...\n\n\nMore", u'The four of us went there for cocktails on two different evenings. The bar area is comfortable with overstuffed chairs and sofas. The service is friendly and the bartender is knowledgeable about any drink that you might ask for. There is a pleasure in watching them work on you drinks. We all recommend this bar and would love to return...\n\n\nMore', u'My boyfriend and I came to Charleston to celebrate our birthdays and from the minute we arrived at The Spectator, our stay was nothing short of exemplary! Our butler, Bryan immediately arranged a car service to bring us to our dinner reservation. Breakfast was delivered to our room every morning. Our butler even surprised us with complimentary birthday mimosas on...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/08/8e/ce/ce/the-spectator-hotel.jpg'}
{'category': 'hotel', 'review_count': u'52', 'title': u'Grand Bohemian Hotel Charleston', 'rating_string': u'5.0', 'address': u'55 Wentworth St, Charleston, SC 29401', 'review_list': [u"I Was Born And Raised In Arizona, I Didn't Know What To Expect In Charleston, So My Close Friend Who Is Familiar With That Of Charleston Area, Told Me I Should Try Either The Renaissance Hotel Or The Bohemian Hotel, Which You Knew I Tried The Bohiemian A While Ago, BEST CHOICE EVER! Fantastic Room, Incredible View, Great Food, And...\n\n\nMore", u"We went to Eleve at the Grand Bohemian for a birthday celebration with some girlfriends. Everything was superb, the atmosphere was great, the food was absolutely amazing and it was some of the best service I've ever had in Charleston. Jason, our server was beyond attentive and made sure we had everything we needed throughout the night, there was never...\n\n\nMore", u"I was born and raised in Charleston, however I no longer live there. While visiting my family for the weekend, I chose to stay here because it was new and I had heard great things. It is my far my favorite hotel! The decor is chic, and its a stone's throw from EVERYTHING! The valet takes a really long time,...\n\n\nMore", u"Richard Kessler and his team have done it again. The Grand Bohemian Charleston delivers on being cool without being unapproachable.\nThe rooms are spacious, edgy and well appointed. We ordered In-Room Dining and it arrived quickly and as ordered. Our In-Room Dining server was an absolute delight.\nThe roof-top bar and restaurant Eleve is a can't miss. Our only disappointment...\n\n\nMore", u"Love this Marriott property. Great location and rooms are very nice. We have stayed a couple times using points and it's our new favorite. Nice coffee shop on first level too!\nStaff is always friendly and the wine bar has a great selection.\nGreat place to stay!", u'The property and staff are first rate and our wine blending class with sommelier Scott was educational and fun. We look forward to taking friends to the wine blending and enjoying the new boutique hotel again. We enthusiastically recommend the hotel and particularly the wine blending class.', u'I cannot say enough great things about the Grand Bohemian Charleston! The property itself is gorgeous! From the travertine at the entrance to the eclectic art perfectly placed throughout you feel you are in a gallery, but one where you can relax.\nI had my team of 15 visit for a three day meeting. From my first phone call with...\n\n\nMore', u'Conveniently located & walking distance to historic downtown & waterfront district. New boutique hotel by the Kessler Group and Marriott. Everything was excellent during our stay. We will definitely visit again. Thank you to the friendly, helpful, professional staff.', u'My husband and I stayed here last week on a visit to Charleston. We usually stay somewhere else, but decided to try something new. The Grand Bohemian did not disappoint. The hotel is only 4 months old. The rooms have plenty of room and very clean. I love the cool funky decor. We loved the rooftop bar- great ambience! All...\n\n\nMore', u"Absolutely loved this hotel. Let's start with the fact that it's incredibly well located. For the most part, the staff and the service are second to none. Gabriela helped me long before we even got there, making dinner reservations at several phenomenal restaurants. Both Gabriela and Emma were so insanely pleasant to deal with and made our 20th anniversary trip...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/98/3a/11/grand-bohemian-hotel.jpg'}
{'category': 'hotel', 'review_count': u'43', 'title': u'Hyatt House Charleston - Historic District Hotel', 'rating_string': u'4.5', 'address': u'560 King Street, Charleston, SC 29403', 'review_list': [u'Made unexpected trip to Charleston, SC because of snow in Asheville. Made reservations in the car and on the way from Asheville to Charleston. Once we arrived we were met with a great staff that met every expectation. The studio was just the right size for two for an overnight stay, The morning breakfast was exceptional. The staff was the...\n\n\nMore', u'Loved the new Hyatt House Hotel in Downtown Charleston! Suite is like a small apartment. Loved the convenience of the hotel. Will be staying there again for business and pleasure. Breakfast was great too!', u"We booked this room to work with Jan 2016 practice dates for Charleston Fashion week, and I got more than I bargained for: King bed, double bed pull out couch and a full working kitchen with fridge, microwave, a two burner cook top, dish washer and crockery/kitchen tools. Amazing!\nThe beds were comfy, no complaints except that you can't set...\n\n\nMore", u'Staying at Hyatt House is like being home, with a well-equipped kitchen, a lovely sitting area, a cozy bedroom and a fantastic bathroom. The location is ideal. My only problem was that I was unable to adjust the room temperature.', u'The folks were very friendly and helpful and rooms nice and new. My favorite thing was the double black out curtins which allowed us to sleep late. My least favorite thing was twice in our four day stay, King Street was closed for events which delayed our departures. Not a problem if you are walking every where. Lots of cool...\n\n\nMore', u'This hotel would be perfect if it was a mile south. I liked the large quiet room. The breakfast was nice. We even had a partial view of the bridge. However if you stay, consider budgeting some money for Uber. I think the hotel could compensate for their location if they had a shuttle going up and down King St....\n\n\nMore', u'Our experience at the Hyatt House was above what we had expected. Normally we stay at the Grand Hyatt or Regency, depending on which is available. I would have rated this hotel Excellent, but we had to change rooms due to a nonfunctional bathroom door lock. The staff were very accommodating and were prompt in there response. I will definitely...\n\n\nMore', u'wonderful staff always smiling and working hard to make our stay pleasant. answering all our tourist questions. Bartender was especially informative only negative was thermostat and noisy fan which ran constantly room cold', u'Pros: Nice room, friendly staff, great breakfast, convenient location, self parking garage 20 yards away, walking distance from the historic district, free bus shuttle 50 yards away\nCons: Noise insulation to be improved (voices from other guests coming from A/C pipes)'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/8c/6d/72/hyatt-house-charleston.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'57', 'title': u'Hyatt Place Charleston/Historic District Hotel', 'rating_string': u'4.5', 'address': u'560 King Street, Charleston, SC 29403', 'review_list': [u"The Hyatt Place is located in the Historic District of down town Charleston, SC. The staff is very friendly. Valet parking is available. My wife and I got 8th floor so we can see the city. It's very close to great places to eat. Plenty of shopping. In general, a very nice place to walk around and see the sites....\n\n\nMore", u'Clean and new! Just a lovely hotel and the staff is superior! Wish the bar/lounge area was developed further. Everything was wonderful. The location is ideal for bars and eats. The outdoor fire pit was such a bonus! Sheets and bed were very comfortable!', u'We had a wonderful stay at this hotel. It was brand new and everything was so nice and clean. The staff went over and above to accommodate our every need! Would definitely stay there again when in Charleston!', u'Thank you! Place was clean, and excellent. Tammy at the front desk was always on point and everyone was professional, Gym and pool clean and new. Like the key to the door, it work every time, Thank you, Thank you, Thank you, Thank you! F.', u'This is a new hotel so the cleanliness might have been a reflection of that. The pool was perfect and the fitness room was well equipped. The friendliness of the staff, however, was a big surprise. Everyone I ran into made a point of offering to help. The breakfast buffet was above average as well!!', u'Great location easily able to walk to all major attractions. Parking being available was important and resonable .Many very good restaurants near by easy access to highway. Rooms very zen like large comfortable . Breakfast had many options and was good.The staff very helpful and pleasant on all levels. Highly recommend', u"Stayed for the Marathon Weekend, and the staff really went out of the way for us. The room was great and the indoor pool was a hit with the kids. Convenient to walk to Callie's Hot Little Biscuits (a must!) and central to lots of stuff. Definitely family friendly.", u"Fantastic new & modern hotel on the north end of King St. It was a great starting point to all of what Charleston has to offer. All of downtown was within reasonable walking distance.\nThe hotel itself, while not having any 'local' charm, was still certainly very nice. The rooms were larger than an average room, and the couch in...\n\n\nMore", u'If you can get over the fact that there is no real view and the food and bev menu is limited this is a nice new hotel nicely located. We walked everywhere downtown. Charleston Straw Market was a 15 minute walk. Many restaurants nearby. Super friendly staff.', u'Shoppers you need to consider this new comer to charleston. Yes it is high up on kings street but if dining and shopping are your major goals this is the place for you. Reasonable price beautiful rooms, great work out facility. Also very convenient to college of charleston or musc. I would give this newer high marks!!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/0a/2e/97/f9/queen-room.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'440', 'title': u'Comfort Inn Downtown Charleston Hotel', 'rating_string': u'3.0', 'address': u'144 Bee Street, Charleston, SC 29401', 'review_list': [u'the only good thing was the staff: very gentle and ready to help and solve problems.\ncarpet, walls, elevator very old and scratched, also looking dirty. Bad smell along the corridor. Room was ok enough', u"Don't let the fact that the lobby needs updating skew your opinion, we had a great stay. After a heart procedure at MUSC we stayed in a very clean, warm room. The TV worked, lots of towels, and very quiet. All employees were welcoming. Great shower, nice bathroom and this wasn't arranged by the hospital so our room was random,...\n\n\nMore", u'I have stayed at this property 2 times in the last 45 days and the experience was excellent. This is a good lower cost alliterative tot eh HI or Marriott. I was in Charleston for the marathon and they were very accommodating to the runners.', u"Quick overnight stop at this hotel. Everything was clean, our 2 double bed room had plenty of space, and there were complimentary cookies at the front desk. Who doesn't love a free cookie :) The staff were friendly and also kept our bags while we went out for breakfast after checking out (very helpful to not have to lug around...\n\n\nMore", u'We stayed here in mid-December, the hotel was nice enough but we were double charged for our stay and are still struggling to sort this out.\nWe used booking.com to book our stay, paid upfront via credit card, approximately $150. This payment was made a month in advance.\nUpon check in the hotel charged our credit card with a further...\n\n\nMore', u"The room was Clean and the King sized bed was comfortable. We planned on staying for 6 nights but had to leave a few days early. Holly at the front desk was very understanding and checked us out quickly. The breakfast was good but the hot selection didn't vary much. it was either biscuits and gravy with eggs or biscuits...\n\n\nMore", u"We are given a rate by phone that was cheaper than when we checked in. It was late and we didn't want to go searching for another motel.\nWhile sitting on the couch a small brown bug was discovered on my clothing. The next day both my husband and I had several bites. When checking out, we told the clerk...\n\n\nMore", u"We booked through booking.com paid in full. They then charged us more than double the rate we paid in the first place, after saying they only need to swipe our card for incidentals. I'm still awaiting the hotel group to get back to me... A headache you surely don't want after a wonderful trip.", u'I met my brother and sister in law for my birthday. The room was very nice. Slept like a baby in that king size bed (soooo comfortable). The location to downtown Charleston was perfect and the price was right. I would stay there again.', u"We booked this hotel out of loyalty to Choice Hotels and weren't disappointed. Holly greeted us warmly, welcomed us with nice chocolate chip cookies and other sweet treats and gave us perfect directions for walking to town with sidewalks all the way. We arrived about noon but were able to check in immediately to a room that was twice the...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/25/d7/02/scexterior.jpg'}
{'category': 'hotel', 'review_count': u'7', 'title': u'Market Street Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'48 North Market Street, Charleston, SC 29401', 'review_list': [u"I love this place. It's located in the heart of the historic part of town.We walked to every place we wanted to see from here. It's very near the huge city market, and near the water, other shopping, and restaurants. The hotel has a good breakfast included, and wine and snacks in late afternoon. We only needed to pay for...\n\n\nMore", u'Stayed here in the historic area of Charleston for one night. Our room was located on the second floor accessed by a wooden porch that was noisy when other guests walked by. It was a cold night and the room itself was cold. As said, this is an old B&B where you could see daylight around the doors with a...\n\n\nMore', u'We spent four days in Charleston this summer and wanted to be in the middle of all the action. We could not have stayed at a nicer place! The Inn offers hands down the best breakfast in town, the courtyard is quaint and comfortable, wine and a little something is free to guests in the late afternoon. Staff is friendly....\n\n\nMore', u'The Market Street Inn is close to the the shops on Market Street, the shops on King Street, a short walk to the harbor, to Rainbow Row, the Battery, etc. The staff are friendly and helpful. The breakfast was great and so too was the wine and cheese hour. You have to park about 2 blocks away in a parking...\n\n\nMore', u'If you want a lovely inn that offers a great breakfast, afternoon drinks and refreshments, and puts you in the heart of the historic city, this is the inn for you. The staff members were courteous and professional in every way. The rooms were nicely appointed and very comfortable. Wish we had more time to enjoy the garden courtyard and...\n\n\nMore', u'Living only an hour away from Charleston, I visit frequently. This is my favorite place to stay. The value is great! Walking distance to everything, beautiful rooms and friendly staff. Owner even showed his appreciation for my boyfriend who is a Marine. :)', u'Wonderful hotel, great staff and all the bells and whistles. Perfect location surrounded by wonderful restaurants and shopping. Great tour carriage rides right outside the door. Roof top bar was perfect for evening breaks and we received coupons for beverages, which made it even better. Coffee and pastries in the hall every morning, everyone in robs getting breakfast made for...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/05/19/b6/41/a-view-from-meeting-street.jpg'}
{'category': 'hotel', 'review_count': u'1539', 'title': u'Charleston - Days Inn Historic District Motel', 'rating_string': u'3.0', 'address': u'155 Meeting Street, Charleston, SC 29401', 'review_list': [u"It's a Days Inn- I'm rating based on that fact. I don't expect a four star hotel when I book a Days Inn, but for what it was, it well exceeded my expectations. The location could not be better- walkable to everything Charleston had to offer. Moreover, the parking was included and we had no issues. The room was quiet...\n\n\nMore", u'We stayed at this hotel in November and in January. Both times we had great difficulty with the hot water, like NO hot water when we were wishing to take showers in the evening. After some delay the problem was mostly corrected. The water was never as hot as it should have been, and this happened on three different days....\n\n\nMore', u'I was amazed by the staff at the reception, the lady was very kind to write and point the popular places to eat on the map, she also allowed me to check in early. The reasons I have not given 5 rating are :\n1. No complimentary breakfast\n2. The rooms are closely attached and can literally hear the occupants...\n\n\nMore', u"Staff was great.. room not modern, Blowdryer not attached to wall, coffee pot outlet didn't work, roach inside water cup! Wish I would have spent the extra money and stayed in another inn!", u"It was a good location and staff was great. Basic amenities. Cleaning staff messed up a bunch: didn't leave new coffee service, didn't replace sheets/towels when replacement card used,etc", u'The location of this motel was great. Everything down town is in walking distance. The room was small, but not cramped. It was clean, with no bad odors. Check in and check out was fast and friendly. The price would be very high for any other location.', u'Good location for walking to the market and surrounding area. Nice clean room. Tv out dated and could have better tv reception. Otherwise okay. Would return.', u'The location, Wi-Fi and cleanliness is a plus. I would have enjoyed a continental breakfast if available. I would recommend to anyone.'], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'category': 'hotel', 'review_count': u'804', 'title': u'La Quinta Inn & Suites Charleston Riverview Hotel', 'rating_string': u'3.5', 'address': u'11 Ashley Pointe Dr, Charleston, SC 29407', 'review_list': [u'First, the pros. The hotel seems to have been renovated and the rooms are very nice and a fair price. The beds are very comfortable. The free parking and wifi are added bonuses. It was nice to be able to grab a free, quick breakfast in the morning. The front desk and breakfast staff are very friendly. The location was...\n\n\nMore', u"Unfortunately there had been a water line break in the main hotel so we were placed in the older adjacent section of the hotel, which isn't connected to the main building. While our room was clean and recently upgraded, I did not feel safe staying in a room that opened directly to the outside, especially when the deadbolt lock was...\n\n\nMore", u"One of the best La Quinta's we have stayed. Super staff and our room was very clean and comfortable. Staff is breakfast area were the best We will be sure and make this our address when in Charleston in the future.", u'Stayed here twice on a round trip drive from DC to Florida and back. Pet friendly. Recently renovated interiors with modern decor. Large parking lot. Seems to be a popular hotel for the price. Reserved a marina view king size room in the main building both stays, which was recommended by other viewers. I highly recommend as I hear the...\n\n\nMore', u"The bed is comfortable. It's the only good thing I have to say about my room. They need to spray for roaches. The new were building looks nicer. The older building is loud being located next to the connector. Lots of traffic to and from downtown may keep you up if you're a light sleeper.", u'We helped move our daughter to Charleston SC and decided to stay at this La Quinta Inn. We are so glad we did. This is where we will definitely stay whenever we come to visit our daughter who lives downtown. This location is perfect for being within minutes of downtown Charleston without paying the high prices of downtown. The manager...\n\n\nMore', u'Booked two rooms, "Marina-side" at higher rate through Expedia. Only got one on the Marina side and one overlooking a parking lot. Complained and told there is no such booking as a Marina side room (although it is still up on Expedia). Was told would be given a $40.00 rebate to be processed on checkout. Ar checkout they would not...\n\n\nMore', u'Pleasant and cost effective location when visiting Charleston. Friendly Staff, and decent amenities. Shuttle service to the center city is convenient as parking can be a problem in Charleston. There is a lack of eating places in the immediate area, but downtown Charleston is a culinary delight, at all price levels.', u'Nice room, clean. Nice view of a marina and just down the street from California Dreaming, which is a very nice restaurant. Close to Charleston attractions. They allow your dog to stay in the room if you are not present. My grandkids enjoyed the buffet breakfast. We went back to Myrtle Beach the day after the wedding and had forgotten...\n\n\nMore', u'a 2 minute drive from the Charleston Historic District. Newly remodeled rooms. Marina view. Breakfast included. No charge parking. Half the cost of Marriott Courtyard in Historic district. Literally half. For a 2 minute drive'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/d4/57/57/exterior.jpg'}
{'category': 'hotel', 'review_count': u'7', 'title': u'Motoryacht Southern Comfort Hotel, Charleston', 'rating_string': u'3.0', 'address': u'17 Lockwood Drive, Charleston, SC 29401', 'review_list': [u"Reading the other reviews I am laughing at how old I have suddenly become when I look around and agree that this Yacht would probably be an EPIC place to have a raging Bachlor/ette party - except for the fact that the owners of this place clearly love their boat and don't want it trashed by uncaring, drunken douche/ettes.\nFor...\n\n\nMore", u'My wife and I had been married about 4 months, and we went down in January to get out of Charlotte for the weekend, the weather was a little cold, but the boat was so nice. We took advantage of the free taxi into town and went and walked around the shops. The boat was clean and a great spot...\n\n\nMore', u"My daughter just turned nine while we were on vacation in Charleston and we stayed on Southern Comfort for her birthday. It's a gorgeous vessel with lots of amenities and a great view! Chris, the owner was very accommodating with our scheduling and booking and promptly answered any questions I had. We had a WONDERFUL time! (My daughter even watched...\n\n\nMore", u"We booked the yacht for my friend's bachelorette party for the weekend of July 4th. We've had the reservation for quite awhile and just a few days ago they informed us that we could not use the yacht because the last group caused too much damage to it. We are now stuck, 2 weeks out, trying to find a new...\n\n\nMore", u'I was very disappointed to learn today that the owner, Chris, of Southern Comfort Yachts cancelled our reservation because our reservation was for 9 women to stay on the yacht. The owner cited in his extremely short email that, "The owners feel the yacht is no longer suitable for girls weekends." This is not only discrimination because we are women,...\n\n\nMore', u'Let me start by saying that we did truly enjoy our stay on the Southern Comfort, and had plans to return. However, the memory of our trip has been tainted by Chris, the boat owners after charges.\nOur trip coordinator works in vacation rentals, and had the due diligence to contact Chris is advance to make sure our balance was...\n\n\nMore', u'We loved the ship and had a wonderful time until the owner charged our credit card for charges more than a month after our stay and confused us with prior visitors. we had such high hopes for a return stay once our daughter goes to college in Charleston but will know have to find different lodging.\nPlease beware and make...\n\n\nMore'], 'img_url': ''}
{'category': 'hotel', 'review_count': u'12', 'title': u'Evergreen Motel, Charleston', 'rating_string': u'3.0', 'address': u'1909 Savannah Hwy, Charleston, SC 29407', 'review_list': [u"For $55 per night what do you expect. It was super clean. Yes it was an old motel. But the econo lodge was $115 per night. We only slept in room. We were out and about touring etc. family running the place is super nice. We didn't need a pool, we didn't need a valet. We wanted a clean place...\n\n\nMore", u'Not a fancy place and a Lil out dated but found it to be very clean compared to Econo lodge up the road. The family running it are awesome. Will definitely stay here again.Have stayed at several hotels in the area and this I found to be best for the dollar,Gene, Louisiana', u"A very friendly family run motel that was more than reasonably priced.The room had double beds,cable,internet,a microwave,and a small refrigerator.It was immaculately clean and I wouldn't hesitate to book a room again.", u'We spent 2 nights here & had no issues at all. Yes the rooms are run down and not the prettiest looking but for $50 a night who cares. The sheets, towels & bathroom were really clean. The AC worked really well, the shower pressure was fantastic and the owners really lovely.\nThis is a budget motel & you get...\n\n\nMore', u'Very nice rooms, staff were friendly, close to downtown, and surrounded by many restaurants. Also shopping areas are very close and convenient stores. I would recommend this place to anyone traveling by in Charleston!', u"Had room at EconoInn down the rode but it was smelly and creepy. Got our money back and Evergreen was the only motel left that had a room. Next time I'll pay 200 a night. The staff was friendly until they got our money. Never have I been mistreated like this before. They wanted to tow my car because I...\n\n\nMore", u"We were driving through Charlestown. This was the ONLY motel or hotel with vacancies. Yes... we tried basically every single place. There were no special events going on that weekend so it was puzzling why everywhere was booked solid. Charlestown is just severely under-motel'ed, I guess. Do not expect to find lodging there if you are just passing through!\nThe...\n\n\nMore", u'We had reservations at the EconoLodge up the road but there was NO way we were going to stay there--it was creepy, scary, and dirty. The evergreen was our miracle and salvation. It is owned by a family it was safe and clean and cheap. There are no bells or whistles, just honest people attempting to find the American dream....\n\n\nMore', u'I was in Charleston to visit with my daughter, and did not make reservations in advance. I arrived in town about 4:30 on Saturday,and the first two hotels I stopped at either did not have a vacant room or were outrageously expensive. As I went down Highway 17, I saw the Evergreen Motel. It is old, but the outside looked...\n\n\nMore', u'We spent our first night here before moving on to a B&B. This was a nice way to balance the budget. Even with the huge SEWE expo in town, the rate was only $43. The rooms are fairly large, and the furnishings are old, but not beat-up. The bathroom is small but clean. I did forget to ask for a...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-p/01/af/f8/9b/evergreen-motel.jpg'}
{'category': 'hotel', 'review_count': 'Unknown', 'title': u'The Dewberry Charleston Hotel', 'rating_string': 'Unknown', 'address': u'334 Meeting Street, Charleston, SC 29403', 'review_list': [], 'img_url': ''}
{'category': 'hotel', 'review_count': 'Unknown', 'title': u'InTown Suites Charleston Northwest / I-26 Hotel', 'rating_string': 'Unknown', 'address': u'7371 Mazyck Rd, Charleston, SC 29406', 'review_list': [], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/01/ac/f6/ac/intown-suites.jpg'}
{'category': 'hotel', 'review_count': u'9', 'title': u'InTown Suites Charleston Southwest Hotel', 'rating_string': u'2.0', 'address': u'2236 Savannah Highway, Charleston, SC 29414', 'review_list': [u'Proceed with caution. The motel insists that it has 24-hour security however even if it does, it still manages to attract a criminal element although in a safe part of Charleston. I suppose the low rates attract long-term guests who find the motel convenient to use for illicit purposes. The online police reports speak for themselves. On Wednesday, March 25,...\n\n\nMore', u'We wanted to visit Charleston for two weeks and had to find a way to not break the bank. This filled the bill. Our room was very clean. Bare bones no frills but found the mattress comfortable and loved having the stove and full sizes refrigerator. We come down to visit beach walker park on kiawah and see the sights...\n\n\nMore', u'We had to buy ant spray for the ants in our room. We had roaches all in the "kitchen" area. The microwave didn\'t work properly. There is no wi-fi! The laundry facility was out of order. There were beer caps under the beds. Even though we had 4 people in the room, we were told that we could only have...\n\n\nMore', u'Husband is staying here for a 6 weeks for work. Clean room, queen suite is remodeled with granite countertops. They do not provide dishes, silverware or pans in the unit. Sheets were very thin so he bought a couple sets and are using those. Mattress in queen suit is new. Good value for the money.', u'This motel chain is the worst place i have ever seen. There were cockroaches swarming all over i had to combat them daily!! This place is dirty i had to throw away several items after my stay for fear of roach eggs in my stuff. i had to leave my room so they could clean, and my deposit has not...\n\n\nMore', u'beds are very uncomforable the front desk should offer inftormation about the town of Charleston like bus routes schedules places to go and things to do and just be a little more friendly a smile never hurt anybody or a hello .', u'Horrible!!! I am writing this review at midnight, becoz i cannot go to sleep because of bed bugs, dirty bed sheets.Internet sucks.I cannot check out as i had paid for a week.Please stay away from this Motel.', u"Location: 5035 North Arco Lane, North Charleston, SC; General Manager: Nicole Ortiz\nThis was the second time that I've stayed at a weekly hotel. The first time was tolerable, but this time was miserable. A few minutes after check-in we noticed two roaches on the floor of the bathroom. One was twitching, the other was dead. I decided to use...\n\n\nMore", u'After helping family relocate from West Ashley SC we stayed at the Intown on Hwy 17S. This was the biggest mistake I have ever made and I have traveled all over. Unfortunately for us, this was Spring Break week and all accomodations were full and this was our only choice.\nThree people (the maxium) stayed in our room for two...\n\n\nMore'], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'category': 'hotel', 'review_count': u'107', 'title': u'Motel 6 Charleston South', 'rating_string': u'2.5', 'address': u'2058 Savannah Highway, I-526 at US 17, Charleston, SC 29407', 'review_list': [u'Very comfortable beds and bedding was very clean. Overall, this is a cheap motel and feels like exactly that. Right beside the expressway so it is very convenient. About 30 minutes to Folly Beach, 40 to Kiawah Island.\nNice clean pool!\nIf you are looking for a low end hotel, just a place to sleep for the night, this is...\n\n\nMore', u'I stayed on the ground level by choice but I was not actually expecting all of the super neatness and 5 star customer service that I received. They are the most accurate, insightful and professional staff that you come across any day of the week paying 10 times more. The General Manager named Ralph saw to it that all my...\n\n\nMore', u'Well, they\'ve gone up -- from $40 my last stay to $50 today. But, my goodness, they are courteous at the front desk. As you may know, Charleston SC was voted "most courteous" destination in some travel mag, so now all the rude Yankees who moved down here to work the hospitality trade have become Southern gentry; and some of...\n\n\nMore', u"This was the third place wifee and I stayed on our 17 day on the ground trip across Georgia, S & N Carolina. This place is hard to find, especially at night. There is a McDonald's right before the driveway to the hotel. A pedestrian walkway between the properties makes it nice to get breakfast. Reggie at the front desk...\n\n\nMore", u'Having read the latest reviews, I was about to cancel my visit. Traveling with my dog, I knew my options were limited for an inexpensive hotel for the night. I wanted a place that was relatively close to the beach, ~20 minutes to Folly, inexpensive, and dog friendly. This Motel 6 met all the criteria. I decided to give it...\n\n\nMore', u'I only needed about 6 hour of rest, so I checked into this Motel 6. I took a shower, turned down the covers on the bed and this is what I found.(pictures says a thousand words clearly,see pictures below). FILTH!!!!!!!!!!!. I requested, A ROOM CHANGE. BENIFIT OF THE DOUBT, ( I sprayed the mattress with be bugs and flea spray).........\n\n\nMore', u'Stayed for one night to sight see charleston and take a night to rest on a road trip back home. ....Atleast the room was clean which is what was most important to me.......TV did not work, all channels fuzzy.....cost 60 plus tax on a weekend in september. Cheapest motel I found in the area. About 6 Mikes from downtown area.', u'I stay at the one on savannah hwy ,the first couple night were alright but the last night they wash our cover and a bed bug was on the. Covers .Now he could have walk in or was brought in any way we left in the middle of the night .The manger Paul Walla e said he would refund that...\n\n\nMore', u'I have never stayed at a Motel 6 before, and I must admit that when I pulled in I was a bit skeptical. Not because of the property, but because of the other guests that were hanging out. Check in was fast and friendly. The room was spotless! At one time I was a Director of Housekeeping for a major...\n\n\nMore', u"Not too bad for a two star hotel. You're obviously not going to be staying at the Grand Majestic, so don't expect too much but it is well over bare-bones. We probably lucked out, but our room was in very nice condition! There were no bedbugs in the room did not stink. The TV was...old but it worked. The showers...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/28/54/45/motel-6-charleston-south.jpg'}
{'category': 'hotel', 'review_count': u'30', 'title': u'Quality Inn Hotel, Charleston', 'rating_string': u'1.5', 'address': u'2237 Savannah Hwy., Charleston, SC 29414 (Formerly Econo Lodge Charleston)', 'review_list': [u"I've been in places cheaper than this hotel and they have much better rooms than this. First thing I saw the soonest I walk in was how nasty the carpet was among the edges of the room, then the Cockroach, dust here and there, the table it wasn't even clean. Total of Cockroaches that I found 2. This pictures are...\n\n\nMore", u'Basic. Clean. Economical. Friendly service. Close to the airport: 3 miles from the Charleston, NC airport.\nWe stayed here for one night. Was impressed with the cleanliness of the room. A very basic motel room, but a way to save money. included soap only. Bring your own shampoo, etc.', u'Not actually pet friendly. The guy at the counter was rude and cranky. The room was gross. One of the dresser drawers were broken. Dusty. Awful awful awful. We left immediately and stayed at the motel 6 down the street, MUCH better for a one night stay', u"This is the worst Choice Hotel's MOTEL I've ever stayed in, its a dump. Choice should not have its name on this hotel. I'm a Platinum traveler and this hotel does them NO justice at all.\nIts A DUMP!\nI don't smoke, but I was given a smoking room. I went up to ask for a non-smoking room but was...\n\n\nMore", u'My husband and i decided to set out on a drive south and decide where we will go, decided to stay in Savannah booked, Beaufort booked, Charleston, everything we wanted booked.Had to look at less than desirable places. Worried when we booked. Went up to our room and opened our door. Wow i thought we were at a different hotel...\n\n\nMore', u'Stincky, barely clean. A smoky smell, dirty bathroom and dusty carpet. The first room I was given has a c... on the handle. And that for around 80$. Avoid it. Everything else was booked, even this one was quite full.', u"As I stepped into the room the smell was horrible. My kids were so excited to be on vacation I didn't want to ruin it but I knew I could not stay there, my husband ran out to get the boys some food and I stayed in the room to make an inspection.... First the bed. There was a faint...\n\n\nMore", u"Unfit, bugs in beds, dressers, on walls. Carpet had drywall slabs placed into missing areas in walking path to bathroom, not vacuumed for days as crap was along bedspread lines on floor. Run away! Can't even relive the gross bathroom -get ill thinking about the conditions!", u'I am not a fussy traveller. I am used to staying in rodeway inns and econolodges, and other budget hotels; but this one really needed a little TLC.\nCheck-in: arrived at about 1:00am. Staff member was on the phone with a personal call. Seemed annoyed to be interrupted. Process was quick but staff was a little rude and unfriendly.\nRoom:...\n\n\nMore', u"Got here late at night and we should have known to move on by the smell in the lobby... At first he gave us a smoking room and it wasn't until I made up a story about being allergic to cigarette smoke that he magically found a non smoking room. The chain lock on the door had been broken off,...\n\n\nMore"], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'category': 'hotel', 'review_count': u'484', 'title': u'Residence Inn Charleston Downtown/Riverview Hotel', 'rating_string': u'4.0', 'address': u'90 Ripley Point Drive, Charleston, SC 29407', 'review_list': [u'We were in a 2 bedroom suite and it felt like a spacious apartment with modern furnishings. The hotel is a 5 minute drive from downtown Charleston and within 30-40 minutes of IOP and Hilton Head beaches.', u'My experience here was one of the best that I had on my trip through South Carolina. The parking lot was spacious and free of charge, the room was clean and comfortable (with a balcony I might add), there was shuttle service to the historic district, and the two young ladies at the front desk were super friendly. Plus... there...\n\n\nMore', u'Rooms are spacious, and very clean. Free parking and yummy full (free) breakfast. Free shuttle to downtown after 530pm which saves on trying to find a space to park.\nNice that you can bring your pet for an extra $100 because kennels cost much more than that!\nSuper quiet, not a party spot so perfect for families with small kids.', u'My husband and I spent a few days between the holidays in Charleston, and since we decided to take our two Chihuahuas, options are a bit more limited. We decided on the Residence Inn and it was a good choice.\nI had reserved earlier by phone, just to make sure I got a pet friendly room, and the person who...\n\n\nMore', u"We enjoyed our stay here with our dog. The room was nice and clean with plenty of space for four of us (plus dog) for a few days. Great small kitchen with all basic supplies, too. There's not much within walking distance other than a small marina and plenty of lawn space, however everything is close by. Downtown Charleston is...\n\n\nMore", u"We just returned from a 4 day stay at this lovely hotel. Very nice property, nice clean and large rooms, can't beat the free breakfast and dinner on Monday, Tuesday nights and dessert on Wednesday nights all included in the rate.\nThe rooms were clean, the staff very friendly. Just an enjoyable stay.", u"I've had the pleasure of staying at this Residence Inn for the last few months while on a company business trip. All I can say is the people here really make the difference and go the extra mile to keep their customers happy. They also take the time to get to know their long term guests which makes it a...\n\n\nMore", u'Just finished up a three day business trip to Charleston. This is my favorite Marriott on business or personal travel in the Carolinas. I have been staying at this location for over eight years now business and pleasure. The Residence Inn is in a great location only a few minutes from downtown. The property has gone under a major renovation...\n\n\nMore', u"The best part of this hotel is the shuttle service downtown. Decent continental breakfast. The rooms were tired and you can get a view of the ugly roof out your window as I had. Did also hear dogs barking and smelled wet dog as well. This would not be a hotel I'd return to.", u"My parents and I are visiting Charleston for a quick two-days before I run a half-marathon in Savannah. We arrived late Wednesday night after flying into Savannah from Minneapolis/St. Paul, and that's when the hotel started to exceed our expectations. Upon check-in, the hotel staff let us know that there is a free shuttle that takes guests into the historic...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/46/94/51/riverview.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'2260', 'title': u'French Quarter Inn Hotel, Charleston', 'rating_string': u'5.0', 'address': u'166 Church St, Charleston, SC 29401', 'review_list': [u'As returning guests we truly looked forward to having a memorable celebration. Glori of the French Quarter Inn Front Desk and Guest Services made us feel like returning family. Our room was perfect and enjoying the complimentary breakfasts started every day in grand style. Of course the small, intimate boutique hotel is ideally situated near the Markets and very convenient...\n\n\nMore', u'We really enjoyed our stay at the French Quarter Inn. We arrived a day early because of an approaching major snow storm and the front desk agent was very gracious and honored my original rate and even upgraded us to a lovely suite with a fireplace. It was cold that weekend so very much appreciated.\nOur room was large and...\n\n\nMore', u'I have travelled all over the USA for business and pleasure for the past 45years but have never stayed in such a wonderful hotel! Never having been in Charleston before I researched the web and found this jewel. From the moment we arrived the service and welcoming was outstanding. We had arrived in town around noon and thought we would...\n\n\nMore', u'We had a long weekend here and felt spoiled rotten. The service was amazing, the amenities superb. The extras- delicious coffee all day as well as lemonade, waters etc not to mention wine and cheeses in the early evening, cookies and port at night plus a lovely continental breakfast in the lobby or your room in the morning add up...\n\n\nMore', u'From the moment we arrived we knew this was a special place. We received great recommendations for meals. The location is perfect with comfortable, spacious rooms. The valets at the doors were always friendly and made sure you knew where you were heading. More than once we were re-directed, always to our advantage! And...at the wine and cheese receptionist the...\n\n\nMore', u"This is a small hotel, more like an Inn, in the heart of Charleston's historic district. The hotel is within walking distance of nearly all of Charleston's highly-rated restaurants, nearly all tour starting points, the Market (don't bother with it except as a rally point), and the water taxi's.\nThe hotel's service is friendly and professional. The rooms are adequate...\n\n\nMore", u'Located right in the heart of Charleston. My husband and I took advantage of the free bike rentals at the hotel and rode over to Kings street for shopping and to concert venues. I wish I could go back to the French Quarter Inn! Loved the wine and cheese hour and the night cap. We also loved the breakfast in...\n\n\nMore', u'We stayed just a couple of nights in December, but wish we could have stayed longer. Since it is right down in the historic district, you can pretty much walk to many of the places to see. Looking forward to the next time.', u"We just spent three days here, although the weather wasn't great, the hotel over delivered. The people that greet you, Matthew is great, and the staff at the front desk, the staff at the great breakfast buffet which has everything you would want. The afternoon wine and cheese is a nice addition. The room is lovely and quiet, great bed,...\n\n\nMore", u"I'm a seasoned traveler. I don't gush easily. This is my favorite hotel ever (over Maria Christina in San Sebastian... more than Alfonso XIII in Seville). Is there a restaurant? No. Is there a spa? No. Who cares? Why do I go to a hotel??? For wonderful people, a lovely setting, immaculate room, over the top service... This place is...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-fw/05/8d/c7/a3/lobby--v1847553-22.jpg'}
{'category': 'hotel', 'review_count': u'1350', 'title': u'Hampton Inn Charleston - Historic District Hotel', 'rating_string': u'4.5', 'address': u'345 Meeting St, Charleston, SC 29403', 'review_list': [u'This hotel has a good location, with a free downtown trolley stop just across the street. The staff was friendly, helpful and professional. The complimentary breakfast was unusually well-stocked with a variety of choices. The room was clean and comfortable, although a little small by Hampton Inn standards. Overall, we were pleased but encountered several issues.\nBy all appearances, this...\n\n\nMore', u'This was my fourth stay at this property. Again, I enjoyed the spacious lobby, varied breakfast, convenience to downtown destinations, and accomodating staff. This time I had a ground floor room far from the noise of the lobby, with a comfortable king bed.\nIt adjoins the Camden Street parking garage (City of Charleston) and the Charleston Music Hall, where many...\n\n\nMore', u"I thought this was a great value hotel and considering location I would stay again. I also have a great stay at all Hampton Inn hotels. It's a sure thing. Hampton Inn does a great job with the breakfast. It's nice not too worry with expensive breakfast at the typical fancy hotels. This hotel is elegant yet economical. Also... I...\n\n\nMore", u'Loved our stay at the Hampton Inn. Staff was very accommodating. The location is ideal for downtown Charleston. The room was clean and the linens were crisp. I would stay there again. Breakfast was hot and yummy.', u'This Hampton Inn is in a great location and the staff was awesome. The breakfast was average.\nWe had 2 minor problems that were resolved. When we first got to our room, there was a very musty odor, and they gave us another room 2 doors down immediately.\nOn the second night, there was no hot water, and I reported...\n\n\nMore', u'Everything about our stay was EXCELLENT. The location allowed us to walk to all of our events and meals. The front desk and bellmen/doormen staff was OUTSTANDING and TYPICALLY CHARLESTON FRIENDLY. The large lobby allowed us to get together to meet and talk in a warm environment. The warm chocolate chip cookies in the afternoons is reason enough to stay...\n\n\nMore', u'Close to Marion Square, a block away from King Street, across the street from the museum, this hotel is in a good location and has affordable rates. The staff is friendly and service is good. The complimentary breakfast offers a large selection of items, with plenty of seating room in the spacious lobby area. A city parking garage is right...\n\n\nMore', u"My husband and I stayed here for 2 nights while in Charleston. The best part about the hotel is honestly its location. It's right across from the visitor's center which means that it's also right across from the main free transportation line (the trolley shuttle that go around the city). All 3 lines stop here. The hotel has the schedule...\n\n\nMore", u"We like the convenient location to the Visitor's Center, the free trolley, the museum, other close by ammenities, and most of all the warm, friendly, helpful treatment by all staff members. We also look forward to the warm cookies in the afternoon, the always available coffee, tea, & hot chocolate, the variety of flavorfull choices for the complimentary breakfast", u'Only about at 10-15 minute walk from the major attractions in Charleston, 20 minutes all the way to the Battery Park. The Hotel staff were all very friendly and knowledgeable of the area. Breakfast was great, various options plus offered a great coffee bar. The room was nice, standard hotel room but very comfortable bed. I would stay at this...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-p/09/26/71/a1/carriage-wheel.jpg'}
{'category': 'hotel', 'review_count': u'2401', 'title': u'Belmond Charleston Place Hotel', 'rating_string': u'4.5', 'address': u'205 Meeting Street, Charleston, SC 29401', 'review_list': [u'I was at the Belmond Charleston Place for a meeting of a professional organization. The meeting facilities were ok, nothing to write home about, but as they were in a remodeled movie theater, you have to cut some slack. The rooms, amenities and shops were excellent. The staff was very attentive and responsive to any questions. While I did not...\n\n\nMore', u'Incredible location, gorgeous room & bathroom; even though in the heart of downtown it was perfectly quiet and peaceful at night, and staff was SO wonderful! We did make the mistake of ordering champagne & strawberries; we were charged $150, but after looking it up the exact same bottle of champagne sells on Amazon for less than nine dollars... so...\n\n\nMore', u'Best experience from beginning to end. Friendly staff and very accommodating. Even had someone from maintenance staff in corridor ask if we enjoyed our stay as well as thanking us for choosing this hotel.', u"The Belmond Charleston Place is just a beautiful property located in the heart of town. The public areas are stunning and have beautiful artwork to accent the wonderful architecture. The guest rooms are luxurious and possibly one of the most comfortable beds I've ever slept upon. The Food throughout the week was amazing, from meals to snacks i loved it....\n\n\nMore", u'The accommodations were great. Our room was modern and clean and gave us a great view of the city.\nThe hotel has an old world feel with modern day charm. I would recommend this hotel to anyone and will be staying here later in 2016. From now on every Charlestown trip gets booked here.', u"The staff was so interested in making us comfortable. I am picky about staying in hotels and this was the cleanest one ever, from the common areas to our suite. Immaculate. We didn't want to venture far so we ate at the Grill. It was the best crab cake I have ever had. There are a lot of really well...\n\n\nMore", u"We were celebrating our 30th anniversary and I let them know in advance. We had a one bedroom suite, 4G, and it was lovely! Within our first 24 hours we had a beautiful flower arrangement, very good champagne and a delicious chocolate cake with strawberries! The staff throughout our stay was so helpful...we didn't know until our next to last...\n\n\nMore", u'We thoroughly enjoyed our stay at Belmond! Very centrally located, convenient to shops & restaurants and staff goes out of the way to make your stay as good as it could possibly be!! Do recommend that you stay on the club level. Great amenities and cost well worth it!', u'Everything about this place was simply perfect. As we entered the lobby to check in I was greeted with the lovely scent of fresh lilies (my favorite) and the view of an exquisite staircase with a stunning chandelier. Our room was beautifully decorated and newly renovated (could still smell the fresh paint...mmm). We stayed on the club level so we...\n\n\nMore', u"What a great hotel! My wife and I were treated excellently and our stay was great. The concierge was extremely helpful in guiding us about the city. The club level perks were extra special with delicious food and beverage throughout the day. We can't wait to go back!"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/08/0a/c2/76/belmond-charleston-place.jpg'}
{'category': 'hotel', 'review_count': u'2293', 'title': u'King Charles Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'237 Meeting Street, Charleston, SC 29401 (Formerly BEST WESTERN King Charles Inn)', 'review_list': [u"We were pleasantly surprised by the King Charles Inn. We located the excellent deal on the TravelZoo website, and being first timers to Charleston weren't sure if we picked the right location or quality of hotel. Very charming place with large well-appointed rooms. Fantastic location, literally a 3 minute walk to the heart of King Street for all its shopping...\n\n\nMore", u"We stayed one night, but it was perfect. it's in a great location to everything you want to see/do in Charleston. The staff is very friendly and the room was perfect size. Definitely recommend staying here!", u'This hotel is the best of everything. Large rooms that are comfortable, pretty and quiet. the location is superb. It is close to everything. The staff could not be better. the cheese and cracker reception in the afternoon is just another bonus. I will stay here again when in Charleston. It exceeded my expectations.', u'Great Experience! Very nice room. Loved the charm of the hotel. There were such a wide variety of places to see so close that you could walk to get there. Would stay here everytime I come to Charleston.', u'Prefect location right in the middle of historic Charleston. It made getting to and from everything extremely easy. The hotel was very clean and the staff was welcoming. They even offered advise on places to eat and activities to try.', u"Stayed for two nights. Very friendly welcome and advice from the front desk about what's going on and where to eat. A really great location overall.\nMy room faced the road which I can imagine gets very busy during peak season but for my stay it was quite quiet. The neighbours however were not, mostly due to the thin walls....\n\n\nMore", u'Nice hotel in a very good location. Room was a little small, but expected in a downtown hotel. Staff was super friendly. The welcome reception was nice for a snack and a drink before heading out for dinner. The free parking is a plus since finding a spot otherwise in Charleston is difficult.', u'Great location, great staff, comfortable beds. This hotel is not in the college nightlife areal...It is more of a quiet and comfy lodging closer to the craft market, high-end shopping of King Street, and great restaurants.', u'Great location. Friendly, knowledgeable staff. Free parking. Clean, comfortable beds. Very welcoming atmosphere.computer and printer available for guests. Beautiful seating area with fireplace. Would recommend to stay when visiting Charleston.', u'The King Charles Inn is a lovely hotel that embodies the charm and character of beautiful Charleston....... we spent four wonderful days there and look forward to returning again next year and would definitely recommend to all of our friends!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/04/85/98/a7/hotel-entrance.jpg'}
{'category': 'hotel', 'review_count': u'1127', 'title': u'Town & Country Inn and Suites Hotel, Charleston', 'rating_string': u'4.5', 'address': u'2008 Savannah Highway, Charleston, SC 29407', 'review_list': [u'We are staying at Town and Country and having a very pleasant stay. The rooms are clean and everyone is friendly. The breakfast was good.\nThe front desk was helpful and the waitstaff was super nice. It is a short drive to downtown and the hotel price is very fair.', u'Huge lobby and friendly check-in.\nNice bed, quiet room, free parking, convenient by a short drive to downtown. Close to Citadel Mall and the box stores along Savannah Highway. Easy access from 526 or Savannah Highway. Cable was down supposedly but it was fixed quickly.\nLuxurious place for under $100 a night!', u'We were very pleased with our stay. It was a very nice room. The price per night was really good for the area. Took about 15 minutes to get to Charleston historical district. The food was good in the restaurant as well. I will definitely stay again.', u'We stayed at this hotel for 3 days and 2 nights. The staff were friendly and the hotel was very clean. On our last night we ordered room service and it was fantastic! The food was definitely filling. The only minor thing was that the bathtub kept draining but we only used the tub once (loved the huge shower!) so...\n\n\nMore', u'Chose based on other TA reviews. Very very clean. Nicely appointed. Good restaurant onsite. Nice pool and fitness area. Rooms very clean and nicely appointed. Staff very friendly and helpful. Only 10 min to historic downtown and 1/2 the price of downtown hotels. One caveat...we had room 130 which was lovely but butts up to wall leading to outside so...\n\n\nMore', u"I stayed here for 2 nights while visiting Charleston. It's perfect. Close enough to downtown but far enough out that the prices aren't insane. I had a king air bath suite. The room was large, clean and modern. The linens were so soft. The bed was cozy and comfortable. The air bathtub was a dream. You can open the pocket...\n\n\nMore", u"Room was very clean and beds were comfortable. Nice touches like black out curtains that really block the light and Keurig coffee makers. And the biggest, best surprise: a shower that actually had the little shampoo/conditioner/body wash/soap already in there! What a concept! I didn't have to duck out of the shower to grab those items 'cause the very nice...\n\n\nMore", u"This motel is extremely comfortable, well-equipped and well located. It's a 15 drive into downtown Charleston. Five star quality at a very affordable price. Beautiful crisp white sheets and comforters, comfortable armchairs, great bathroom products and a really lovely ambience. Coffee machine in room. Very clean and very quiet. Highly recommended.", u'Great staff, beautiful rooms, comfy and plush beds! My hubby, friends, and I loved the hotel and especially the air bathtubs and separate showers! We will return on our next trip. It is about 15 minutes from downtown, convenient to interstate, and plenty of grocery stores and restaurants.', u'This hotel was better than many resorts we have experienced. Queen beds and pillows, and even chairs were very comfortable. Keurig Single Cup provided in room, bathroom supplies were also very nice - even down to individuall-wrapped cotton balls and Q-tips. Bathroom and bedroom very clean and up to date. Room-darkening shades were nice. Halls well-kept. Pool looked clean and...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/02/f0/4d/42/ashley-suite.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'2097', 'title': u'Francis Marion Hotel, Charleston', 'rating_string': u'4.0', 'address': u'387 King Street, Charleston, SC 29403', 'review_list': [u'We recently stayed at the Francis Marion Hotel for business. The staff was OUTSTANDING. Each member of the Hotel Staff was so accommodating, friendly, and helpful.\nThe food at the Swamp Fox Restaurant was terrific. Several members of our conference wondered when we could schedule another conference at the hotel!', u"Visited for work and enjoyed the hotel. I didn't experience any paranormal activity but the walls are fairly thin and I could hear my neighbors and folks in the hall. Probably a trade off of staying in such a lovely old building, so just beware if you're a light sleeper.", u'Attended a conference at this hotel and was pleasantly surprised. This is a HISTORIC hotel. I am amazed at the number of reviews that criticized room size, features and amenities...not sure what they are thinking. The hotel opens with a elegant lobby with lots of chandeliers and marble. Rooms vary in size and appointments but all were clean. Each room...\n\n\nMore', u"This is the first time I've stayed here in 15 years when I was a student at CofC. It used to be the Westin Francis Marion but appears to now be independently owned and managed. The hotel is still beautiful and the lobby is impressive although there was a lot of construction going on when I was there. You can't...\n\n\nMore", u"Here for two day business trip --great lovation for brief chance to see this lovely city. I was upgraded to a room with a fantastic view -which I appreciated. However the room was quite small. The air-conditioning did not work well (so room got stuffy), skink clogged and dresser drawers wouldn't shut (banged knees). Pleasant staff and meeting rooms were...\n\n\nMore", u'My husband and I decided to visit Charleston for Christmas. We wanted to be able to walk around the city so we chose the Francis Marion Hotel mainly because it looked really nice when I looked it up on the web and read the reviews. We were not disappointed with our decision. The staff was really courteous and helpful. It...\n\n\nMore', u'The Francis Marion Hotel is conveniently located in the Historic District in downtown Charleston. Walking distance to great restaurants and shopping. The staff is very friendly and helpful. The rooms are a little small but thats a minor detail. I highly recommend staying here while visiting Charleston.', u'We enjoyed our stay at the Francis Marion Hotel! It was within walking distance from food, shopping, and the Waterfront Park. The beds and accommodations were comfortable, and the staff were friendly and very helpful.\nThe hotel is a throwback to historic Charleston with its grandeur and charm.\nWe were upgraded to a Harbor View room and the view was...\n\n\nMore', u'A historic and beautiful property in the heart of Charleston, SC. Despite small bathrooms, the accommodations and staff and second to none. The Swamp Fox restaurant was priced very well and the food was excellent. Any traveler experiencing Charleston should treat the,selves to a a stay at the FMH', u"Stayed for 3 nights for an onsite conference. The location is great for shopping and dining options. The staff was friendly with great customer service. The room was beautifully appointed. The bathroom is small as is to be expected for an historic boutique hotel. It works. Don't complain. Enjoy the history of this place."], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/01/cd/b1/9e/francis-marion-hotel.jpg'}
{'category': 'hotel', 'review_count': u'1564', 'title': u'DoubleTree by Hilton Hotel and Suites Charleston - Historic District', 'rating_string': u'4.0', 'address': u'181 Church Street, Charleston, SC 29401', 'review_list': [u'Great location and friendly staff. Right by the market. Hank is right next door but there are plenty of other dinner choices near by. You should plan to get up early and walk to The Battery while the city wakes up. When you get back there will be a nice breakfast buffet waiting on you. I will stay here again.', u'Hotel is in a great location and very clean. Our only complaint is that we had no hot water on day of check out. We reported it at the front desk and all she said was that she would make a note of it. Did not even apologize. Could not ask for a better location for downtown.', u"Cute southern charm. Was there for a company meeting. Rooms are fine, bathrooms a bit dated. Clean. Very well located! Great for business travel. It is what you'd expect from a doubletree. The location makes it ideal. Bed was comfortable. X", u'The Doubltree in Historic Charleston was a perfect location to walk around the city. The staff was great and the rooms were clean and had everything needed for a business trip. They went above and beyond to assist in getting to the airport for an early flight when weather was an issue.', u'The charming hotel is in a great location near the market and within walking distance of many great restaurants, shops and attractions. The staff were all welcoming, helpful and efficient from the Valet/Doorman to the Front Desk, maintenance, food staff at the meeting and the bartender at night. All made every effort to make us feel welcome and comfortable. The...\n\n\nMore', u'This was our first visit to Charleston. The location of the hotel is great! Close to everything. The staff was excellent! From the front desk to the valet employees, everyone was helpful and very friendly. The first room we were assigned was a 2 story layout on the 2nd floor. While the room seemed nice we had a "funny" feeling...\n\n\nMore', u'This hotel is ideally situated in the market district of Charleston, and everyone treated me as though I was a special guest. The rooms were clean, the towels were soft and thick, and the bed linens felt great on my skin. The safe was easy to use and the complimentary coffee was delicious.', u'Meet there for a meeting in the lobby room,great staff,parking,close to the famous market,walking distance to stores.gift shops,points of interest,restaurants,Just a great hotel in the right place.Walking distance to everything.', u"The gym does not open until 8am which is crazy. If you like exercising don't stay here (unless you are a runner and it is nice to run around the city). Rooms are dated and bathrooms are tiny. Staff is polite", u"My back is killing me- awful mattress! !!\nRight next to VERY loud elevator. So glad to be home where i can actually sleep. Love Charleston but I will never stay at that hotel again. The location is good but that's about it. Really pissed me off to spend close to $300 a night and the bedding is that horrible....\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/06/a6/83/b5/doubletree-by-hilton.jpg'}
{'category': 'hotel', 'review_count': u'1597', 'title': u'Harbourview Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'2 Vendue Range, Charleston, SC 29401', 'review_list': [u"From the moment we pulled up the staff went out of their way to welcome us. The room was beautiful and we wished we could stay longer. Loved the extras - afternoon tea, evening wine and cheese, later cookies and milk. It couldn't have been convenient to restaurants, shops, and sightseeing. Thank you all!", u'We stayed at the Harbour View Inn for two nights, when we checked in we were upgraded to a large and beautiful suite! Two large four poster beds, a big room with lots of light, space and a beautiful bathroom, filled with gorgeous products! Our car was parked in their garage with valet, which we thought was quite expensive at...\n\n\nMore', u"This hotel is in our top 5 world-wide, although my wife feels it's top two. The service is impeccable, the amenities are first rate and the bed is incredible. The bathroom has a shower that urges you to stay until the hot water runs out, which, of course never happened. Breakfast delivered to the room (they even call to tell...\n\n\nMore", u'The most amazing bed! Also, their WiFi speeds were good (about 5 MB download). The view is amazing from the room, they include a wine and cheese reception, and fresh baked cookies in the evening. Plan on paying $24 a day for their valet, or parking several blocks away for less.', u'As far as the hotel goes, it is over priced.For the majority, lovely efficient staff. However, having booked a waterview room & getting a brick building view with about 1" water viewed I was less than happy. We arrived exhausted so went to bed, the next morning (Tue 20th Sept \'2015) we went to reception to complain - they said...\n\n\nMore', u'The Harborview Inn is a charming, well appointed and comforting home away from home that epitomizes southern hospitality at its best. My wife and I can offer an enthusiastic recommendation to use it as your base of operations while visiting Charleston. It is situated within easy walking distance of excellent restaurants, charming nineteenth century residences and historic buildings. Ask for...\n\n\nMore', u'Harbourview Inn is located within an easy walking distance to the Market area, shops, and area restaurants. Our room was large, clean, and quiet with a great view of the bay and park. We stayed here for 2 nights - January 20-22, 2016, at a very good price which included valet parking and breakfast. The breakfast was delicious with fresh...\n\n\nMore', u'This is our fifth time visiting your hotel. Everything is top notch, one of the most relaxing and comfortable places to stay. The location is great and walking every morning along the battery is an excellant way to start a day.\nComing back to our room for a nutriously breakfast is also a plus. The wine and cheese in the...\n\n\nMore', u'My husband and I stayed at Harbourview earlier this month for an overnight getaway without our children. We saw it on a Travelzoo deal and booked it as part of our Christmas present to each other. We were very impressed! From the moment we arrived and checked in, we felt like valued guests. The front desk and valet staff were...\n\n\nMore', u'A plus - first class service - Amazing location - the views are outstanding - love the hot tea, fireplace in the room - free cheese and cracker everyday - free cookies every night - if you are looking for a great place to stay - this is it! You will be very happy!!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/ee/d9/78/harbourview-inn.jpg'}
{'category': 'hotel', 'review_count': u'1576', 'title': u'The Vendue Hotel, Charleston', 'rating_string': u'4.5', 'address': u'19 Vendue Range, Charleston, SC 29401', 'review_list': [u'The servers and bartenders were very friendly. Great place to go for a rooftop bar drink. Very happening place that seemed to have a lot of locals. A great time with reasonable prices. Great views and makes for an awesome photo.', u'Vendue is really nice and in a great location. Very friendly and accommodating staff. The art makes if fun to explore the hotel. Very close to the water and to the City Market. Bikes are available. I did not use one, but it would be great to use along the water and the Battery. Rooftop bar was fun and the...\n\n\nMore', u"We had a great stay at the Vendue. It's location can't be beat. It is located within walking distance to a lot of great restaurants and activities. The rooms were spacious and clean. The beds were very comfortable. The staff were always friendly and helpful. They have a roof top bar which is a great place to have a drink...\n\n\nMore", u'Our first but not last visit to the Vendue. Cannot say enough about this hotel. Location is perfect, hotel d\xe9cor is wonderful and the folk who work there are the most friendly, helpful people! It definitely is worth a visit! Cannot wait to go back.', u'My boyfriend and I returned to the Vendue to "right a wrong."Last February, we anticipated a great stay at the Vendue only to face a series of unfortunate mishaps- the quiet room ended up being a noisy one on the main floor; the heat was not cooperating and the plumbing had issues. We have stayed in enough hotels to realize...\n\n\nMore', u'My husband and I were looking for a romantic quick get-away from New York, and Le Vendue certainly provided it. We had a lovely Fireplace King room, and given the exceptionally cold weather last week, how wonderful it was after a day of walking in the wind and cold to sit in two easy chairs pulled up to the fire...\n\n\nMore', u"The hotel is easy to find and the location is great, everything is within walking distance - self-parking is available for $17/day at a nearby parking garage. The staff was very friendly and accommodating. We asked for a room with two beds at check-in, but they didn't have any availability for our first night. We were however switched to another...\n\n\nMore", u"A modern twist to typical Southern elegance makes The Vendue the best hotel South of Broad. Steps away from a few of Charleston's most notable attractions, The Vendue is the perfect place to experience Charleston. Rooms are a tad small, but the hotel is comfortable...and its not like you go all the way to Charleston to sit in your room!", u'Beautiful hotel within walking distance to many things Charleston has to offer.A very attentive staff from the restaurant recommendations, free Starbucks coffee in the am, afternoon wine reception and nightly turn down service made our 1st trip to Charleston amazing!', u'We had a lovely stay in a lovely spacious room (fireplace in the bathroom!), beautifully appointed, very comfortable, clean and quiet. The staff, especially our valet Shea, were all very kind, helpful and gracious.\nCharleston was as charming as we had hoped. The weather was unusually cold, so we hope to return at a warmer time.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/08/20/b9/02/the-vendue.jpg'}
{'category': 'hotel', 'review_count': u'2496', 'title': u'The Mills House Wyndham Grand Hotel, Charleston', 'rating_string': u'4.0', 'address': u'115 Meeting Street, Charleston, SC 29401', 'review_list': [u'We had a great stay at the Mills House! My husband and I stayed for six nights while attending a wedding in Charleston. The staff were extremely hospitable and willing to accommodate our every need. As part of the wedding party, I made several requests and arrangements with the help of the staff who went above and beyond to make...\n\n\nMore', u'My husband and I got away for the weekend and had the best time at the Mills house. Customer service is amazing. The doors were held open for us, the staff was always smiling and genuinely seemed to like their job. Everyone! Valet, concierge, front desk and the cleaning crew. The room was nicely decorated and very clean. Overall great...\n\n\nMore', u'I loved The Mills House Wyndham Grand Hotel. This hotel was beautiful, I felt like royalty while staying there. The hotel was beautiful, staff very friendly and helpful. I definitely plan to stay there again for a longer visit in the near future. Thank you', u"For families with small children who pack their house for a weekend trip, just know the rooms are small. I'm sure this is due in part to the age of the building and its location. We were able to rearrange the furniture to make it work in a king bed room with the Pack&Play off to the corner. It's not...\n\n\nMore", u"Great hotel centrally located to the heart of Charleston! Very well managed with fabulous customer service and staff! Quaint and comfortable rooms with THE most amazing pillows! For someone who travels on a regular basis, I've put the Mills House on my repeat stay list! Thanks for an amazing second visit! I can't wait to return again!", u'Remodeling awful. Was a great retreat with Southern charm, what you would expect for Charleston. The remodel looks like a Las Vegas bordelo. Simply awful, even the nice intimate bar was converted in the theme of a bus station.\nHad stayed at Mills House many many times over 25 plus years. Never again', u'Would often go to The Mills House for Friday night Happy Hour, & loved getting together in the small bar off the main entrance. It was quiet, intimate, & a lovely place to catch up with friends. Unfortunately, I guess the small bar is no longer open on a regular basis, so we ended up in the larger bar/dining area....\n\n\nMore', u"We stayed at the Mills House in January for a wedding. It is a wonderful place to stay in the heart of historic Charleston. It is large, very elegant and the rooms are lovely. It was cold so we didn't get to use the pool or courtyard, but it looked like it would be a great place in the summer...\n\n\nMore", u'Having earned two free nights by being Wyndham Rewards member, my husband and I decided to spend our anniversary weekend at the Mills House in Charleston. I warned my husband not to expect much of the room,as it was completely free. Boy were we surprised! We arrived early and were greeted with smiles and our room was ready for us....\n\n\nMore', u"This venue is bright, clean, and well located to shopping and restaurants in Charleston. The rooms are large and very well appointed. The service was very attentive and friendly. We loved our stay and will be making this our 'go to' place when in Charleston."], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/01/e2/2d/98/since-1853-at-the-corner.jpg'}
{'category': 'hotel', 'review_count': u'986', 'title': u'Market Pavilion Hotel, Charleston', 'rating_string': u'4.5', 'address': u'225 East Bay Street, Charleston, SC 29401', 'review_list': [u'The rooftop bar is a great place for late-night drinks and dessert or a meal. Our dessert was great and the waitress was attentive. Even in January the rooftop bar was warm and busy and the views were great. We will definitely go back, hopefully in warmer weather.', u'We had a wonderful time last weekend at the Market Pavilion. It was a spur of the moment trip I decided to surprise my wife with. The reservation agent, Austin, was fantastic and was able to get us a room facing the harbor with a "Juliette" balcony. We loved it, stepping out in the morning for a hug and a...\n\n\nMore', u"I enjoyed a long weekend in Charleston recently with my husband and in-laws. We returned to the Market Pavilion because our first experience there four years ago was so fantastic, we knew we'd return there the next time we'd go to Charleston.\nWe stayed on the concierge level again which is just wonderful. The sense of camaraderie among guests on...\n\n\nMore", u'Planned to stay only two nights but ended staying for four due to cancelled flights headed North. This hotel is perfectly located for everything...especially great restaurants. Blossom, Magnolia, SNOB, Amen etc etc. It was particularly perfect because the weather was bad. Staff was very accommodating, rooms comfortable and inviting, upstairs rooftop bar cozy, even in bad weather and the jazz...\n\n\nMore', u'For out anniversary/birthday celebration we stayed at the Market Pavilion for 3 nights. The service was wonderful! We had concierge access on the 4th floor and it was worth the extra money! Hot breakfast each morning, champagne, beer or wine from 6-8 every evening. The room service was timely and the beds were very comfortable. We stayed in a corner...\n\n\nMore', u"Weekend get away with my wife. The hotel and staff are top notch! Love the continental breakfast on each floor for a lazy morning wake up. You are literally next door to the market. You can be at many restaurants within 10 minutes walking. The restaurant in the hotel is beautiful and I'm sure fantastic but was not on our...\n\n\nMore", u'The wife and I in town again for business and we chose the Market Pavilion for a change up. Staff was great and I especially enjoyed taking to the bell staff. Good folks.\nWe usually have to walk to the restaurants on East Bay Street but staying here offered all of the awesome restaurants closer to our room. Nice to...\n\n\nMore', u"This is one of our favorite Hotel's all of Charleston The staff is always friendly and looking to make our stay comfortable and convenient. The hotel has great rooms with comfortable beds and pillows along with the roof top bar which is exceptional.", u'This hotel is beautiful and central, has a wonderful ambiance, bar, and restaurant. We made our reservation directly with someone at the front desk prior to our arrival. We arrived around 9pm and the front desk checked us right in and we were on our way. Room service was amazing and Kim the concierge at the hotel made it a...\n\n\nMore', u'Top notch experience! Market Pavilion has it all, beauty, comfort, style without pretentions. The rooms, both bedroom and bathroom were spacious with every amenity. Most appreciated was the luxurious bedding, linens and pillows. The bathrobes and slippers, bedtime biscotti, in-room bottled water all made it generous and comfortable.\nWe particularly enjoyed their "continental breakfast" set up in hallway each morning....\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-fw/05/8d/f9/00/rooftop-pool--v1202401-44.jpg'}
{'category': 'hotel', 'review_count': u'591', 'title': u'The Restoration on King Hotel, Charleston', 'rating_string': u'5.0', 'address': u'75 Wentworth Street, Charleston, SC 29401', 'review_list': [u'My husband and I just got back from a 4 night stay in the newly finished Restoration. The rooms and hotel are really nice. However, the service we received was by far the worst service I have ever received at any hotel! I was actually appalled. The housekeeping does an awful job, definitely bare minimum. Never refilled the kitchenware so...\n\n\nMore', u'This is the best hotel we have been to in years ! Heath at the front desk was so helpful and understanding .. Valerie in housekeeping went above and beyond for us as well as all the staff at this hotel. We would highly recommend ! We will return again for a visit.. Hopefully soon!', u"This year we chose to spend Christmas in Charleston as the family member living there couldn't come HOME. We have spent Spring Breaks on Kiawah Island (in a modest rental through the 2nd gate) but this visit we wanted to create our home for Christmas in the heart of Charleston. The Restoration offered a living room and a full modern...\n\n\nMore", u'Three nights of luxury and great service. Excellent view of downtown Charlestown. Get a room with period furnishings.\nThe history and ambience of King street is worth the experience.\nA magical hotel with tasteful decor and professional staff.', u'Given the price of this hotel, I hold it to a higher standard than a Hampton Inn. So, that said, the good: Excellent Location! Super friendly and helpful staff! Great restaurant that just opened! And very nice condo/suite that was comfortable and nicely furnished.\nTHAT said...here is the bad! The housekeeping is terrible, and maintenance is sorely lacking! I took...\n\n\nMore', u'6 of us visited the seventh floor bar of this newly opened hotel. The views of Charleston were wonderful! They have only been opened for app. 2 weeks yet the service was prompt. Only had some drinks and appetizers but if they were a reflection of the hotel you are in for a treat.Tamara, at front desk, was friendly and...\n\n\nMore', u"We've been to Charleston about 8 times but first time at Restoration. We were in the original building upgraded to a one bedroom with balcony facing Wentworth Street. The third floor condo & balcony were huge & nicely furnished. They were opening the new building that week & there were a few snafu's but I would absolutely go back. Our...\n\n\nMore", u'This was our second stay at Restoration. Both times the hotel was very accommodating and very quick to please. Each time we took a one bedroom unit. The first time we had a unit overlooking King Street which was very quiet and this time we had the Wentworth Street unit with a porch. Although the spacious porch is a nice...\n\n\nMore', u'Overall I thought The Restoration on King was a good experience. The rooms are very unique in that they are more like huge loft apartments equipped with a full kitchen, washer/dryer and everything else you can possibly imagine. Overall it was pretty clean (aside from the construction that was taking place) however there was a smell of what seemed like...\n\n\nMore', u'Our suite, 203, was everything you could want in a home away from home. The hotel retains the historic Charleston architectural details (brick inner walls, high ceilings) yet is modern in all amenities. Staff is great, location is the best, and it is the best way to enhance a visit to Charleston.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/01/79/8d/99/historic-king-st-location.jpg'}
{'category': 'hotel', 'review_count': u'735', 'title': u'Comfort Suites West of the Ashley Hotel, Charleston', 'rating_string': u'4.5', 'address': u'2080 Savannah Hwy, Charleston, SC 29407', 'review_list': [u'Low price but excellent room. Service was great, breakfast was above quality. Would recommend this hotel to anyone traveling. Will stay here again if ever this way again. Nice stay before boarding for our cruise', u'Our first impression from the outside was clean. Entered the lobby obtained a room for the night and was very pleased. Great bed and a quiet night. Breakfast was good and the hot foods were hot and the milk was cold.', u'Very well maintained hotel; spacious rooms/suites with comfortable beds; reliable internet service also. Breakfast had several options and was restocked quite often. Manager and staff were friendly and helpful. Location is right of I526 close to mall and easy trip to downtown.', u"clean room, spacious, clean bath, everything about the room+hotel was nice. would recommend it. only problem is that the username and password provided for the wifi did't work :-/ ment to tell manager about it but got sidetracked.", u"We were a group of three and stayed there for 1 night and they didn't charge for the additional person, everything was clean and new, free parking and breakfast made everything perfect for us...\nWe got a discounted rate which made it quiet reasonable for 3 people!", u'What a great hotel! Mary Landry at the front desk was superb! She had several challenges she faced the first night we were there, but you could tell her concentration was on providing a quality hotel for her customers. The hot breakfast was a major plus for us. The beds were comfortable, rooms were spacious, and the bathrooms & towels...\n\n\nMore', u'This is a nice Comfort Suites near Charleston. We stayed here three nights leading up to New Years. The rooms are clean and spacious. The breakfast is as expected from Comfort Inns, good.. If there could be a complaint it would the noise from the pool coming up to second floor and the breakfast area to get your food is...\n\n\nMore', u'We stayed here visiting family on Christmas break. It was clean, quiet and had a great breakfast spread. Although it was full rooms were quiet and people were friendly. Great value for the price. Only spent the night though.', u'I stayed at the Comfort Suites for attending wedding June 2014. Very busy location. The service was well done and even the other hotel guests were nice. Indoor pool that my family enjoyed. Decent, typical hotel breakfast. The room was a very spacious suite, two queen beds, with a separate living room area with a pull out sofa. The bathroom...\n\n\nMore', u'Best beds ever! The hotel staff was very courteous at check in. My room was very comfortable. The free breakfast was ok; great value! Highly recommended this hotel if you have back problems bc their beds are great! Very close to everything; great location.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/01/b0/6a/5c/comfort-suites-west-of.jpg'}
{'category': 'hotel', 'review_count': u'781', 'title': u'Holiday Inn Charleston Riverview Hotel', 'rating_string': u'3.5', 'address': u'301 Savannah Highway, U.S. Highway 17, Charleston, SC 29407', 'review_list': [u'We have an Emotional Service Dog. This property is no pets but they were so welcoming to our dog. The front desk to the cleaning staff made us feel welcomed. The shuttle to downtown was excellent. Nice to not have to park in downtown Charleston. The average parking lot fee we saw was $12 with no in/outs. Love the view...\n\n\nMore', u'We went there for my birthday las weekend, this hotel is close to the downtown and it is really nice, well the rooms are kinda small but the view is beautiful, staff is really friendly. And their restaurant on the top floor is wonderful; food is a little expensive but really tasty!', u"We've stayed here numerous times over the years. The grounds are not very big, but no one really stays around in the day anyways. Charleston is a beautiful, amazing city! We go as much as possible and this is always a great pick! Staff is always friendly and has given us anything we asked (upon request, not always in the...\n\n\nMore", u"Do not stay here! Unless you don't mind having roaches in your room. Me and my husband left immediately after finding two monstrous cockroaches.To make matters worse, the front desk clerk tried to down play the incident by suggesting they were palmetto bugs.... which in the very definition is called the American cockroach! Just don't even bother, I suggest staying...\n\n\nMore", u'Great staff clean rooms restaurant /bar were awesome would stay there again. Great location for both down town and the beach. The view from the restaurant was amazing both at night and during the day. We are planning a trip there again sometime in the near future.', u"Some of the best views in Charleston from the restaurant and bar on top floor. Great for lunch or cocktails. Good Holiday Inn Resort for out of towners. Plenty of parking, convenient to The Citadel, Joe Riley stadium, downtown and even a quick trip across the bridge to Mt. Pleasant isn't that far.", u'Charleston was beautiful and we absolutely loved it. There was so much to do - horse and carriage rides, helicopter trips and boat rides. We will certainly be back. The hotel was very conventiently located and comfortable.', u'I am writing from my room. I just came back from the rooftop restaurant where I had the worst dinner ever. My room had a combination of roach infestation and clogged bathtub drain. The bed and bathroom floor had hair all over them. I am totally disgusted with this place. The roof top restaurant offers great view, but terrible food....\n\n\nMore', u'This hotel was a great deal for the price. Room was clean and confortable. Breakfast was very good...buffet style with good choices. The shuttle from the hotel and back runs every 2-3 hours and was a real bonus. Had a great time in charleston, a city with a very different feel and look.', u'View from restaurant is great. Free parking is a plus. First visit our tub was clogged. This visit we were put into a handicap room due to unavailability. There was no way to keep the water in the shower so we were moved. Room was better but tub broken again...'], 'img_url': u'http://static.tacdn.com/img2/x.gif', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'516', 'title': u'Holiday Inn Express Charleston Motel', 'rating_string': u'4.5', 'address': u'1943 Savannah Highway, Charleston, SC 29407', 'review_list': [u'The room is large and well organized. There is room for all your things without having to move telephones, coffee pots, chairs and other items out of your way. The bed was a little too firm for me but it was clean and comfortable. We slept well. There was no noise or other outside distractions. The food in the cafeteria...\n\n\nMore', u"We had an excellent stay there. The trolley line is right on the corner and it takes you to the visitors center where you can get information to do a walking tour or take the trolley. There is free breakfast and the decor is contemporary. The only thing we didn't like was the heat unit for the room. It cycles...\n\n\nMore", u"Staff is fantastic, location is very convenient, breakfast great. Would recommend & will definitely stay again. My go-to place in the area.\nThis is a very nice place to stay for a moderate price. You're 10 minutes from downtown Charleston with a very easy commute & staff is so helpful and respectful.", u'Stayed one night and about 6:00am. The diesal trucks parked in front roared at the front door while their drivers ate breakfast. We complained to no avail. Left never to return. If you like to sleep late stay somewhere else!!! Was clean but do not protect guest from noise-- the mgmt should have not let diesal trucks park next to...\n\n\nMore', u'The hotel has been recently updated. Everything was clean and the staff was always very helpful. Sherry at the front desk helped us with any questions we had about the local area. Coffee and tea were available 24 hours and cookies at night. The rooms had refrigerators and a microwave.', u"Very Clean, entire staff was very friendly: they get it right. Great Breakfast that even includes a cinnamon roll. WOW! Really simple route to get downtown and if you don't want to drive they also offer a shuttle to downtown. There is a commuter parking area behind the hotel lot so there's never a problem parking. Only problem is the...\n\n\nMore", u'This is my third visit to this property and I really should remember to read my own notes. The hotel is well located, plenty of parking and on the free trolley bus route into downtown. The amenities are fine the rooms are a good size and clean. The only thing to remember is to get a room on the south...\n\n\nMore', u'Everyone of their staff members were amazing, especially the cleaning ladies who went above and beyond at helping us during our stay! Loved that our room had a microwave and a refrigerator, which was nice for storing things that I hijacked from the complimentary breakfast.', u'Very clean, staff very friendly: valet, front desk, breakfast staff. Only negative thing is the street noise. We stayed on a friday night in december, there was music from a couple blocks away going on past midnight and first thing in morning street traffic .', u"We enjoyed our visit to Charleston and our stay at the Holiday Inn Express was adequate. The first floor room was convenient and the bed was comfortable. The lighting in the bath was OK but could be a bit brighter. The vanity sink had nice hot water as did the shower. The HVAC heating/air worked well and didn't have to...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/01/5d/fb/ea/front-entrance.jpg'}
{'category': 'hotel', 'review_count': u'1210', 'title': u'Embassy Suites by Hilton Charleston - Historic Charleston Hotel', 'rating_string': u'4.0', 'address': u'337 Meeting Street, Charleston, SC 29403', 'review_list': [u'The front desk staff was rude to me each time that I encountered them. Upon arrival, the entrance to the hotel had just been varnished (I arrived about 3:30 pm). It was difficult to see where to check in. The staff just stood around without offering assistance. Not welcoming at all. When I found the check-in, I was greeted with...\n\n\nMore', u'Did not tell us they were re-finishing the wood floors. The toxic fumes were overwhelming in our room. Called the front desk at 1:30 am telling them we could not breathe, they said they could not move us. Went to speak to the manager the next morning and was stupefied at her attitude! I was born and raised on Long...\n\n\nMore', u'Our stay was great! We showed up late at night and needed a room. We were told that they had a deal with the hospital and to just tell them why we were there. We did that, but the room they had was already taken. The man that helped us, gave us a discount on another room and was just...\n\n\nMore', u"I don't even know where to begin to describe the stay....The employees were all friendly and professional, the food was outstanding, and rooms were well appointed and very clean, and the lobby areas were the perfect setting for my family to gather and catch up during our short overnight stay at this hotel! The location was perfect as well, close...\n\n\nMore", u"My husband and I just spent two nights at this hotel. The location is great and most of the staff is excellent. However, the same can't be said for the management. While we were there, the hard wood floors in the lobby were being refinished. When we checked in around 2:00 pm, we were told the sanding would be done...\n\n\nMore", u'We stayed there for our 20th anniversary. The hotel was beautiful in a "very Charleston" way. A perfect blend of history and modern amenities. Our suite was great, with a bottle of wine and chocolate to welcome us. The evening reception was nice (free drinks and snacks!) and the breakfast had everything we wanted. The staff was very friendly and...\n\n\nMore', u'We had an issue with our reservation due to booking through a third party website (NEVER AGAIN!). But the Staff were super accommodating and made us feel comfortable with the situation until we got our refund. They went above and beyond and Then they even gave us a bottle of wine for our trouble. The free breakfast is a very...\n\n\nMore', u"The staff was friendly & helpful. Greeted us and engaged in conversation. The only negative....do not expect the rooms to look like what is on the website. They were clean, just aged/worn/stained couches & carpet. But I can't say enough that the staff was GREAT!!!", u"Had a wonderful stay on Friday January 22nd....It was very busy in the lobby area and at the front desk,but Hannah did a great job. Hannah was so nice and even though it was busy still gave great customer service. The evening reception was good and the breakfast was delicious. Everyone was very friendly.\nCan't wait to stay again!", u"Called to inquire ahead of time about getting a quiet room, given all the reviews about noisy outside construction.\nWas assured that the room I had faced the quiet park.\nWell yeah, great.\nExcept they didn't tell me that they would spend the entire two day weekend resurfacing the wood floors. This meant all the public spaces were UNUSABLE.\nThe...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-fw/05/8d/b5/bd/the-hotel--v945667-34.jpg'}
{'category': 'hotel', 'review_count': u'692', 'title': u'Indigo Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'1 Maiden Lane, Charleston, SC 29401', 'review_list': [u"The people were friendly and accomodating. The free breakfast foods delicious, and the complimentary evening cocktail party well supplied. The room was comfortable, and the location is great for touring Charleston, as it's so easy to get in and out for touring and shopping. A great place!", u'Took a weekend trip to Charleston, SC for the first time on a last minute notice. The staff was very polite in assisting a young couple. The hotel was in walking distance of everything. I would say very centralized. The wine and breakfast extras were a great treat. Clean rooms and overall nice feel. I actually forgot my Ipad at...\n\n\nMore', u'A favorite choice for our stays in Charleston! Our rooms are always clean and comfortable and decorated in the Charleston "style". The breakfast is delicious and pleasant to enjoy in the courtyard by the fountain or in our room. The location is perfect for parking our car in the on-site lot upon arrival and not moving it until departure (yet...\n\n\nMore', u'Excellent location for walking to wonderful restaurants and shopping local market or retail stores. Room was comfortable and bed was great. Breakfast in lobby was delicious and afternoon wine and appetizers were a great way to start an evening out. Staff was friendly and responsive to requests.', u'This is a most charming hotel, located conveniently in historic Charleston. The rooms are lovely, looking out at a inner courtyard. Wine and cheese are served in the afternoon which gave the opportunity to chat with some of the other guests. I hope I can visit Charleston again just to stay at the Indigo Inn.', u'Spent the night in Charleston before an event the next day. Got a great trip advisor deal. Nice rooms-clean, well appointed, comfortable with a nice bathroom. Rooms are on the small side-fine for us but just to be aware. The included breakfast was delicious and more than enough choices. The bread pudding was as good as other reviewers said. Staff...\n\n\nMore', u'We stayed at the jasmine house and every aspect of our stay was special. Being 3-4 blocks from great restaurants in all directions , plus having so many great things to do was an easy decision.\nHotel made our stay truly special.', u'Two night stay for my birthday. The room was lovely and comfortable. The courtyard lovely but too cold to sit outside while we were there. The wine and cheese in the evening was very nice and the breakfast was very good. Love having coffee and tea available all day and would suggest cookies a as a late night snack. The...\n\n\nMore', u'The room and property were quaint and beautiful. We enjoyed the complimentary wine and appetizer hour, and were able to meet some very interesting people. The breakfast was also very good. The property boasts a beautiful courtyard that is lovely for sitting and enjoying over a glass of wine.\nMy biggest complaint was with the parking arrangements. When I booked...\n\n\nMore', u'Great location, close to the action downtown. Accommodations were very good and the service was excellent. Very much enjoyed the afternoon wine and cheese and filling continental breakfast. Too, they have pet friendly rooms, and we found that that worked well. Lovely court yard to enjoy the breakfast and afternoon wine and cheese. We will stay there again.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/01/89/f2/52/indigo-inn.jpg'}
{'category': 'hotel', 'review_count': u'669', 'title': u'Wentworth Mansion Hotel, Charleston', 'rating_string': u'5.0', 'address': u'149 Wentworth St., Charleston, SC 29401', 'review_list': [u"We stayed here in December for a little couples getaway! The mansion is gorgeous and was decorated beautifully for Christmas. My only complaint was that location wise it didn't really feel close to either of the areas we spent a lot of time in. The East Bay Area was about a 15-20 min walk which at night was a little...\n\n\nMore", u'The pictures do not do the rooms justice. The location is also perfect in the sense you are close enough to walk to the shops and restaurants on King St but far enough away that you have some quiet and great views from the Cupola of all the downtown areas. The service was on point and the onsite dining at...\n\n\nMore', u'Absolutely gorgeous hotel with a tremendous staff. If you like staying in a pristine mansion with tons of historic character with lots of pampering this is the place for you. The architecture and the renovation is just awesome and the rooms are huge.', u"Wentworth Mansion is the Gold Standard for where to stay in Charleston. The hotel is gorgeous and the rooms are large, well-appointed, and very comfortable. The icing on this particular cake is the service. At all levels, the staff were incredible: friendly, helpful, courteous, knowledgeable and very professional.\nOn a side note: I went to the hotel's spa and was...\n\n\nMore", u"We spent 5 nights for a Charleston holiday before Christmas.\nRoom was huge. Great internet. Gourmet breakfast included - wine hors d'oeuvres every night.\nThe place to stay pet friendly ! Elevator & super valet service . We recommend to friends", u'The level of service and pampering you receive is just as good as when we last stayed here in March, 2012. Here is what we said then. http://www.tripadvisor.com/ShowUserReviews-g54171-d111475-r126062654-Wentworth_Mansion-Charleston_South_Carolina.html#REVIEWS.\nStaff is still unbelievably accommodating. Breakfast is excellent. Bathrooms are large and luxurious. Rooms have 15 foot ceilings. You are staying in a MANSION. Sitting room, porch, reading room. Have a glass...\n\n\nMore', u"the house is beautiful and grand. but the service is what makes the place so special. it's a wonderful intimate place. great location, lovely rooms, excellent food and most of all a helpful engaging staff.", u'The Wentworth Mansion is a former shipping magnates mansion beautifully converted into a luxury hotel. The rooms are huge with soaring ceilings and every possible amenity. The staff is extremely welcoming and attentive. One of the nicest aspects of this hotel is that everything is complimentary, including some features that nickel and dime charges at far better known upscale chains...\n\n\nMore', u'Wonderful and charming b&b. The afternoon happy hour was appreciated after a day of sightseeing. Rooms were large and comfortable. The location is near the "downtown" area but not too near. Walking distance to the river area.', u"The Wentworth experience starts even before you arrive as the concierge contacted me about 10 days prior to my arrival to arrange reservations at restaurants, spa services, or other events I wanted to attend. As soon as the taxi dropped us off a bellman appeared (almost out of nowhere) to take our bags. I didn't want a typical hotel room...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/02/ac/3e/7d/filename-wentworth-mansion.jpg'}
{'category': 'hotel', 'review_count': u'673', 'title': u'Ansonborough Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'21 Hasell Street, Charleston, SC 29401', 'review_list': [u'Beautiful historic inn with rooftop terrace. Great get away. There celebrating our engagement and fianc\xe9. Once we got there, we never moved our car until we checked out. Highly recommend. Charleston is a beautiful', u'Located right on the edge of downtown Charleston. Easy, safe and fascinating walks to most of the major restaurants, theaters and museums. And if you get tired of walking, the free local trolley stops every 10 or 15 minutes within a block or two of the hotel. Hotel is apparently a converted mill of some kind with exposed beams and...\n\n\nMore', u"The Ansonborough is very conveniently located just a few blocks north of Market St. The decor is warm and welcoming. My room was surprisingly large, well appointed and had a view of the harbor. It's a nice place and I'd recommend it. However, I could hear every single noise outside and in the hall and that impacted getting a good...\n\n\nMore", u'The rooms were large, well-appointed. The staff was fantastic - friendly and very efficient. Yummy breakfast included. Parking was free, right across from the Inn. I would definitely stay there again.', u'We stayed here in October and it was very nice. It is on the dark side, I prefer more light in the room, bath and interior courtyard. We had a suite on an upper floor with s short flight of stairs in a narrow hallway to the main room. There was a small kitchen area, table and a sofa bed....\n\n\nMore', u'Pros: very convenient location next to 24 hour grocery store, nice renovated rooms with large beds and friendly knowledgable staff, amazing interior and decor, checked in our luggage with front desk to explore after check out. Breakfast is standard continental.\nCons: the Inn charged the incorrect credit card after booking accommodation online, they charged the credit card given for incidentals...\n\n\nMore', u'For our honeymoon, I wanted to surprise my wife with a visit to someplace charming, cozy, friendly, and a little indulgent. After reading the reviews and seeing the photos online, I chose the Ansonborough Inn. We absolutely loved it! Our room was on the third floor, it had red brick walls, high ceilings with beautiful wood beams, ornate chandeliers, and...\n\n\nMore', u'We followed the trip advisor map and reviews to this lovely inn for a last minute stay. This inn is beautiful. It is historic and unique, comfortable and friendly. Complimentary breakfast and nightly wine and cheese only adds to the value.\nEspecially friendly service. Special thanks to Daniel and Jason who offered great insight on local info and got us...\n\n\nMore', u'Once again the staff and accommodations at this beautiful inn impressed my family and I. Great place for a quiet retreat and a convenient spot to walk around town. Hot breakfast in the morning, wine and cheese in the evening. The exposed beams in the lobby and most of the rooms adds to its charms. The fireplace in the lobby...\n\n\nMore', u'Stayed here over New Years holiday. Think we over paid. Rooms are small and we were at street level. We had to keep blinds closed most of the time so not much of a view. There was a white noise machine in the room so that should tell you something. Location is ok (4 blocks from King St and next...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/07/7b/a9/e4/exterior.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'542', 'title': u'Holiday Inn Express Charleston Downtown - Ashley River Hotel', 'rating_string': u'4.0', 'address': u'250 Spring Street, Lockwood Drive, Charleston, SC 29403-5123', 'review_list': [u'We booked this place because they take dogs....which they do! But, apparently rooms which allow pets have terrible views.\nTo start, getting here via gps was terrible....in the future I would call for directions.\nThe main area and parking areas are quite nice....our reservation was confirmed we had no problem getting to the room.\nThe room was clean and well...\n\n\nMore', u"I can not say enough about the front desk staff . So nice and acomadating. She went over and beyond her job . That's what I call customer service. Company's need more people working for them like her. A Big raise is in order for the whole team . The Bed .. OMG !! I want one . The house...\n\n\nMore", u'Hotel is a little dated, but is in decent repair. Not enough lighting in guest room & no "easy" chair. Not much vanity space in bathroom. The hotel is in the landing flight path of the airport, but was not too disruptive. Room price was reasonable.\nOur first visit to Charleston & only overnight. We arrived during the 5 pm...\n\n\nMore', u'We stayed 2 nights here with our dog. We stayed on the first floor by the outdoor pool- which was closed for the season, bummer. Our room was a little stuffy and humid ( it was 78 degrees that day) when we walked in and had a funny smell- d/t the humidity- but we turned the A/C down and that...\n\n\nMore', u'While the location of this hotel is not what we thought it would be, it is an easy and free bus ride to the visitor center and beyond. The rooms at this Holiday Inn were spacious, the beds very comfortable, and staff were extremely friendly and helpful. They do know and practice good customer relations! The complimentary breakfast was one...\n\n\nMore', u'We were disappointed in this hotel.\nCons: It is not downtown...you have to drive there. Rooms are tiny & very basic. If you have a dog, you have to stay on the second floor. Rooms need updating. Neighborhood mediocre at best.\nPros:\nRoom & bathroom very clean. No dog smell even tho we were on the dog-friendly floor.\nStaff very...\n\n\nMore', u'The address of this establishment says, "Downtown." It is not downtown. While the room was very nice, beds comfortable; overall I was disappointed in this establishment. I had to go down to the front desk on my first morning and get coffee because the coffee maker in the room DID NOT have a basket for placing the coffee pod. The...\n\n\nMore', u"Went with my sister, we're late 20's early 30's. Needed some sunshine after a rather brutal winter and the Ashley Holiday Inn proved to be comfortable and within our budget. The room and staff met all of our needs. We could walk to all of the attractions downtown.", u'Brian the night clerk was amazing in helping us chose the best accommodotion for our needs. Most of my conversations took place with him at 4:00 am! from home in NY. Just lovely to talk to. His warmth and friendliness made up for any shortcomings of the facility. The good. Location very convenient to downtown. We used Uber at a...\n\n\nMore', u"Stayed for a night. Bed was comfy, room was quiet. 8-9 min drive to historic district (parking in that area is free after 6pm). The breakfast was actually quite substantial and gets you on your way well fed. The environs around the hotel are nothing to look at, but it's right off the interstate so also convenient. All in all,...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/03/bc/42/39/holiday-inn-express-charleston.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'1284', 'title': u'Courtyard by Marriott Charleston Historic District Motel', 'rating_string': u'4.5', 'address': u'125 Calhoun St, Charleston, SC 29401', 'review_list': [u'Hotel room was an average courtyard room, but what gives this hotel a 5 is Kevin, the concierge! We booked this room because of his reviews and it was SO worth it. He spent time with us on the phone prior to coming as well as when we got there. He truly is passionate about what he does and it...\n\n\nMore', u"We thought it was great that we were able to stay in the historic district but we didn't get too much sleep. We were at the front of the motel and was kept awake from people walking around outside at all hours of the night talking loudly and yelling. There was a garbage container to the side of our room...\n\n\nMore", u'This hotel does not have all of the character of the historic district, but I can argue that it is a great choice. I have stayed here twice.\nThe location is very good. You can easily walk the historic district from here. The parking is good (for Charleston ). I was charged $18 per night. I felt safe here and...\n\n\nMore', u'The hotel was nice and very centrally located - perfect for walking to all the historic areas -- but the real gem here was the free concierge services. Their concierge, Kevin, was awesome - in addition to lots of great sightseeing/activity tips, he gave us a walking map of Charleston with all the best hidden spots in the city and...\n\n\nMore', u"We were leaving on a New Year's cruise from Charleston and I chose this hotel because it was close to the port. It wound up being closer than I expected! When we checked out, there was a taxi waiting outside and we were at the port in less than 5 minutes. Staff was very friendly and helpful and they were...\n\n\nMore", u"We went to Charleston on a last minute decision for my husband's 50th birthday. The staff from check in to the cafe were always looking for ways to make our stay exceptionsal. The location of the hotel was perfect. Not too far from great restaurants and great shopping. Would definitely stay here again.", u'Stayed here a couple of nights while on an escorted Tour. Room was clean but had some strange markings on the wall beneath the air conditioner ( like a lot of fluit had run out of it). Bathroom had a great shower, witch gave lesser place for the toilet.\nPeople at the check in where friendly. I made my arrangements...\n\n\nMore', u'The concierges, Kevin and Andrea, turned this hotel from good to excellent. Whether it was recommendations about restaurants, walking tours, hidden treasures, etc., every suggestion was spot on. Thanks, you two made our stay in Charleston memorable.\nSteve and Anita', u'The hotel itself was clean and we liked its proximity to many great restaurants on King St. It was very noisy however on our stay, although not the fault of the hotel. Easy access through town to get on the freeway. Overall, a good hotel.', u'Kevin was great, but there is an amazing staff at this place. From the front door man through check-in it was a great experience. The next day we saw house keeping doing their rounds and maintenance knocking on doors to make repairs.\nGreat location and nice views from our corner suite!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/0a/2b/9b/bc/exterior.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'1231', 'title': u'Andrew Pinckney Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'40 Pinckney St, Charleston, SC 29401', 'review_list': [u'My experience with Andrew Pinckney Inn from booking to check out was wonderful! I only stayed for one night, but I absolutely will go back and hopefully for a longer stay!! I loved that I could use the Valet Service even after I checked out...basically you can leave your car with them until you are done exploring downtown Charleston. They...\n\n\nMore', u'We always love staying at the Pinckney Inn, love the rooftop breakfast and afternoon drinks. The valet staff is awesome. We had a street side room that was loud, and they moved us to a much more quiet space...excellent service.', u'A small hotel centrally located, most attractions within easy walking distance. Our room was on the corner and there was some early morning noise from a nearby restaurant but nothing to cause a problem. The room was well furnished, the bed was comfortable and the bathroom had everything we needed. Breakfast was served each morning on the balcony area, biscuits...\n\n\nMore', u'We stayed at the API for two nights, and it was quite cozy and pleasant inside. The people in the office greeted us and welcomed us back (we have stayed here several times), and they took care of our car and luggage while we went to lunch. When we returned, everything we needed was in our room and neatly stowed...\n\n\nMore', u"Overall we enjoyed the character of the hotel and the staff was very friendly. However, we stayed in the St. Phillip Suite, directly above the lobby and right on the street, It was extremely loud and so we didn't get much sleep during our stay. We also had to check out very early in the morning and asked twice that...\n\n\nMore", u'Our stay was wonderful. We especially enjoyed the 4th floor outdoor patio! The service was excellent. It is located within walking distance of almost everything. I will be back and I highly recommend it to all!', u'We chose this hotel based on TripAdvisor reviews. We loved the location - a block from the City Market and Meeting Street, on a quiet street but with lively commercial areas so close. The room was clean and comfortable, if not huge. (And a common space just outside the room provided needed space for mom and teenage daughter when necessary.)...\n\n\nMore', u'This Inn is beautiful, clean, and hidden away in Charleston. All of the staff were very professional and pleasant. The breakfast was delicious and I enjoyed it while sitting on the 4th floor terrace. A perfect stay.', u"Enjoyed a great 4 night stay here, right in the middle of Charleston's historic district. - made our stay easy & enjoyable. The staff was very helpful & directed us to places/activities we would not have found on our own. We will ill be back here again.", u'The accomodations were wonderful and the consierge services assisted with our dinner reservations which made planning a breeze. The rooms were nice and the location is super convenient. The room was well appointed and comfortable.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/05/ad/80/29/andrew-pinckney-inn.jpg'}
{'category': 'hotel', 'review_count': u'1114', 'title': u'Planters Inn Hotel, Charleston', 'rating_string': u'4.5', 'address': u'112 North Market Street, Charleston, SC 29401', 'review_list': [u"I've stayed at very nice hotels around the world from The Ritz to The Grand Hyatt...I prefer the smaller venue and attention to detail that Planters Inn offers! I've found the bigger chains claim to be first class but are too big to really show it...From knowing and calling you by your last name the entire time you are there...\n\n\nMore", u'The staff in all areas were excellent. Breakfast a bit expensive but service was excellent. We were on front and a good bit of late traffic noise but that is not the hotels fault. Valet and front desk went out of their way to help us.', u'Bellman unavailable - be prepared to handle your bags upon arrival.\nIf your towels are soiled when you depart for dinner, they will be there when you return.\nIf you leave the TP canister open showing no TP expect to remind staff they should leave a roll.\nIf you have a car and the keys cannot be found for 3...\n\n\nMore', u'Ideal for location and food. Quiet rooms and lovely comfortable appointments. Valet parking is easy. Short walk to all the best sights and shopping. Central to the historic sights in Charleston and tour facilities like the carriage rides. They are a great way to learn the history of the area. Enjoy!', u'Charming hotel part of the Relais & Chateau chain. Located right at the Market, with one of the best restaurants in town next to it. Large rooms, comfortable beds, Victorian style, attentive service. Free wifi (a must), but unfortunately no gym', u'Wonderful hotel with exceptional service\nfantastic staff\nBeautiful rooms\nreally comfortable beds\nand great location\nThe restaurant is wonderful and has a great champagne bar\nwe will definitely be back', u'Location is great and such a walkable city. Beds were cozy and comfy. Wonderful to wake up to coffee in the sitting room, watching Charleston wake up. The inn was lovely and the epitome of Charleston. Would stay here again.', u'Everything about the Planters Inn is wonderful. The accommodations and staff were excellent. We could not have stayed in a better hotel for our honeymoon. Would recommend this hotel to all family and friends.', u'What a wonderful experience we had staying at this hotel! The rooms were beautiful and the hotel was so charming! Everything was within walking distance. The staff was so helpful and the restaurant was amazing!', u"Excellent place to say. Best in town. That simple! Amazing continental breakfast w best pastries and house made granola.\nBest martini and service/bartender I've seen in awhile. Just so professional is the entire property!!! They go out of their way!"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/06/9d/c0/1a/planters-inn.jpg'}
{'category': 'hotel', 'review_count': u'626', 'title': u'Courtyard by Marriott Charleston Waterfront Hotel', 'rating_string': u'4.0', 'address': u'35 Lockwood Dr, Charleston, SC 29401', 'review_list': [u'My wife and I stayed here for 1 night on the way back from Miami to New York.\nWe got a room with a "city view" and when a got to the room it was overlooking the highway and a few buildings, no view in sight. For the money it was a rip, not in the historic Charleston as stated...\n\n\nMore', u'This hotel is in good shape, in spite of what some reviewers have said. The staff at the front desk were very helpful.\nThe parking lot is a covered area under the hotel, with easy access to central Charleston, and to I-26 and Rte 17.\nA room with a view of the Ashley River and the marina is nice if...\n\n\nMore', u'Checked in, saw room, checked out. Did not stay the night. There are terrible reading lights in the bedroom, and there were NO lamps in the living room (we had a suite). Also, the hotel is an unpleasant mile walk from downtown Charleston, where everything is. The staff was wonderfully helpful and booked us in another Courtyard in downtown Charleston.', u'Stayed in 426. At 8 AM was ruddley awakened both mornings by what I learned was a ventilator fan issue, a rumble that even burying my head in pillows could not diminish. Otherwise our stay in this aging beauty was unremarkable except for the first rate kindness of our standin shuttle drivers Mark and Eddy.\nRecommend caution when looking for...\n\n\nMore', u"I couldn't have asked for a better sleeping experience than this one! The beds were very comfortable, plenty of pillows provided prior to our arrival and the room's amenities met our needs during our entire stay...right down to bottles of water delivered daily. We always had fresh linens and towels when we returned to our room.\nThe bartenders were wonderful...\n\n\nMore", u"Don't be fooled by the other reviews. The staff was friendly...but this hotel is old, damp, dated and smelly. We upgraded to a corner room with a balcony which came with a big price tag. Feeling ripped off. The room layout is strange with doors opening into each other and a tiny little bathroom with the vanity in a separate...\n\n\nMore", u"Enjoyed our evening. Great bed and pillows, slept like a baby. High ceilings in the rooms. Everyone on the staff, greeted us with a smile, and a pleasant greeting. How refreshing. One of the best omlettes for breakfast I have had in a long time. When our car wouldn't start, the GM brought their van around to boost our car....\n\n\nMore", u'This entire hotel is old, it smells damp and musty. See photos below. The cornice boards were falling off the wall in room 346. When we first arrived our view was the air conditioning system. They switched us to another room (the one with the mold). The sink area is very narrow and barely room enough for one person to...\n\n\nMore', u'If you are in Charleston, and plan to spend most of the time in the historic district, you may want to choose another spot. It is a short drive, but parking is not ideal once you get there. There is a shuttle, but it is limited and is not free. That being said, if your plan is to take in...\n\n\nMore', u'The Courtyard Waterfront is situated on the Ashley River. The rooms that have a water view command a higher rate. This hotel has a lot going for it - free parking, shuttle to downtown, walking distance downtown is you are so inclined. The hotel is quiet, beds are comfortable. With about a quarter mile is the Marina Variety Store Restaurant...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/0a/2a/0c/ae/exterior.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'326', 'title': u'Zero George Street Hotel, Charleston', 'rating_string': u'5.0', 'address': u'0 George Street, Charleston, SC 29401', 'review_list': [u'Beautifully newly refurbished historical buildings around a central courtyard; feels small, cozy, boutiquey. Unusual in that there is an open kitchen is on your left when walk in to the front desk, which offers excellent gourmet dinners as well as cooking lessons. Free bike rentals. European style breakfast included (homemade granola, quiche, muffins, etc), free wine and cheese 5-7pm that...\n\n\nMore', u"I have never before stayed at a hotel that so seamlessly integrates with the city around it, and I say that with a very high opinion of Charleston. Charleston is the greatest example I have seen in the US of the cohesion you see in many great European cities. Nothing seems out of place, and Charleston is anchored by it's...\n\n\nMore", u"An excellent experience at every turn. Although a small property they were well staffed at all times. Valet parking worked well. The complimentary breakfast provided many delicious choices and the afternoon wine and cheese a pleasant interlude before dinner. Our room didn't miss a detail. The bed was wonderful and amenities included everything from robes and slippers to nightly bedside...\n\n\nMore", u'This property is the ideal place to stay in Charleston. Not on the "main drag" but close enough. The buildings are authentic, beautifully restored and maintained, and the amenities are first class as well. The staff is charming, knowledgeable and well trained. The bar is quaint and intimate. Now for the important part--the restaurant. OUTSTANDING. Not easy to seem fabulous...\n\n\nMore', u'We were upgraded to a lovely garden level room that exceeded our expectations. From the moment we arrived we were treated with great consideration and care. The room was spacious and beautifully furnished. We loved the daily wine and cheese from 5-6 as well as the breakfast. All the historic sites of Charleston are within easy walking distance of this...\n\n\nMore', u'I joined my parents at this hotel for a 3-day family trip to Charleston. We had read great things about this hotel and it exceeded the hype. The staff oozed southern charm and the accommodations were luxurious with classic southern style. Our rooms included sumptuous Frette sheets, complimentary minibar, and a steaming hot shower with wonderful bath products. We enjoyed...\n\n\nMore', u"I don't think I could imagine a better place to stay in Charleston. The historic building maintain the sense of the city's history, but are updated to 21st century luxury. Marvelous beds and bathrooms. The rooms have spacious layout that never feels cramped. The public areas--garden, piazzas and verandas are perfectly suited to quiet relaxation. The front-desk staff was always...\n\n\nMore", u'We stayed at Zero George during our first trip to Charleston, SC for three nights. It is a very beautiful, charming small hotel with nods to the historic feel of Charleston. The location is excellent as it is just a short stroll along past gorgeous homes and mansions into the main town centre. The breakfasts each morning were lovely with...\n\n\nMore', u'Tradition and exquisite style - and a glass of champagne on arrival - meet the guests at Zero George. A truly unique place, where Southern Comfort is guaranteed in very cool and inviting atmosphere. The superbly well presented rooms have private porches, and are designed with the utmost care to preserve the feeling of old Charleston, while giving the guests...\n\n\nMore', u'We came to Charleston on a whim and stayed here for four nights. It is a wonderful boutique hotel. The breakfast is nice and happy hour cheese plate is not to be missed! Also make dinner reservations...the food is wonderful. The service at the hotel is wonderful, everyone is very helpful and sincerely want you to have a good time...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/af/75/c9/zero-george.jpg'}
{'category': 'hotel', 'review_count': u'380', 'title': u'Hilton Garden Inn Charleston Waterfront/Downtown Hotel', 'rating_string': u'4.0', 'address': u'45 Lockwood Drive, Charleston, SC 29401', 'review_list': [u"We've visited Charleston many times in the past. This is the first time we chose this particular hotel. Really great place to stay. The location, the staff, clean rooms, everything is great. We plan to stay at this hotel on our next trip to Charleston.", u'I checked in on 1/29/16 for a one night stay and ate at their restaurant. I ordered the salmon and it was outstanding! What was more outstanding was my server Kady W (109). She provided excellent service and professionally dealt with a situation of partying, annoying guests that tried to bring in their own alcohol by dragging a cooler into...\n\n\nMore', u'We stayed on our first visit to Charleston for a birthday getaway.\nWe arrived late in the evening and the layout of the hotel was awkward, ended up getting lost because though I had a keycard and got our room number, when I got to the 4th floor our room could only be accessed from a different location.\nThe rooms...\n\n\nMore', u"This is a nice property with modern finishes. It has a weird layout, but there are multiple entry points for guests from the parking area. The rooms are well appointed. I had a room with a partial view of the marina and the highway, but it made for some nice sunrises. It's very close to the Citadel and a few...\n\n\nMore", u'Used Hilton points for this. Not disappointed despite it being a little out of the way from the center of town. Lovely waterfront setting. Trendy interior which was kept clean and tidy. Staff very friendly and helpful. Food and bar good. They provide an hourly free shuttle to DT. We Ubered often as we missed the shuttle times.', u'Unfortunately, the purpose of my stay was for a funeral. So I was not that picky about the hotel. My main criteria was that it was close to Hampton Park. But when my father and I arrived, I was surprised by how clean and nice the hotel was. The hotel was designed on an upscale level. But the price was...\n\n\nMore', u'Upon requesting a reservation for a stay in April, 2016 with my two friends, I was greeted on the phone by Katrina Watson. What a gem. She was quick to find rooms for us with the best accommodations possible and for the best price. I was so impressed, I decided then and there to book our rooms. If all Hilton...\n\n\nMore', u"This hotel is about what you'd expect to get when you book an HGI. The rooms are clean and comfortable. The price is fair. This particular location has free parking. The location is OK. And by that I mean that it isn't downtown and it isn't on the beach, but it is along the river (so you have a nice...\n\n\nMore", u'This was a great hotel at which to stay; we were there for the weekend. Initially, I thought it might be too far from the city highlights, but I was wrong! It sits on the waterfront; we had a beautiful view of the marina! By car, we were able to get to the Historic City Market in just minutes. I...\n\n\nMore', u'If you stay, make sure to get a waterfront view. The view of the river and marina is pretty nice. I watched a spectacular sunset from our room. The hotel has nice amenities including a shuttle service to downtown. Their bar has a decent selection of craft beers. The property is clean too. It is a little pricy.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/3e/68/49/downtown.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'462', 'title': u'SpringHill Suites Charleston Downtown/Riverview Hotel', 'rating_string': u'4.0', 'address': u'98 Ripley Point Drive, Charleston, SC 29407', 'review_list': [u'Pulled into Charleston about half past 6. Easy to find, nice check in, wow, great room. Very clean and spacious. The TVs were high def, something that you do not get every where. Nice marina, though I should have taken the shuttle to down town, instead of the rest/bar at the end of the marina.', u"The rooms were very clean and spacious. I was here with my friends for a girls getaway. Having a small kitchen area was nice. The staff was very supportive and knowledgeable. Breakfast was good but the person restocking could use more help. They had a little trouble keeping coffee and food filled. I'll definitely return.", u'I have been to several Marriott hotels but the staff here, specifically Jacquelin and Joe at the front desk was superior to any other stay. They are the best! Our flight arrived early and they were able to accommodate us. They even had a welcome gift ready for us. No complaints at all about the staff, room, location, or shuttle....\n\n\nMore', u'This was a great hotel just a mile or two outside of downtown Charleston. Hotel had ample parking and some limited covered parking. Registration is one the 2nd floor, you can either take the stairs or take the elevator. First floor is well decorated and they have a business center on the first floor.\nWe were greeted at the registration...\n\n\nMore', u'We were glad we picked this hotel for Charleston. It was not located in historic downtown but provided a free shuttle service to historic downtown from about 5 in the evening until around 11 at night. This was one of the main reasons we stayed here. Fantastic hot breakfast!', u'Jacqueline & Brian at the front desk could not be more helpful. They have printed up directions to the various islands (to and from the hotel). The hotel has a free shuttle to the historic district of Charleston. The hotel has different activities such as wine tasting, beer tasting, etc. Our room was large and the bed was very comfortable.', u"Stayed here for several days during Christmas week. Room was nice, breakfast adequate and front desk staff was helpful and professional. I left a couple of items in the room (left very early in the morning), called the hotel, and rec'd the items in the mail less than a week later. Kudos to Jacqueline and her staff!", u"We stayed here the night before leaving on a cruise from the Charleston port which was less than 10 minutes away. There are 5 of us including 3 children 18 and older. We're used to being cramped, particularly in $300+ big city hotels. Our suite appeared much bigger than the picture indicated, with two double beds in one room and...\n\n\nMore", u'This hotel is not in the heart of the historic district, but close enough just right over the bridge. Our hotel was nice, clean and perfect for families. The front office staff gave suggestions on things to do and places to eat. This was very helpful and the restaurants suggested were all awesome. We even bought discounted tickets for one...\n\n\nMore', u'Great staff, very helpful. they even provided me with a roll of tape to get the lint off my shirt! The shuttle service to town is wonderful. We had a car but it was much easier to take the shuttle for dinner and drinks.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/46/8f/e5/riverview.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'828', 'title': u'Renaissance Charleston Historic District Hotel', 'rating_string': u'4.0', 'address': u'68 Wentworth St, Charleston, SC 29401', 'review_list': [u'The hotel common areas are very nice as are the rooms. Well appointed, very comfortable bedding. Large lobby area. Plenty of staff around to assist if you need it. You can valet park or self park across the street. My only real dislike was the horrible carpeting in the hallways - the color was hideous.', u'Business trip. Service was excellent. Seamless check in and check out. Beautiful lobby. Great Valet Parking. Provided bicycles, umbrellas, etc. Beautiful lobby, nice bar. Room was clean, updated, climate controls excellent. Bathroom, excellent.', u"I have never said this before about the brands but the Courtyard in Charleston looks like it's better than this Renaissance. That's where I'll book the next time I'm in town. This is an old hotel and it shows. I found the staff to be underwhelming as well and for someone who spends about 100 nights per year in just...\n\n\nMore", u'We stayed at the Renaissance Charleston Historic District Hotel and thoroughly enjoyed it. Our room was well appointed with a comfortable king bed, sitting area, beautiful bathroom, and a balcony. This is an older hotel, but verynicely maintained. The location was fabulous and the lobby was gorgeous!\nThe staff was professional, friendly, courteous and gave great advice for touring the...\n\n\nMore', u"I stayed at this Marriott property for three nights over New Year's Eve using my points. If you are looking for a Renaissance Hotel experience like the Renaissance 57 in New York, this is not it. As a Marriott Platinum member, I expected far better service. At most Marriotts, I am fortunate to be acknowledged at check-in and receive a...\n\n\nMore", u"We stayed at the Renaissance on New Year's Eve. It is a nice hotel; clean, comfortable and with nice staff. However, for the price you pay, a toast or a croissant with coffee in the morning would not hurt their bottom line. Same as Wi-Fi.\nAgain, it is a nice hotel with a good location. However, for the price and...\n\n\nMore", u'I visited Charleston for the first time and stayed at The Renaissance Hotel. Very nice lobby and clean rooms. I would have to say Cameron the bellman was our spotlight of service and there was another bellman who took our bags up I think his name was Jason African American Male. Thank you all for a great stay. Thanks Gloria...\n\n\nMore', u"Still had all the Christmas decorations up and they looked lovely. The staff couldn't be more helpful. Great beds, but the room could use a little update. We had the continental breakfast, fresh eggs, bacon, fresh squeezed orange juice, etc.", u'This hotel is right in the center of all the Charleston action! It is between King Street (all the modern shopping) and the Charleston Market. It is in the historic district and most destination are no more than a 5 minute walk. We even walked to Fort Sumter/Aquarium one day and it only took us about 20 minutes-- about a...\n\n\nMore', u"This is a great location for walking around Charleston. It is close to the market and shopping and lots of good restaurants. Although the lobby isn't large, it is inviting and elegant. There is a concierge to help make dining reservations and provide information. Plus, they have free snacks! Our room was decorated in an old Southern style. I'm not...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-p/09/30/ea/3a/renaissance-charleston.jpg'}
{'category': 'hotel', 'review_count': u'900', 'title': u'Inn at Middleton Place Hotel, Charleston', 'rating_string': u'4.5', 'address': u'4290 Ashley River Road, Charleston, SC 29414', 'review_list': [u'The Inn is reminiscent of a Dutch style modern building. Many floor to ceiling windows that are shuttered. The outside of the windows could have used some cleaning as could the floor inside immediately around the windows. The room shows a bit of age, but is still very nice. We had a king riverside room with a fireplace (wood provided)....\n\n\nMore', u'When you pull into the property you begin to enter another world. The Inn itself is modern yet inviting. Our room was very comfortable and spacious and the grounds are landscaped very elegantly. We had a free pass to go tour the plantation and took advantage early in the morning before it got too hot. The plantation is utter opulence....\n\n\nMore', u'We really enjoyed our night here. The room was comfortable and the staff was friendly. Also, getting access to the grounds included in your room rate is a huge plus. We toured the house, walked the gardens, and visited the farm/handicraft workers. The complementary management reception from 5pm-7pm is very nice (some appetizers--basically cheese and crackers and fruit and a...\n\n\nMore', u'This is the place a parent needs when they need the quiet to be real. As a parent of three children, ranging from 6 months old to six years old, I cannot begin to explain how beautiful it was. To run in that garden at 7 am; to go to bed and have the room completely silent the whole night...\n\n\nMore', u'This contemporary styled inn on the banks of the Ashley River is a fun destination. Our grand river view room was very large and the natural wood shutters are beautiful. The inn is located next to Middleton Place Plantation and you get tickets for the house tour and gardens which is a nice touch. We really enjoyed the wine and...\n\n\nMore', u"Beautiful, rustic inn completely focused on nature. Fireplace in room with view of the Ashley river was just gorgeous. Employees were welcoming and couldn't do enough for you to make you comfortable and relaxed. Room charge included evening reception, continental breakfast and access to the middleton plantation which was excellent as well.", u'I would not hesitate to recommend Middleton to anyone looking to have a quiet, quality break from the hectic, demanding world we live in. Maybe not so good for children or when the weather is not cooperating.', u"It's the perfect ideal of a romantic getaway with long strolls through lush gardens, the wonders of history brought to life, and the ability to have much needed privacy. You won't leave Middleton without having something to talk about at your next dinner party. The rooms were cozy with beautiful, yet minimalist, architecture and the staff was magnificently accommodating. This...\n\n\nMore", u"My husband and I were so excited to visit the inn. It looked exactly our style on the website - modern with a twist of nature. We enjoyed the lodge, the manager's reception, the game area, and the walking trails. But we stayed in room 111. This room is down a flight of steep stairs and dumped off the corner...\n\n\nMore", u'Although 14 miles outside downtown Charleston The Inn offers a respite from the journey I took driving from NYC to Ft Lauderdale Florida. I planned to use the morning to see the nearby Middleton Plantation and was glad I choose The Inn\nAccommodations were clean and comfortable and the staff was very helpful\nHint...be sure to make a dinner reservation...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/02/4e/0f/e6/inn-at-middleton-place.jpg', 'class': u'3.0'}
{'category': 'hotel', 'review_count': u'492', 'title': u'Holiday Inn Charleston Historic Downtown Hotel', 'rating_string': u'4.5', 'address': u'425 Meeting Street, Charleston, SC 29403', 'review_list': [u'Very friendly staff! Valet John was especially helpful! The hotel is new and very clean. Rooms are nice and spacious. We traveled with an infant and there was plenty of room to set up his pack and play to sleep in!', u"Upon the recommendation of colleagues we decided to stay here for the Charleston marathon weekend. The hotel is in midtown so it's just outside the really fancy part of downtown Charleston. Everything you could want to do is within easy reach without a high price tag. The hotel itself is clean and modern. Nothing fancy but a great way to...\n\n\nMore", u'This hotel is on the corner of Meeting Street and Wolfe Street at one end of the FREE tourist trolley line. This location is extremely convenient whether you want to walk or catch a ride to all of the tourist locations in Historic Charleston.\nWe typically walked to our destination (including the Fort Sumter boat dock) in a leisurely 15...\n\n\nMore', u'Hotel is very upscale and nice. Room was clean and comfortable however no microwave. All staff were very friendly and helpful with visitor information. Dining area was also very nice. Parking is by valet only and a little expensive. Hotel is located within an easy walking distance from King street were all of the shopping is. Only con is no...\n\n\nMore', u'The modern 5-story Holiday Inn Charleston Historic Downtown on Meeting St/corner Wolfe St is conveniently located on the northern end of the Museums Mile, near the Visitor Center complex, Marion Square Park and the Charleston Museum. The location is still in walking distance of the historic district and many other cultural and sightseeing venues. King St with its variety of...\n\n\nMore', u"Nice, newer hotel just a few blocks from the historic section of Charleston, and one block over from King St, where all the retaurants, pubs, and trendy shops are.\nIt was the place I wanted to spend 2 relaxing days with my wife in/near historic Charleston.\nSomewhat difficult to find until you're on top of it due to the signage...\n\n\nMore", u'I wanted to stay somewhere close to downtown so we could walk and enjoy our stay. Although that proved to be good, the very first morning we awoke to a loud pounding...literally a pile driver...next door at the construction site. The construction was just at the foundation stage, so my assumption is that the construction sounds will continue for sometime....\n\n\nMore', u'We had the Corner Suite on the 5th floor and the room was awesome. Lots of space and well appointed. Had a great view of the sunrise out over the harbor. The location is exactly perfect but not far from attractions. As with just about any place in Charleston, parking is an issue but the valet service was great.', u"I have stayed at this hotel twice in 2015 (both for business). I really like the modern styling both in the rooms and common areas. The hotel is relatively new and clean. The staff both times were very friendly and helpful, including the guys doing the valet parking. They have a nice bar. Even though it's on a busy street...\n\n\nMore", u'... a failure to communicate. That iconic line from the 1967 film Cool Hand Luke was omnipresent at check-in desk.\nI asked for a room with 2 beds, I got one with a Queen bed. Not normally a problem except my guest was another male, and we both are quite hetero.\nWhen that oversight was remedied an hour later, we...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/e9/31/13/hotel-exterior.jpg'}
