[{"category": "hotel", "review_count": "671", "title": "Hampton Inn Pittsburgh/Greentree Hotel", "rating_string": "4.5", "address": "555 Trumbull Dr., Pittsburgh, PA 15205", "review_list": ["\nSee title. Chose this location based on recommendation and proximity to events we were going to. All was fine except for the paper-thin walls; we could hear the cackling hens next to us the entire evening and morning.\n", "\nRoom was very clean and comfortable, breakfast was fantastic, staff very helpful, and the location perfect for our needs. We wanted to be close to Pittsburgh to enjoy the city, but still have comfortable parking. This spot gave us both.\n", "\nExceptional stay. Friendly and helpful staff. Room well appointed. Very clean everywhere. Good breakfast. Comfy bed. Stayed with my dog. Lots of room to walk him outside. Wish more HH accepted larger dogs.\n", "\nFantastic place to stay. Very clean and the housekeeping staff goes out of their way to ensure everything is spotless and appealing. The director of housekeeping was by far the most accommodating and courteous I have ever encounter at any hotel I have visited and I have stayed at many of the top 50 hotels in the world. She is...\n\n\nMore  \n\n\n", "\nI stay here a lot for business. The hotel is always clean and neat. The staff is pleasant and easy to deal with. The rooms are a bit on the small side but they work for me. The breakfast is like all other Hamptons. The price is usually always good. I recommend staying here. This hotle is pet friendly and...\n\n\nMore  \n\n\n", "\nWe booked this hotel because of its location. Easy to get into the city and onto the parkway west. When the major storm hit the staff made the necessary moves for us to spend another night. They do have a shuttle service to major sites in the city\n.\n", "\nWe thoroughly enjoyed our stay. The staff made the dogs feel welcome and the room was very clean. The complimentary breakfast was better than most other hotels. The only problem we had was that the king bed with sofa bed room was tight for a family of four traveling with two dogs. Other than that, everything was great!\n", "\nI had a great experience at this Hampton Inn. The front staff was very friendly and accommodating. The room I stayed in was very nice and clean. The fitness center was very nice and clean as well. I could not have been happier with the service I was provided during my stay. I will definitely stay there again if I...\n\n\nMore  \n\n\n", "\nWe arrived at the Hampton inn at green tree on Saturday 1/16 because we came to Pittsburgh for a penguins game all the way from New York. As we arrived in the corridor there was a strange odor walking in but that was the least of our problems. Checking in the guy behind the counter was bland and looked as...\n\n\nMore  \n\n\n", "\nWe picked this hotel because of location close to downtown Pittsburgh but not in busy City. It is close to shopping and Robinson Township shopping and restaurants. The hotel is clean, the staff was good - we enjoyed our stay. Food rate a 7 on a 10 scale. Good staff.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/08/32/4d/5b/hotel-exterior.jpg"}]
[{"category": "hotel", "review_count": "2879", "title": "Omni William Penn Hotel, Pittsburgh", "rating_string": "4.5", "address": "530 William Penn Place, Pittsburgh, PA 15219", "review_list": ["\nMy wife and I stayed here for a weekend get-a--way. The service was outstanding. The room was ready when we arrived and was clean and inviting.. The bed was very comfortable. The food and service at the restaurant wass top shelf. We will definitely stay here again.\n", "\nThe hotel staff goes out of its way to make you welcome. Room requests are taken seriously and everyone seems to want to make your stay as enjoyable as possible. We had a two day business meeting with hotel catered meals. Every one of them was greatly improved in quality from previous years. Rooms were clean, comfortable and quiet.\n", "\nThe hotel food is very good in all resturants; the rooms I would rate as good and clean, but there needs to be updating. I have stayed there many times and I prefer soft beds, their beds are too hard.\n", "\nThe hotel is absolutely beautiful and charming in every way. Everyone in the hotel was friendly and helpful. Room service was quick and delicious. You could tell it came right up to our room when it was ready.\nDefinitely one of the nicer hotels in town.\n", "\nI have been going to this hotel for so many years. It is so beautiful and grand. You will not be disappointed. The beds are comfy, The food is excellent and the staff is so friendly. You are a short walk to the a lot of restaurants and events in the city.\n", "\nAll the staff at this hotel need some training on how to treat guests at the hotel. The service in all areas from the doormen, to waiters in the restaurant was poor to terrible. I was left with the feeling that the staff did not care about me or their job. I can not recommend this hotel based on the...\n\n\nMore  \n\n\n", "\nSimply beautiful! Our upper level suite had a separate sitting area, entire suite had several very convenient outlets for charging devices. Built in automatic lighting in the nightstands (at floor level) so no need to turn on the lights in the middle of the night. Lamps are on dimmers which we find very useful. Omni Rewards offers coffee delivery in...\n\n\nMore  \n\n\n", "\nI stayed here for a night on a little girls trip out of town. This hotel is absolutely stunning, and the staff is friendly as well. What really impressed me was the attention to detail. From the cotton swabs and q-tips in the bathroom, to the motion sensor foot lights in between the beds. I will definitely be back!\n", "\nEach Christmas, I take my daughter and three of her friends to high tea at the William Penn and it is fabulous. I have stayed at the hotel and it is a treat. Great location downtown Pittsburgh - close to the hockey arena.\n", "\nWe came into downtown Pittsburgh for a United Way event and decided to take the opportunity to stay at the William Penn. We have spent many nights there since living abroad and visiting our family in Pittsburgh on holiday. Now living outside of Pittsburgh, staying at the William Penn seems like we're at a second home.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/03/c0/76/a5/omni-william-penn-hotel.jpg"}]
[{"category": "hotel", "review_count": "311", "title": "Hotel Monaco Pittsburgh", "rating_string": "4.5", "address": "620 William Penn Place, Pittsburgh, PA 15219", "review_list": ["\nAs a business travelers to Pittsburgh, I have been pleasantly surprised with the city of Pittsburgh from a cultural and culinary perspective. However, the hotels were a notable exception so I resorted to Airbnb for a while until I discovered the Hotel Monaco. It's tucked away on a side street in downtown presets a very charming lobby and lounge area...\n\n\nMore  \n\n\n", "\nWe live in Pittsburgh. It was our anniversary, so we planned a nice evening in the city. The hotel staff is absolutely the best, specifically the front desk. The hotel has a modern eclectic feel. It has a different, but fun look. We had a one bedroom suite which was very spacious. My only complaint about the room was that...\n\n\nMore  \n\n\n", "\nFabulous refurbishment. Stunning interior design that is up to date without being tacky and kitch. Rooms well appointed and very clean. Hotel is bright and appealing. There are spaces to relax in. The staff are so friendly and helpful. Nothing was too much trouble. Located within walking distance from any thing you need. I would come stay again.\n", "\nAs a DLCo employee back in the late 70's, early 80's, this building was my \"home away from home\". It was surreal to see how they transformed a rickety old historic building into something breathtakingly beautiful. Best of all, though, was the staff. They thought of everything imaginable to make our stay special and truly treated us like VIPs! I...\n\n\nMore  \n\n\n", "\nThe hotel had a great atmosphere, really funky décor but it works. Great location in downtown Pittsburgh. The restaurant in the hotel, The Commoner, was delicious. Even better, they had a complimentary wine and beer happy hour every evening. Overall, great experience and we would stay again.\n", "\nThe hotel was great. The staff was very helpful and friendly. The room was comfortable and pretty décor. Very quiet and a good sleep. They had a free wine and beer welcome party which was nice. My normal pet peeves of no mirror by the desk. Wish the toilet/shower was separate from the sink area. Makes it easier when 2...\n\n\nMore  \n\n\n", "\nI stayed at the hotel for a night and loved my experience. The Commoner (1920's style restaurant and bar within the hotel) had a great ambiance and friendly service. The hotel itself is eclectic with so much to look at. I walked around just to explore all of the decorations! My room was the cleanest I've ever experienced at a...\n\n\nMore  \n\n\n", "\nI couldn't recommend this hotel more highly. My husband and I and our two kids ( ages 10 and 12) travelled to Pittsburgh for a Bruce Springsteen concert. We have stayed at so many hotels and we couldn't fault the Monaco. From the friendly check in to the awesome pre concert drinks where they even put Bruce on the iPod...\n\n\nMore  \n\n\n", "\nGreat hotel kudos to Tommie who works the front door and his partner ( a young female, my bad I did not get her name) they set the tone for those luxury hotel with a boutique feel. Not stuffy at all just nice people who do everything to accommodate you. Rooms are comfortable, decor is eclectic and fun. Great vibe...\n\n\nMore  \n\n\n", "\nWe come to Pittsburgh about 3 or 4 times a year to visit my family and we have stayed in probably 15 different hotels searching for one that would really wow us. I think we've finally found our winner. Monaco is centrally located downtown an easy walk from a bunch of nice restaurants. The decor is trendy, and the rooms...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/07/4e/66/37/monaco-pittsburgh.jpg"}]
[{"category": "hotel", "review_count": "279", "title": "Sheraton Pittsburgh Hotel at Station Square Hotel Motel", "rating_string": "4.0", "address": "300 West Station Square Drive, Pittsburgh, PA 15219", "review_list": ["\nJust left the Sheraton after staying last night. I only started one night. My room was very nice and clean. The bed was super comfortable. I was also very happy to see Starbucks Coffee in the room! I took off 2 stars because of the issues I had prior to checking in. When I booked, I needed to use a...\n\n\nMore  \n\n\n", "\nPhones out and I had to go down 15 floors to order room service while leaving my 2 dogs in the room after driving 7 hours. I had to order at the bar. Not impressed. Finally lie down to sleep and pillows smell of the last guest. Too tired to go back down 15 floors to complain. Phones still out...\n\n\nMore  \n\n\n", "\nCheck in was easy. Front desk people were friendly. My room was clean and comfortable. The gym in the pool area was so filthy and scummy I had to take pictures. See for yourself. I cut my workout short. Ironically, hotel staff were walking around the area as I arrived.\nAdditionally, I was traveling with coworkers. They showed me cookies...\n\n\nMore  \n\n\n", "\nSkip it. Nothing works and no one cares. This hotel is dying and the staff there could care less. I have never seen such poor service that is accompanied by such an \"I do not care attitude in my life\".\nI could go on for an hour about what a bad experience this is but in short-\n1) Booked a...\n\n\nMore  \n\n\n", "\nGreat location. Great views of the city, river, and Heinz Field. Bed was comfortable and free WiFi speed was good. Only negatives of the room experience were the lack of HD channels and low shower water pressure. There are trains that run occasionally that will make noise but didn't keep me from sleeping. The Club Lounge on the 15th floor...\n\n\nMore  \n\n\n", "\nDecided to take a mini trip on the same weekend a major storm hits! Front desk woman was very pleasant, definitely loves her job. King size bed with river view! Loved! Yes the train does comes by but really not an issue. Bed was super comfortable. Used the fitness center very nice and well kept. Nice pool area. There was...\n\n\nMore  \n\n\n", "\nI stayed here only one night for a business meeting in the hotel. Check in was fast, friendly and professional. I was given a room on the 14th floor and it had a great view. The Sheraton is located right on the river. My view was of the river and the city.\nMy room was clean and very comfortable. The...\n\n\nMore  \n\n\n", "\nSo many great things to say- Found a great deal on another site. We were so lucky! Paid extra for a river view which was so worth it. Just beautiful views at night. Right next to a train track (maybe 2 trains a day?) which was a bit of a setback but we hardly heard it on the 8th floor....\n\n\nMore  \n\n\n", "\nThis is a so-so hotel. There are plusses and minuses but, overall, I don't think I would stay here again.\nThe pros: the room was overall okay, I slept well here, the wifi worked as expected (clearly throttled but at the advertised rate), and check-in and check-out was quick and professional.\nBut then there are a bunch of niggling cons....\n\n\nMore  \n\n\n", "\nClean & comfortable room, beautiful views of the river & city. Shopping, transportation, the Incline all in walking distance. Parking garage literally next to the hotel. Very convenient and the staff was excellent! Really enjoyed our stay! We'll stay here again!\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/08/35/9c/02/exterior.jpg"}]
[{"category": "hotel", "review_count": "452", "title": "SpringHill Suites North Shore Hotel, Pittsburgh", "rating_string": "4.5", "address": "223 Federal Street, Pittsburgh, PA 15212", "review_list": ["\nThis place, in one word, is gross. The room was dirty and run down including stained carpet, couch, and bedding, moldy shower curtains and thick dust on cords, etc. The breakfast was nothing special.\nWon't return!!\n", "\nIf you are looking for a place to stay when you're going to a Pirates game, the location can't be beat. Parking ($25) alone is worth the location. Plenty of restaruants within a short walk. Also, convenient for a Steelers game (just a little longer walk). We also walked to the Heinz Science Center from this location.\nRoom was clean...\n\n\nMore  \n\n\n", "\nStangely I am reviewing a hotel I have yet to stay at. Made a reservation error for a trip 6 weeks out. Called immediately and no resolution possible. Always enjoyed staying at Marriott, but will no longer choose to do so. Seems shortsighted customer relations. 😞😞😞 fine print strikes again!\n", "\nHad I not been there for a business trip, it would be a great hotel to stay in to watch a game. It is within walking of the stadium and restaurants.\nIt appears very new on the inside but I wouldn't think it would be new because of the location.\nIn any case, it was clean, comfortable and very reasonably...\n\n\nMore  \n\n\n", "\nI debated whether to give this 4 stars or 5 stars. However it will be a 5 for me.\nPros:\nNice sized suites\nClean rooms\nFriendly staff\nGood breakfast\nVery centrally located. Great restaurants within walkable distance.\nCons\nThe towels were old ( a bit worn out)\nThe bathroom was a bit dirty(not the cleanest) when I checked in\nThe...\n\n\nMore  \n\n\n", "\nProbably one of the better one nighter hotels I've been at. Was easy to get back and forth to the arena with the shuttle. Room was clean and comfortable. Didn't have a problem sleeping like I do at the Hilton Inns. Late night swim was great. Breakfast was meh as most North American places. Wireless was great. Would definitely stay...\n\n\nMore  \n\n\n", "\nBeautiful hotel, very close to downtown , we only stayed one night for a hockey game but will be returning. The staff was very friendly and informative. Our suite was beautiful very comfortable and clean. The breakfast was included with waffles, coffee, fruit, yogurt etc.\n", "\nStay was great, could have been made better by two small items. Room 309 - the toilet seat needs tightened and the big thing - the smell of grease and exhaust from the restaurant below. The stay wasn't ruined by the smell, noticeable as soon as we entered the room, but it prevented it from being perfect.\nI was surprised...\n\n\nMore  \n\n\n", "\nI come to Pittsburgh once a month for work. I travel to the suburbs when I am here. This it's nice to be in the center, so I commute out.\nI have stayed at this location 4 times now and it will be my go to. There are a few reasons for this:\n1) staff is very friendly and helpful....\n\n\nMore  \n\n\n", "\nThe rooms are nice. The bed was comfortable. The room had a Keurig coffee maker but only had 1 reg k-cup and 1 decaf k-cup. I think they should put at least 2 of each as my wife and I both drink reg coffee. So I just waited till on my way out when I went thru the lobby and...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/04/0f/20/ca/springhill-suites-north.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1000", "title": "Hampton Inn & Suites Pittsburgh - Downtown Hotel", "rating_string": "4.5", "address": "1247 Smallman Street, Pittsburgh, PA 15222", "review_list": ["\nThis was an average Hampton Inn. One of the only hotels in downtown Pittsburgh with free parking. The neighborhood seems to be a former industrial/trucking area that is slowly being made into a tourist area, but it isn't there yet. I would probably not walk alone in this neighborhood at night. Hotel had a few minor issues, like walls starting...\n\n\nMore  \n\n\n", "\nI have been traveling with work for 3 years now and would recommend this hotel for anyone staying in Pittsburgh. Clean, Friendly and Great Value (including Free Parking). Staff was great and location was perfect. Looking froward to staying at this hotel the next time I am in Pittsburgh.\n", "\nThe hotel was nice and everyone was friendly. Unfortunately, there was construction noise in the hallway at 8:00 am on a Saturday morning. I was very displeased. A date night getaway with my husband ended earlier that I expected.\n", "\nThe past reviewers were absolutely accurate! This Hampton Inn and Suites is excellent in every aspect! Service, squeaky clean and cost!!\nClearly the managers and entire staff here are proud of their hotel and their city.\nFrom the moment that I spoke to Alaina to reserve our room I could tell that this would be one perfect stay! We are...\n\n\nMore  \n\n\n", "\nThis property exceeded expectations for my recent business trip to Pittsburgh. The accomodations are very well kept, nicely appointed, with all amenities at your fingertips. The staff all went above and beyond to meet every need with friendly and helpful attitudes. Spacious rooms with all of the conveniences of home and hot breakfast served fresh each morning. I cannot say...\n\n\nMore  \n\n\n", "\nThis Hampton is by far one of the greatest locations I have ever stayed at! I chose the downtown location despite them not having a shuttle service because of the great location, and with the variety of restaurants and shopping nearby the shuttle isn't even needed. The nearest restaurant was just a block down the street, and the wonderful ladies...\n\n\nMore  \n\n\n", "\nAlaina and Taylor were our front desk staff on the day we checked in and they were awesome. Friendly staff - they pointed our dinner suggestions, advised us of places to visit: Phipps Conservatory, Rivers Casino; BIg Jim's Restaurant (great \"Dive\" restaurant) and Ikea!! Great breakfast buffet - just a great overall stay at a friendly Hampton Inn!\n", "\nI recently had the pleasure of traveling to Pittsburgh. I decided to stay at the Hampton Inn in downtown to be closer to everything. What an amazing experience! The hotel was walking distance to downtown, the strip district, and the north shore. The staff was incredible, going above and beyond to let me know where things were and giving suggestions...\n\n\nMore  \n\n\n", "\nWe arrived in the snow storm, service was amazing, staff pleasant and very helpful, went the extra mile. Breakfast amazing, rooms spacious and clean. Facilities were well laid out. A lot of extra's that came standard. Great location to the sports event. Close to many excellent food establishments\n", "\nHampton Inn's are somewhat cookie cutter, let's be honest. As long as they are clean they are good. What can make one better than the others? Staff and location are two variables and this Hampton Inn wins on both counts.\nLet's start with the staff. From the front desk to the housekeepers, everyone seemed genuinely happy to be there. They...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/01/7d/3e/07/hampton-inn-suites-pittsburgh.jpg"}]
[{"category": "hotel", "review_count": "632", "title": "Fairmont Pittsburgh Hotel", "rating_string": "4.5", "address": "510 Market Street, at Fifth Avenue, Pittsburgh, PA 15222", "review_list": ["\nI have been staying at the Fairmont Pittsburgh since it opened. I am a very experienced traveler who spends over 100 nights a year in hotels. This hotel is my favorite! The facility is top notch and the staff is attentive and competent. They are the best.\n", "\nWe reserved a room with two double beds for three people about 1 month in advance. When we checked in we were told there were no two bedded rooms available. Instead we were told we could have a single bedded room (king size bed) with a roll-away. The staff offered no other alternatives, compensation, or \"service recovery\" other than to...\n\n\nMore  \n\n\n", "\nThe Fairmont Pittsburgh is a fantastic hotel in the heart of the city. The staff is very friendly. The hotel bar, off the lobby, is very lively. The rooms are well appointed. The bathroom is almost as big as the bedroom with separate shower and large bathtub. The hotel is within walking distance of PNC ballpark. (If you're in town,...\n\n\nMore  \n\n\n", "\nThe Fairmont Pittsburgh is located in what feels like the center of downtown. It's a great location in which to be. The staff are very welcoming. It's not a luxury hotel per se, rather it's a very nice hotel with excellent service and very nice rooms and common areas. The room service was very accommodating with our no doubt uncommon...\n\n\nMore  \n\n\n", "\nGreat Hotel, great employees, perfect location\nBeautiful rooms\nGreat reataurant. Loved the hotel, the elegance, view , food, staff, gym and location next to Market Square.\nWhat more is there to say, the best!\n", "\nLove my stay at Fairmont Pittsburgh! The staff is wonderful, Andy's is a great place to hang out and the rooms are extremely comfortable and clean. My only concern is the placement of the hotel and the way it is angled on the street. It makes it very very difficult to find if you are not from the area. I...\n\n\nMore  \n\n\n", "\nI stayed at this hotel for one night. It was very nice and the staff made me feel welcomed immediately upon arrival. The room was large, nicely decorated and very clean. The bed and pillows were divine. I loved how the room had coffee service with plenty of condiments and cream, not just a little packet. The lobby is very...\n\n\nMore  \n\n\n", "\nbe careful when booking your rooms, the hotel does not promise the one that you have booked well in advance. booked two queen beds and hotel overbooked and offered us a single bed with a cot. 229.00 to sleep on a cot.\n", "\nStayed here 1 night in January 2016 to attend Bruce Springsteen concert, and turns out the Boss was on the 23rd floor. Very cool (saw Max in the lobby). Beyond that, this is a very nice hotel in a great location. We stayed on 19th floor and it was very quiet and room was very comfortable. Only complaint: $15 for...\n\n\nMore  \n\n\n", "\nThe only reason that I gave the Fairmont a 5 rating is that is the highest it goes. The hotel itself is very nice, rooms are spacious and modern. The gym is much better than I expected. I think the thing that sets the Fairmont at a higher level is the quality of the staff. If you ask any of...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/07/80/c3/ef/1-king-bed.jpg"}]
[{"category": "hotel", "review_count": "465", "title": "Residence Inn Pittsburgh North Shore Hotel", "rating_string": "4.5", "address": "574 West General Robinson St, GPS use 214 instead of 574, Pittsburgh, PA 15212", "review_list": ["\nStaff is definitely friendly, plus, but there effort and actual results don't quite match up. Regardless of that shortcoming, all else was good. Nice room, bit run down, but overall nice. Breakfast has tons of options to make everyone happy!\n", "\nMe and my boyfriend wanted to get away for a night. Being that we were on a budget I found this hotel for $115 on a Thursday. I bought the cheapest room, and when we arrived, the guy at the front desk (mycah) asked what floor we wanted to be on! Then we got up to our room, and the...\n\n\nMore  \n\n\n", "\nThis hotel is right next to the baseball field, and is close to a lot of Pittsburgh attractions. Staff members at this hotel are super friendly and the hotel itself is clean, comfortable, and definitely has all the things you need for a comfortable short or extended stay. We appreciated the pool, excellent free breakfast, and billiards/theatre area, too. We...\n\n\nMore  \n\n\n", "\nGreat place to stay if your going to a game or just getting away for the night . Close too everything . The folks that work here are super nice would highly recommend this hotel next time your in the north side .\n", "\nHistory: Built in 2010\nLocation: North side of Pittsburgh across Allegheny River from downtown. Across the street from PNC Park where Pittsburgh Pirates play.\nInterior Decor: Newer styled Residence Inn with contemporary Mediterrenean colors.\nExterior Apperance: 10 story hotel in brown/beige colors. Attractive.\nOutside view from the room I stayed at (901): Wrong sides - Instead of downtown or PNC...\n\n\nMore  \n\n\n", "\nAfter an extensive online search, we four (parents, adult daughter and grandmother) found this two bedroom/two bathroom w/ kitchenette suite to be perfect. We used Uber for longer transportation needs, but the hotel shuttle was perfect for trips within a 3 mile radius. The staff was quite accommodating. The included breakfast was perfect for our tastes with fresh fruit, eggs,...\n\n\nMore  \n\n\n", "\nGreat location a few minutes away from the downtown. Reasonable suites good for family trips. The suites are modern, with all the conveniences you need. Great shuttle service to surrounding attractions. The hotel is right across the street from the stadium so the neighborhood has zero charm and is rather deserted. However the are several bridges nearby that lead to...\n\n\nMore  \n\n\n", "\nI had the chance to speak with the property manager after my stay. My issue was with check in and the person I checked in with, His name was Dylan. The worst Marriott employee I have every dealt with,. Dressed in dirty clothes, very argumentative at check in, too busy on the internet when I needed some toilet paper later...\n\n\nMore  \n\n\n", "\nI have traveled to numerous Residence Inn hotels throughout the country, but after this visit at this location...never again. When we entered our suite, we were so pleased. The decor was nice, the room was very comfortable, I just felt at home until my husband pulled back the blanket and called me over to take a look. I was disgusted....\n\n\nMore  \n\n\n", "\nThere are many nice things to say about this property. However, there was a concern regarding the elevators, and I want to share some info with fellow travelers first.\nWe did get stuck in the elevator, though only for a few minutes. In summary, if you push more than three floors on the elevator button panel, the elevator decides to...\n\n\nMore  \n\n\n"], "img_url": "https://static.tacdn.com/img2/x.gif", "class": "3.0"}]
[{"category": "hotel", "review_count": "1146", "title": "Renaissance Pittsburgh Hotel", "rating_string": "4.5", "address": "107 6th Street, Pittsburgh, PA 15222", "review_list": ["\nUpon entering the double dour to the magnificent marble foyer, you'll be astounded by the beauty. Walking forward you see a giant split staircase leading you to the second floor. Wonderful menu, building has such interesting history. Read up before going, you'll thank me later 👧🏻❤️👧🏻❤️\n", "\nWe love to stay here when we are in the city to see a show and when we were given tickets to see \"Cabaret\" we checked here first for availability. Were pleased to see an opening and since it was my husbands birthday weekend, we knew this is where we would stay-upon check in, we mentioned to \"Steve\" the gentleman...\n\n\nMore  \n\n\n", "\nMy family and I stayed at the Renaissance over the weekend. From the doorman to the check in staff everyone made the experience the best. The view was superb and the room beyond compare. I highly recommend this hotel. The beds are very comfortable and the room is posh. The bathroom is enormous and everyone enjoyed the spaciousness\n", "\nWe love this hotel! Top notch!!!\nWe had a suite with king bed room, living room, dining room and bar, 2.5 bathrooms and connecting 2/queen bedroom.\nThe staff was excellent! Special thanks to Mary and Steve at the front desk. Also the valet staff.\nEverything was as we expected only better!\nComfy beds, pillows and rooms. The view is incredible....\n\n\nMore  \n\n\n", "\nAwesome place. We went as a family to see a show with the kids. Huge rooms, very clean. Walking distance to where we wanted to go.We had 4 adults and 2 children and only one room with two beds...it worked but wasn't the best nights sleep. however, this has nothing to do with the hotel's inadequacy, it was just us...\n\n\nMore  \n\n\n", "\nWe stayed here over a snowy weekend because we wanted a unique hotel with a great location near Heinz Hall. The Renaissance delivered all that and more! Gorgeous lobby, beautiful rooms with great views of the river and the city. Our rooms were very big and beds were comfortable. Added bonus was a parking garage right across the street. We...\n\n\nMore  \n\n\n", "\nI stay in a ton of Marriott properties. By in large I like courtyards because they are generally new and clean. This trip I decided to stay at the Renaissance to mix things up. I got a feather free river view room and although small very nice. I walked to dinner and had a night cap at the hotel bar....\n\n\nMore  \n\n\n", "\nI have stayed here a few times and everytime it's great. Service is wonderful...rooms and hotel is updated and gorgeous. I've also been here for a wedding and it was amazing-great views of the city frm the ballroom and rooms. I think this is the best hotel in the city by far! Great location-close to stadiums and all that's going...\n\n\nMore  \n\n\n", "\nVisited the RV Show in Pittsburgh a few weeks ago. We always stay here when we travel to Pittsburgh. The rooms are clean and the bed are comfortable. The views from the river view rooms are beautiful. The food is delicious! We love getting the mussels! The staff is friendly and helpful. The hotel is close to PNC Park and...\n\n\nMore  \n\n\n", "\nRoom description stated \" large room on club level with view of the city\". Our room was on the club level but the view most definitely was not of the city. The room was comfortable but the wind howled all night, making it difficult to sleep. One bright spot was Mary at the front desk. She is always cheerful and...\n\n\nMore  \n\n\n"], "img_url": "https://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "632", "title": "Hyatt Place Pittsburgh-North Shore Hotel", "rating_string": "4.0", "address": "260 North Shore Drive, Pittsburgh, PA 15212", "review_list": ["\nMy name is Sara Gargino, my family and I recently stayed at your hotel and the following morning we woke up a little late and came down for breakfast. When we got to the dining area we noticed that breakfast was already being put away as it was after 9:30. One of your employees, Brandon, was very nice to my...\n\n\nMore  \n\n\n", "\nMy boyfriend and I stayed at this hotel for one night for a concert at the Consol Center. We originally were planning on taking an Uber from the hotel to the concert, as we were unaware of the public train. Upon check in, we were made aware of the free train that is directly behind the hotel parking lot that...\n\n\nMore  \n\n\n", "\nThe room was great and the hotel staff went out of their way to help any way they could. I stayed four days and got a great rate on the room. Several days I had to stay in my room and ordered food. The food was great and saved me a lot of time instead of going out. I highly...\n\n\nMore  \n\n\n", "\nWe stayed at the hotel for 1 night on the weekend. The room was spacious and clean. The bed was comfortable. Check-in was smooth and the employees were friendly and helpful. Shuttle was readily available to take us to local attractions. Overall we had a great experience and would definitely recommend this hotel to others.\n", "\nThe rooms were fairly nice, and it was clear that the hotel was newer. One odd thing, was that there is one tv in the room, which is somewhat difficult to see if your in the bedroom, and the remotes totally suck (that was a topic of conversation with some of my fellow travel companions about their rooms also).\nI...\n\n\nMore  \n\n\n", "\nMy husband and I stayed at this hotel for 1 night. We were in town for a concert at Stage AE. We were within walking distance of many restaurants as well as PNC Park and Heinz Field. Check-in was quick and easy. Our room was on 5th floor with a view of the parking lot and highway above us. The...\n\n\nMore  \n\n\n", "\nWe will absolutely stay here the next time we're in the Pittsburgh area (and told a handful of other families we were traveling with who were staying somewhere else that they should stay there next time, too). Every staff member we met was cordial and polite, to the point where everyone in the group commented about how everyone was so...\n\n\nMore  \n\n\n", "\nIf you're accustomed to Hyatt Place's this one will not disappoint. Free breakfast and some great views of the city. If you are going to an event at PNC Park or Heinz Field this is the place to stay. Hotel was extremely clean and staff was very courteous\n"], "img_url": "https://static.tacdn.com/img2/x.gif", "class": "3.0"}]
[{"category": "hotel", "review_count": "102", "title": "Cambria Hotel & Suites Pittsburgh - Downtown", "rating_string": "4.5", "address": "1320 Centre Ave, Pittsburgh, PA 15219", "review_list": ["\nI really enjoyed the room, the staff, the pool, the hot tub, the parking. My only two complaints would be the open concept shower (it made for a very cold showering experience) and that I did not receive a wake up call I had requested in person at the front desk.\n", "\nPerfect location if you need to be near Mercy Hospital in Pittsburgh, PA. Also located right next door to the Arena that the Penquins Hockey team plays at, so if you are going to a game there, this is so very convenient place to stay at. You can park at the Hotel for a daily fee, the rooms are very...\n\n\nMore  \n\n\n", "\nCame back here after 4 years and the place still looks as great as it did when it first opened! The consierge Kelby was amazing! I had actually remembered him from our two previous stays here in Pittsburgh. Such a great gentleman and very knowledgable and accomodating! This is an excellent place to stay! I would highly recommend it to...\n\n\nMore  \n\n\n", "\nGreat location for a Penguins game - the hallway leads to the entrance. Great rooms at a great price. Centrally located to downtown or the South side for food and bars. The free shuttle makes it easy. If you stay at the hotel for food or drinks, they are above average with above average servers. Mandy, Renae, Eric and Molly...\n\n\nMore  \n\n\n", "\nWe stayed here for over a week during the holidays. The style and layout of the rooms, the friendly staff, the location, and the amenities make this a perfect place for a longer stay. We were able to walk everywhere in the city. That said, parking is very easy and accessible so when we did drive, our car was right...\n\n\nMore  \n\n\n", "\nCame to the hotel for a work meeting in the area. The staff was excellent at helping with suggestions around the city. Ended up going to the hockey game (rink is basically connected to the hotel) and had a great time.\nThe bartenders, Mandy and Renee, were excellent and I highly suggest getting a beer or cocktail from them!\n", "\nWent to a,penguins game. Great being right next door to consol energy center. Staff was very friendly. Had a,great time. Will definitely stay there again... loved it. Loved seeing all the veteran hockey players. Rode elevator with Mario Lemieux. Happened to be the Mario Lemieux fantasy hockey charity event. Also. Boyfriend was in heaven, seeing mario Lemieux, ti Domi, and...\n\n\nMore  \n\n\n", "\nKelby at the front desk is terrific. He is welcoming and friendly and you can count on him to give you a great room and to make things right should they ever go wrong (which is hardly ever). I highly recommend this hotel anytime you're in Pittsburgh.\n", "\nI arrived for a Penguins game right ahead of Winter Storm Jonas. The Staff who assisted me were friendly, professional, warm and genuine. The room was clean, modern, quiet and very comfortable. The hotel offers many features such as free HBO , coffee in room and in lobby coffee shop, pool, hot tub, fitness center and a sundry shop. The...\n\n\nMore  \n\n\n", "\nI have been here a couple times now and have had a great stay every time. The hotel lobby, restaurant, pool, and gym are all very nice. The place is very clean. The rooms have a cozy feeling to them. More importantly than the place itself are the people that work here. Everyone is so welcoming and helpful. Mandy and...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/01/c2/0b/09/cambria-suites-at-consol.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "671", "title": "Hampton Inn Pittsburgh/Greentree Hotel", "rating_string": "4.5", "address": "555 Trumbull Dr., Pittsburgh, PA 15205", "review_list": ["\nSee title. Chose this location based on recommendation and proximity to events we were going to. All was fine except for the paper-thin walls; we could hear the cackling hens next to us the entire evening and morning.\n", "\nRoom was very clean and comfortable, breakfast was fantastic, staff very helpful, and the location perfect for our needs. We wanted to be close to Pittsburgh to enjoy the city, but still have comfortable parking. This spot gave us both.\n", "\nExceptional stay. Friendly and helpful staff. Room well appointed. Very clean everywhere. Good breakfast. Comfy bed. Stayed with my dog. Lots of room to walk him outside. Wish more HH accepted larger dogs.\n", "\nFantastic place to stay. Very clean and the housekeeping staff goes out of their way to ensure everything is spotless and appealing. The director of housekeeping was by far the most accommodating and courteous I have ever encounter at any hotel I have visited and I have stayed at many of the top 50 hotels in the world. She is...\n\n\nMore  \n\n\n", "\nI stay here a lot for business. The hotel is always clean and neat. The staff is pleasant and easy to deal with. The rooms are a bit on the small side but they work for me. The breakfast is like all other Hamptons. The price is usually always good. I recommend staying here. This hotle is pet friendly and...\n\n\nMore  \n\n\n", "\nWe booked this hotel because of its location. Easy to get into the city and onto the parkway west. When the major storm hit the staff made the necessary moves for us to spend another night. They do have a shuttle service to major sites in the city\n.\n", "\nWe thoroughly enjoyed our stay. The staff made the dogs feel welcome and the room was very clean. The complimentary breakfast was better than most other hotels. The only problem we had was that the king bed with sofa bed room was tight for a family of four traveling with two dogs. Other than that, everything was great!\n", "\nI had a great experience at this Hampton Inn. The front staff was very friendly and accommodating. The room I stayed in was very nice and clean. The fitness center was very nice and clean as well. I could not have been happier with the service I was provided during my stay. I will definitely stay there again if I...\n\n\nMore  \n\n\n", "\nWe arrived at the Hampton inn at green tree on Saturday 1/16 because we came to Pittsburgh for a penguins game all the way from New York. As we arrived in the corridor there was a strange odor walking in but that was the least of our problems. Checking in the guy behind the counter was bland and looked as...\n\n\nMore  \n\n\n", "\nWe picked this hotel because of location close to downtown Pittsburgh but not in busy City. It is close to shopping and Robinson Township shopping and restaurants. The hotel is clean, the staff was good - we enjoyed our stay. Food rate a 7 on a 10 scale. Good staff.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/08/32/4d/5b/hotel-exterior.jpg"}]
[{"category": "hotel", "review_count": "336", "title": "HYATT house Pittsburgh-South Side Hotel", "rating_string": "4.5", "address": "2795 South Water Street, Pittsburgh, PA 15203", "review_list": ["\nThe rooms were beautiful, quiet, and comfortable. Every staff member I met was kind, considerate, and very helpful. Even though I was alone I never felt alone. Wonderful experience! I definitely will stay at this hotel again.\n", "\nThis Hyatt concept has all the amenities a business traveler expects. close to several dining and retail options, business center has easy access plus a good clean hotel in an up and coming area of Pittsburgh. Not a fan of their sports teams but I am now of the city.\n", "\nWe stayed at The Hyatt House south side Pittsburgh for two nights. Of course Pittsburgh is not a fun city to drive in, the staff at Hyatt House was sure to let us know of the shuttle service available. They also pointed us in the right direction to all surrounding amenities, such as restaurants, night life, etc. The hotel is...\n\n\nMore  \n\n\n", "\nI have stayed various places around the south side of Pittsburgh over the last 12 months and have found the Hyatt House to be in a great location with clean and comfortable rooms. I try to stay there whenever possible.\n", "\nLocated next to many restaurants. Very clean and comfortable rooms. Linens were impeccable. Bar prices in the hotel were a bit higher than expected but there were many other drinking establishments nearby. Beautiful facilities.\n", "\nI can't tell you how many times I've stayed here, but I love it. There's so much to do, all within walking distance. Even for the things that aren't, it's very well-situated to jump onto the Parkway in either direction. The accommodations are top notch, the staff is always very courteous and helpful, and their breakfast is a good way...\n\n\nMore  \n\n\n", "\nWe stayed at this hotel for a January Saturday night in a one bedroom suite with \"partial view\" of the river. The room was big, very well designed, and we had a great view of the river and the city. The hotel was quiet and the continental breakfast was extensive given that it was free (the omelette bar was great!)....\n\n\nMore  \n\n\n", "\nxWhat a great hotel, we had a beautiful view of the river. At night the lights along the river were awesome. The hotel is new, well laid out and very comfortable. For business travelers this is the place I would want to stay - kitchen, work space, living space, great bathroom with all the amenities. For leisure travelers - it...\n\n\nMore  \n\n\n", "\nThis is a newish hotel, which means it's clean and everything works. Nice, comfortable beds. The size is great with a nice kitchen (why a cheese grater). The living room area is the one downside. The seating area is really uncomfortable. The only solution is to bring pillows from the bedroom and use those to lean on. Location is really...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/04/20/4d/93/hyatt-house-pittsburgh.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "647", "title": "Pittsburgh Marriott City Center Hotel", "rating_string": "4.0", "address": "112 Washington Place, Pittsburgh, PA 15219", "review_list": ["\nLove this hotel. Service is the best of any Marriott property in the country. Front desk staff extremely friendly and helpful. Rooms are updated and modern. Starbucks conveniently located in hotel lobby. Modern bar plus very close to Consol arena for hockey or concerts. Would recommend over other downtown hotels. Shuttle service is a big plus.\n", "\nAwesome location for a Penguin game. Great location, good people and great time. Across the street from the Consol Energy Center makes for easy access to the games. The employees are very helpful with any need. The shuttle makes getting around Pittsburgh a snap.\n", "\nStayed here for the Steelers vs Colts game in December. The hotel staff was extremely friendly, knowledgeable, and courteous. Prior to booking I was worried about the location and how easy it would be to get to the stadium, but taking the T was extremely easy, safe, and clean. We were able to get back from the game in only...\n\n\nMore  \n\n\n", "\nWe picked this hotel because of it's proximity to the Consol Energy Center arena. We got an upper floor, king room and it was nice! Loved the city view (including the arena) out our window. The bathroom is TINY. The room was quiet though, and the bed was comfortable. We had food and drinks at their bar before and after...\n\n\nMore  \n\n\n", "\nI had participated an event organized here. I must say there was nothing particularly bad with the hotel, but also nothing excellent. Location is great, walking distance to downtown.\nA bit worn room, limited soundproofing, noisy AC (cannot be switch off). Conference facilities are however nice, but the buffet meals were below average with some exception. On the other hand...\n\n\nMore  \n\n\n", "\nNot only is the hotel conveniently located (across the street from the Consol Energy Center) the accommodations were wonderful and the staff was helpful. I loved having in/out parking privileges as a hotel guest and also receiving complimentary wi-fi access as a Marriott rewards member. I ordered room service (a mushroom, swiss burger with sweet potato fries) and the food...\n\n\nMore  \n\n\n", "\nGreat Location. Very nice Marriott. They did the most they could to accommodate the Springsteen overload. The lobby is a little small, but they did the most with the space they had. Large Starbucks in the attached conference center is really nice. Great to have a full service Starbucks right there!\n", "\nThis is a very clean, well-run hotel close to the Consol Center. The lobby and bar are sharp looking and inviting. Our room was quite large, clean and comfortable. And the staff was courteous and attentive from the valets, the bellhops, the front desk, and the women running the breakfast buffet. It is surprising how often that is NOT the...\n\n\nMore  \n\n\n", "\nVery clean and when we checked in the additional requested amenities were already stocked in our room (towels, feather pillows and liquid soap).\nIt's in walking distance to the Consol Center. On Friday and Saturday the hotel bar stays open until 2pm, but the bar is very small with almost no seating, so hanging out there after an event can...\n\n\nMore  \n\n\n", "\nWe love staying at this Marriott when we are in Pittsburg! Before you even walk in, the high quality customer service is apparent. The bell hops go out of their way to make sure you are greeted, make small talk when they aren't busy and you are waiting, and don't just point in the direction of where you need to...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/07/53/e0/0d/marriott-pittsburgh-city.jpg"}]
[{"category": "hotel", "review_count": "1200", "title": "DoubleTree by Hilton Hotel & Suites Pittsburgh Downtown", "rating_string": "4.0", "address": "One Bigelow Square, Pittsburgh, PA 15219", "review_list": ["\nVisiting Duquesne University, this was a perfect location to stay. We were able to walk to several restaurants in the area, and the hotel has it's own restaurant. Valet parking only for a set fee, but they were quick and efficient. Room was good size for 3 people, with desk in a little alcove off the main room. Hotel and...\n\n\nMore  \n\n\n", "\nGreat hotel for traveler with business downtown. Friendly staff. Clean rooms. Convenient to business district, Consol Center and transportation. I was there for 2.5 weeks and was made to feel like family. Would stay there again.\n", "\nOverall, very nice stay. Staff is very friendly and the room was clean. Hotel is located in downtown Pittsburgh and is close to major offices and VERY close to the Consol Energy Center if you want to catch a Penguins game. Only negative is the bathroom is very small. Very little sink area for toiletries.\n", "\nPerfect location for going to events at the Consul Energy Center. Just a short walk away. Rooms were clean. Staff was very prompt with providing a roll away bed and extra blankets. The cookies are great!! They do have nuts, so be careful if you have allergies.\n", "\nWe were in town for the Springsteen concert/Penguins game. Hotel was what you would expect for a Hilton. Very clean and staff were very helpful and attentive. Free shuttle to all local attractions in the city. We took the shuttle to \"Southside\" as well as the \"Strip\" Rooms were clean and beds very comfortable. Restaurant was closed for renovations but...\n\n\nMore  \n\n\n", "\nStayed here for a night while in town for a Steelers game. While our room wasn't ready yet, they were very courteous, stored our bags for us while we hit the city for a bit. The staff was always friendly and happy to help with anything.\nThe room was clean and certainly up to standards. We travel a lot as...\n\n\nMore  \n\n\n", "\nSolid hotel choice among other options in Pittsburgh. Lobby experience typically includes some form of local exhibit. Also classic DT experience with warm cookie. Rooms appear to have been renovated within a reasonable period. Very comfortable bedding. Room size is good...not too small or large. Plenty of electrical outlets as part of each lamp. Staff is always very welcoming.\n", "\nI stayed at this hotel to see a concert at the Consol Energy Center. It was in easy walking distance to the venue as well as the Market Square area. The room and common areas were perfect. The staff was very friendly as well.\n", "\nThe location of this hotel was very convenient for getting around downtown on foot. It was lovely and clean. Great customer service at the front desk. There is a well-stocked 7-11 mini-mart attached to the hotel which my teenaged children thought was heaven on earth. The room was clean and quiet - but small. The bathroom was especially cramped. The...\n\n\nMore  \n\n\n", "\nPart of the pleasure of a Doubletree, I admit, is getting a free cookie which is always pretty good, and often warm, when you check in. So while I contained my disappointment at no mention of a cookie and none in sight, it’s a small ding.\nThe room we chose in online check-in was ready and available—but had we known...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/06/6a/5a/7a/doubletree-by-hilton.jpg"}]
[{"category": "hotel", "review_count": "580", "title": "DoubleTree by Hilton Hotel Pittsburgh-Green Tree", "rating_string": "4.0", "address": "500 Mansfield Avenue, Pittsburgh, PA 15205", "review_list": ["\nIf you think you are staying in Pittsburgh, you are NOT. This is Greentree and not even close to the city. The hotel needs a complete update with all facilities very old and \"tired\" looking. The location is also very difficult to find. Re the reservation fiasco, even when shown the printed e-mail with confirmation #, the hotel still insisted...\n\n\nMore  \n\n\n", "\nThis hotel was ideal for my business trip to the Pittsburgh PA market. It was centrally located to most of my customers. The area provided sufficient places to entertain my accounts.\nThe rooms were very clean and comfortable. My one challenge was upon check-in. I received my key card, went all the way you my room(luggage in tow) only to...\n\n\nMore  \n\n\n", "\nI stayed for 4 nights the week of the Jan 20th. I have stayed at this hotel a few times now. The hotel is large and clean. Friday night about 1:30 am I heard a noise. I got up to look around and didn't see anything. I then turned the bathroom light on and the ceiling was leaking water. I...\n\n\nMore  \n\n\n", "\nEnjoyable stay Just love the bedding - so comfortable Cookies were warm and tasty. Easy place to stay if you need to fly out of Pittsburgh it had lots of easy parking. Bar staff very friendly. Just wish they had a free breakfast.\n", "\nThis hotel is an older hotel but they have done a very nice job of keeping the interior up to date. I mention it being older only because of some minor issues with it, bathrooms are very small and elevator makes a lot of noise. Neither of these issues would keep me from going back. Overall room size is very...\n\n\nMore  \n\n\n", "\nHit all the musts when traveling with a kids sports team. Pool, restaurant, wi-go, bar for parents. We stayed in tower three and the rooms were a bit run down. Peeling paint on bathroom door as there are no vents.\nComfy beds and the kids must have kept the kitchen running on cookies.\n", "\nI've been coming to this hotel for 10+ years, and it just seems to get better every time. The staff treats you like family and goes out of there way to help you with anything u may need or want. The bartenders are the friendliest around, front desk is very helpful and accommodating , the shuttle drivers have so much...\n\n\nMore  \n\n\n", "\nMy wife and I went to Pittsburgh, PA, last month on an unplanned visit. The hotel we usually stay in was booked up and the appointment rep recommended the DoubleTree Inn. We said OK and hoped for the best - and that is exactly what we got.\nThe desk staff were very friendly and helpful, even when we asked for...\n\n\nMore  \n\n\n", "\nThis is our second stay at the Green Tree Hilton. When we were there 3 years ago, much of it was under reconstruction, so it was nice to see all of that completed. We stayed here because a group of friends was visiting Pittsburgh to attend Pitt wrestling duals. One of our friends has a son who wrestles there. While...\n\n\nMore  \n\n\n", "\nHotel is in a safe area and convenient to the city. The hotel, as with most Double Tree, is clean and comfortable. The staff is friendly. I recommend this hotel for business and family. The bar/restaurant is fairly priced and the burger and wings were tasty. The food mart offers Starbucks Coffee and pastries although the pastries did not taste...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/09/81/1c/51/champions-lounge.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "510", "title": "The Westin Convention Center Pittsburgh Hotel", "rating_string": "4.0", "address": "1000 Penn Avenue, Pittsburgh, PA 15222", "review_list": ["\nThe WESTIN is the best hotel in Pittsburgh.\nSuch an excellent facility. Perfect location for downtown attractions. And a short ride to HEINZ STADIUM. Near all interstates, so visiting people in different locations wasn't difficult from the hotel.\nGreat room, great service. Hope to stay again soon!\n", "\nNothing to complain about at this hotel. Excellent service, and if you're staying for a convention, a direct skybridge to the convention center so you can get ride over there without having to brave the 'elements'!\nAlso there is some great dining within walking distance of this hotel - try the Commoner for dinner, or the tap room for drinks....\n\n\nMore  \n\n\n", "\nCame to town from Las Vegas to see the Steelers play against the Ravens. Although the steelers lost in overtime, the trip was amazing. The staff was very helpful and friendly, the hotel was clean and had wonderful views of the downtown area. We took the free shuttle to the game and when we got off the shuttle, the driver...\n\n\nMore  \n\n\n", "\nI have avoided this hotel in the past due the ridiculous room rate and the fact that it was undergoing a major renovation. I was attending a conference at the attached convention center (CC), which is why I stayed there. The walk to the CC is LONG, LONG, LONG. Since the weather wasn't bad, we ended up walking there outside...\n\n\nMore  \n\n\n", "\nChecking in with Front Desk Agent, Joseph aka Joey Wallace, was a pure pleasure. He was very helpful and attentive. The hotel lobby is beautiful with a convenient restaurant with awesome service. Nice big room with an incredible view.\n", "\nThe lobby is very nice and the staff is very helpful. The shuttle is very convenient and will take you anywhere within a mile of the hotel and to the casino, and the driver was most helpful and informative. The parking deck is an old style underground cramped deck with poor signage. The halls and rooms are a little dated...\n\n\nMore  \n\n\n", "\nI was very happy with my accommodations at the Westin. Room was clean, bed was comfortable and the staff was friendly. Great location as well. Didn't eat at the restaurant, but had a drink at the bar, which was fine.\nI'd definitely recommend the Westin when staying in downtown Pittsburgh.\n", "\nTwo of our other colleagues who were at this hotel the week prior both had to call security for starters, so that wasn't a good impression of the hotel before I even made the trip down to Pittsburgh. One called because a hotel employee arranged for his child to celebrate their 18th birthday in the hotel room next to my...\n\n\nMore  \n\n\n", "\nI stayed during a non-busy time and had no elevator issues. I found the staff to be very helpful and friendly, including in the restaurant. The rooms were adequate, but seemed a little tired. The location was great for access to most places downtown.\n", "\nMister Marvin The Doorman at The Westin Hotel Pittsburgh is an awesome gentleman. He makes me feel welcome when I arrive after a long drive from Reading or wherever I have driven from that day. He always remembers my name. A great experience to be greeted in such a friendly fashion. Well done!!!\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/05/5b/ee/23/traditional-king-room.jpg"}]
[{"category": "hotel", "review_count": "584", "title": "The Priory Hotel, Pittsburgh", "rating_string": "4.5", "address": "614 Pressley St, Pittsburgh, PA 15212", "review_list": ["\nTook my BFF to Pittsburgh overnight and so glad we choose this hotel! Although in a sketchy part of town, we felt safe. The price was great (including free parking) and the shuttle downtown was convenient, but it was much more than that. The beauty of the historic building and the way the hotel respected its history as a monastery...\n\n\nMore  \n\n\n", "\nWe were happy to find this hotel on the web and booked it for an overnight stay to see a Bruce Springsteen concert at the Consol Energy Center. What a historic gem! Our king room was completely modern yet it didn't lose the historic charm....tall ceilings, period decor, and well chosen antiques abound. The shuttle service to Consol was excellent!...\n\n\nMore  \n\n\n", "\nStayed her while in town for a Bruce Springsteen concert. Chose it for price and location but got so much more.\nSuper convenient shuttle provided to and from The Console Energy Center. Rooms were beautiful and clean and staff was very friendly and helpful. We didn't make it to the complimentary breakfast but hear it was good.\nParking right around...\n\n\nMore  \n\n\n", "\nWe had to make a trip to Pittsburgh for a family emergency. Usually we stay with friends, but couldn't for this trip. We wanted to be downtown, but not in a big, corporate hotel. The Priory was a great surprise. The price is very reasonable, the hotel is charming and authentic. Nicki, the bartender in the Monk's Bar, makes a...\n\n\nMore  \n\n\n", "\nClean king room. Easy check in. Fair price. Nice breakfast included. Shuttle that took us anywhere we wanted...like having our own driver. Small & very inviting bar. Delicious drink specials...bartender was cranky 20 minutes before close. Not cool.\nOff the beaten track. Not so much traffic near hotel. Four out of five stars from me!\n", "\nThis is a nice quiet property with pleasant staff and in a good central location. Close to Heinz field and PNC. Room was nice and well appointed. A very quaint place. I will stay there again without question.\n", "\nThe Priory is a charming use of a historic building. A refurbished monastery that was once scheduled for demolition until a community stepped in and held off its destruction. Located in once was historic Germantown this cozy hotel is within walking distance to the Heinz stadium and PNC park. They even offered transportation to some venues like the casino. Whether...\n\n\nMore  \n\n\n", "\nLiked everything about our stay at the Priory . Take advantage of the free shuttle if you plan on going to the strip. make sure to check out the grand hall and the neighborhood too. The breakfast was generous as well.\n", "\nSaved $50.00 parking fee for Steeler game by staying here (free shuttle or close enough to walk). The intimate on-site bar (and bartendress) lend an intimacy to this unique lodging. If you like places with a history and a \"feel\", just stay here for heaven's sake!! The breakfast itself and the room it's served in are bonuses to your visit....\n\n\nMore  \n\n\n", "\nThis hotel is unique for sure. Cleanliness in the shower is less than to be desired. Mold building and visibly showing. Room 202 check it out. I had family in another room 222 and the furniture from a queen bedded to king bedded room was much better in the King room. Seems inconsistent. Nice venue for a wedding. I would...\n\n\nMore  \n\n\n"], "img_url": "https://static.tacdn.com/img2/x.gif", "class": "3.0"}]
[{"category": "hotel", "review_count": "127", "title": "Crowne Plaza Pittsburgh West-Green Tree Hotel", "rating_string": "4.0", "address": "401 Holiday Drive, Pittsburgh, PA 15220", "review_list": ["\nIt's been a couple of months since I've been to the Crowne Plaze, but as I walked in Stephen immediately greeted me. The manger of the hotel usually makes rounds inviting you in for the first time or welcoming regulars back.\nThe rooms are great. Clean and comfortable. The workout room has good equipment with 2 TV's to view while...\n\n\nMore  \n\n\n", "\nI've never stayed at this hotel /never been to Pittsburgh but drove in for the 1st night of the new Bruce Springsteen Tour ...Brrrrucccce...ok, enough of that...The hotel had everything I needed and expected. The lobby/front desk were helpful/available, arranged a shuttle bus for me,\nthe housekeeping staff on the floor were great - they assisted with a few things...\n\n\nMore  \n\n\n", "\nA nice hotel with ample parking and more than comfortable accommodations. The room was nice and the restaurant on site was great for dessert and drinks in the evening. There was an event going on that weekend so they had a special menu, but when I expressed that I wanted a certain dessert, they were more than happy to accommodate....\n\n\nMore  \n\n\n", "\nLoved the hotel. Was very accommodating for our first trip to see the STEELERS play the Colts. Nicely updated and decorated for Christmas. There were shuttles to the downtown area but we made friends at the bar and took a cab instead with them. The shuttles didn't start until 5pm and we wanted to get down there to have some...\n\n\nMore  \n\n\n", "\nThe hotel was wonderful. It was nice, clean, and quiet. The staff was awesome and friendly. I didn't get a chance to try their lunch but the breakfast was delicious. I will definitely come back to this hotel on my next visit to Pittsburgh\n", "\nMy mother, grandmother and I stayed at this hotel one weekend last summer for a wedding. The staff at the hotel, from the front desk to the bartender to the housekeeping staff, were friendly and courteous and treated us exceptionally well, and with any problems we encountered the staff went out of their way to help. The area around the...\n\n\nMore  \n\n\n", "\nThe hotel itself is pretty nice and the rooms are clean and well stocked. A nice lobby bar and reception area with a nook business center. All very functional and clean.\nHere's the rub. My wife and I were in our room and heard shouting outside in the hall. It was a Steelers-Raiders weekend so it didn't surprise me because...\n\n\nMore  \n\n\n", "\nthe room was in good condition the bed was comfortable a very nice experience.the five minute shuttle ride to the football game that takes you right down town and a short walk to the stadium. mount washington is just a few minutes away as well\n", "\nMy boyfriend and I stayed at this hotel the weekend of the Steelers/Broncos game. We got the shuttle to the casino within an hour of being there. We slept very well and the room was extraordinarily clean! We hope to stay here again next football season!\n", "\nThe hotel was clean and comfortable. The staff was friendly and helpful. It was situated near a major freeway so it wasn't hard to find or get too. We checked in super late and had a noon checkout. I got up for breakfast but it wasn't included which was a bummer and a little pricey but nice. 10/10 I would...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/07/41/19/af/crowne-plaza-pittsburgh.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "385", "title": "Holiday Inn Express & Suites Pittsburgh-South Side Hotel", "rating_string": "4.0", "address": "20 South Tenth Street, Pittsburgh, PA 15203", "review_list": ["\nMy mom and I stayed here unexpectedly for two nights because of a snowstorm. The lobby was inviting and had a cozy fireplace and public computers. The rooms were very nice, and ours had a Keurig coffee maker, microwave and fridge. The Bath and Bodyworks White Citrus toiletries smelled great, although the generic soap was a little disappoinging. The fitness...\n\n\nMore  \n\n\n", "\nGenerally prejudiced against chains so very happy to see such a clean ,bright place. Musta just been remodeled. Good free breakfast selection. Friendly front desk. Pool is good but no jacuzzi. Not much of area to walk around in..no restaurants etc. Did I mention the brightness/sunlit flooded dining area. So visually welcoming. Parking $14 but unlike other downtown hotels this...\n\n\nMore  \n\n\n", "\nIts rare that me and my wife get away without the kiddo's , so we decided to take advantage of my Birthday weekend . We had planned on spending Saturday and Sunday touring the city , Unfortunately the plan didnt go as planned mainly because of the lack of sleep me and my wife didnt get . There were a...\n\n\nMore  \n\n\n", "\nOur room was clean and so was the hotel for the most part. The staff was very friendly and accommodating. It is also reasonably priced except for the parking. Its quite high and there is honestly not enough to accommodate the entire hotel. The worst part of our stay was some of the guests being extremely loud and immature and...\n\n\nMore  \n\n\n", "\nGreat morning breakfast...free parking and free wifi. Has a shuttle if you want within 3 miles of hotel. Only down side is if you party at night expect noises in am.. Room cleaning staff a little noisy..doors closing and opening..overall great for the trip.\n", "\nMany reviews on travel sites mentioned the long wait for check in. We arrived early (3:00) and checked in promptly for our four night stay (Dec. 30 - Jan 3). Our room was directly adjacent to the front desk and elevators, but seemed to be fairly quiet. The rooms are nice. We were happy. Asked the girl at the font...\n\n\nMore  \n\n\n", "\nArrived after dark, staff was efficient, but not overly enthusiastic. Hearing the passing train whistles as we went to our room was not encouraging for a good nights rest; however the room was very quiet, could hear more of the outside noise in the hallway, than was noticeable in the room. wife loved the view of the river and bridges....\n\n\nMore  \n\n\n", "\nStayed in mid-December at the Holiday Inn Express in Pittsburgh on South 10TH Street on the South Side. Great stay! The very large king bed room was beautiful, on the upper floor with a view of the city. Got a great weekday AAA rate too. The hotel staff was very welcoming. There is also a convenient shuttle service to the...\n\n\nMore  \n\n\n", "\nMy boyfriend and I stayed here last Saturday while attending a Pens game... We figured since Holiday Inn is a large chain, and the room wasn't exactly cheap, we would have no problems but I was oh so wrong. We arrived at 630, the line to check in was wrapped around the lobby and they said no rooms were ready...\n\n\nMore  \n\n\n", "\nWhen I checked in the 2 Queen Bedroom I had booked was not available. I was offered the choice of two separate King rooms or a King with a pullout sofa. I needed two parking spaces and you only get one so I offered to take the King with a pullout if they gave me a second parking space which...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/0a/3b/18/45/hotel-exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "474", "title": "Shadyside Inn All Suites Hotel, Pittsburgh", "rating_string": "4.5", "address": "5405 Fifth Ave, Pittsburgh, PA 15232", "review_list": ["\nAnyone visiting Pittsburgh, or Allegheny County for that matter, would be well served to consider staying at the Shadyside Inn and Suites. Located in the charming neighborhood of Shadyside it's also convenient to downtown, the eastern suburbs and the north side communities. The units are clean, well appointed and fully stocked. We stayed in one of the 'Mansion Suites' which...\n\n\nMore  \n\n\n", "\nBack in early January I rented a suite for the night for a about $100. A couple days ago I rented a suite -- same basic size and location by stopping in and looking for a room. Price $200.\nIf you are planning to stay for more than a night -- maybe a week or longer it would probably be...\n\n\nMore  \n\n\n", "\nI attended Carnegie Mellon University 15 years ago and had always heard about the Shadyside Inn but never had the reason to stay there. I was delighted to finally see it for myself on a recent trip. We had a one bedroom apartment, that is almost as big as the one we live in at home. It had everything we...\n\n\nMore  \n\n\n", "\nI only stayed here one night, although I had planned to be there 3 nights. This appears to be a former apartment building that has been partially converted to a hotel. Rooms are in several different buildings. Mine had no elevator, so had to carry bags up one floor. Not a big deal in my case but could be a...\n\n\nMore  \n\n\n", "\nThis was a wonderful hotel experience. I stayed in the suite located on Kentucky Avenue. It is a house that has been converted into two suites; one upstairs and the other downstairs. It was more spacious that my first apartment. It is ideal for an extended stay. The suite was very well decorated in a modern décor. The staff was...\n\n\nMore  \n\n\n", "\nGreat location and great staff. Discounts to museums was a nice plus. Very roomy for the price, and was upgraded to two bedroom suite which wasn't really necessary. The controls for the radiator at floor level kind of inconvenient.\n", "\nThese are old apartments refurbished as hotel suites. If you need a suite and are spending some time there, it's a great deal. But, if you only need a room for a night, or a few, you can do better. First, this is a cluster of buildings, so don't unload your bags until after you check in, because you might...\n\n\nMore  \n\n\n", "\nThis is more of an apartment with hotel services than a traditional hotel. It is ideal for families, extended stays, anything where you want extra room and privacy. The staff was friendly and helpful. T he location is outstanding, along Millionaires Row in Shadyland, walking distance to Carnegie Museums, restaurants, parks, etc. The only problem we had was the noisy...\n\n\nMore  \n\n\n", "\nWe visit our son in Pittsburgh a few times a year, and recently booked at Shadyside Inn and Suites this past weekend.\nQuiet, clean and roomy the staff that greeted us hospitable. An enjoyable stay.\nThe location is good. The room was fully equipped.\n", "\nWe thoroughly enjoyed our stay here. It was very affordable, clean and staff were great. It is a very creative and stylish use of previous use buildings. It was two blocks from wonderful restaurants and great shopping. We walked to the museums and got discount tickets through the hotel. The elevator was slow but it created nice conversation with other...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/07/92/d3/e0/shadyside-inn-all-suites.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "184", "title": "Candlewood Suites - Pittsburgh Airport Hotel", "rating_string": "4.0", "address": "100 Chauvet Drive, Pittsburgh, PA 15275", "review_list": ["\nThe hotel is very far from the airport- about a 30 minute shuttle ride. The shuttle driver was very rude and didn't say a word to me, even when I said Hello or Thank You, etc. The lobby area was small and not very tidy. The room was ok. Quiet, but a bit outdated. Their selection of snacks and drinks...\n\n\nMore  \n\n\n", "\nI have just spent 6 nights here. Let me say that I travel for business combined with pleasure, I stay in hotels almost every week for 2-4 nights or more across the country so I have experienced the good, the bad & the ugly & I am picky within reason (hate dirt, mold & or stench). The room was clean...\n\n\nMore  \n\n\n", "\nAfter staying at a fantastic Candlewood on another trip, we decided to stay here the night before catching our flight out of PIT. No one was at the front desk. It was 10 minutes before the check in time and when someone finally did show up, we were told as much. They got an attitude with us for showing up...\n\n\nMore  \n\n\n", "\nThe cleanliness kept this review from being higher. I was staying here before an early morning flight out the next morning. Checkin was a breeze and the desk clerk was friendly and very personable. I arrived late in the evening and just wanted to get to sleep before my early rising in the morning. Checked the bed and everything was...\n\n\nMore  \n\n\n", "\nI have been too many hotels throughout the United States and I have to say this ranks up there is one of my favorite. This hotel is located just minutes from downtown Pittsburgh. Looking for a place to eat or shop not a problem conveniently located within minutes of the mall and 20+ restaurants in the area.\nThe staff was...\n\n\nMore  \n\n\n", "\nBed was so worn out that it sunk in middle and we couldn't roll to side. Also, tiny pillows that were size of couch pillows. Window unit was loud and freezer ice maker made about 10 ice cubes in 24 hours.\n", "\nMy boyfriend, pitbull, and I stayed at this Candlewood Suites for 2 months and could not have been happier! The room was clean, spatious, and very accommodating. Our favorite part was how amazing the staff were. Kaitlyn, at the front desk, was always happy, helpful, and professional. She also loved our dog and made her feel very welcome. There was...\n\n\nMore  \n\n\n", "\nWe got two rooms for just one night (Saturday). We came to town for a Steelers game and I searched around and this hotel had great prices compared to others in the area.\nThe rooms are great. Comfy bed, clean all around, lots of space. The only thing that I noticed was a wash cloth hanging on the shower rod...\n\n\nMore  \n\n\n", "\nI wasn't expecting much when I booked this budget hotel about 15 min away from the airport, and that was fine. I arrived at 1:30PM & the front desk clerk kindly let me check in early. My room, 231, was very nice! The furnishings were pleasant & the bed was very comfortable. The free wi-fi worked very well, much better,...\n\n\nMore  \n\n\n", "\nFriendly staff, dog friendly, close to airport, long term renters, big laundry facility, clean room. Deal breaking issues for short term renter: No free breakfast, gym, pantry, laundry all in same room. Free coffee is to close to the tread mill.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/0a/3b/41/e7/hotel-exterior.jpg"}]
[{"category": "hotel", "review_count": "285", "title": "Red Roof PLUS+ Pittsburgh South Airport Hotel", "rating_string": "4.0", "address": "6404 Steubenville Pike, Pittsburgh, PA 15205", "review_list": ["\nMy wife, dog and I stayed at this motel recently on our way back home from vacation. We had stayed here before and we were not disappointed on our return.\nThe room was clean, updated and included a micro fridge, which was a convenient bonus. Although the motel appeared to be full, it was very quiet.\nIt is well worth...\n\n\nMore  \n\n\n", "\nOnly had a one night stay on a college visit. Check in was quick and easy. Decent size room, plenty of space for myself and my son. Room was clean. I would stay there again if I were in the area. People working the front desk were friendly and helpful.\n", "\nIt was our first time in Pittsburgh. The rooms were clean and well kept, and both maintenance man mike and cleaning staff cindy were very friendly and helpful in our need/wants from the hotel but also helped us to find our way around the city\n", "\nI tend to stay in nicer hotels, but am not very picky, and was in extenuating circumstances so went with the Red Roof Inn give the price - wouldn't do it again. I was in Pittsburgh for the weekend and unfortunately given snow on the East Coast my flight was cancelled (twice). I was at the airport at 6pm and...\n\n\nMore  \n\n\n", "\nWow! Such great staff! Cindy Mike Brian and Lindale were fantastic. Any need was happily taken care off! And so pleasant on Xmas eve! Highly recommend! Clean rooms and they treated you like family! :) :) :) :)\n", "\nWe arrived late from Ohio, were treated very kindly by Phyllis at the front desk, had a courteous shuttle driver take us to the airport the next morning. On our return, the shuttle arrived at the airport in a timely fashion and returned us to our vehicle.\n", "\nmaintenance man mike was terrific. went out of his way at my every request. I can't say enough . between mike and the cleaning staff cindy and linda . my stay was a very pleasant. I will make this red roof inn my place to stay when I come to Pittsburgh . thanks again joe mccullough\n", "\nThe motel has outside doors on the ground floor and inside doors on the second floor. (Stairs, he elevator) The motel has a few aged parts that need an upgrade but ultimately not bad and still functional. The desk workers were friendly and quick at their job. The maintenance and cleaning workers seemed friendly.\nThere is a restaurant in the...\n\n\nMore  \n\n\n", "\nThis is our second time con ng up here to this specific red roof inn. They are very consistent with pricing and service. They offer military discounts and friendly staff. Conveniently located near the airport, mall, walmart, target etc. We will go back if we need a place to stay.\n", "\nWe were displaced due to a fire and the entire staff and GM Tony were excellent to my family during our extended stay with them. The room was clean and very convenient to many restaurants in the area.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/09/aa/da/64/exterior.jpg"}]
[{"category": "hotel", "review_count": "1415", "title": "Wyndham Pittsburgh University Center Hotel", "rating_string": "4.0", "address": "100 Lytton Avenue, Pittsburgh, PA 15213", "review_list": ["\nOverall stay was very good. Staff was very friendly. Room and restaurant options were as equally as good\n", "\nMy brother and I have to go to Pitts every few months so I can see my doctors at UPMC. And it's nothing but joy to see the people of Wyndham as we come through the doors. Ms. Stacy at the front desk is like a family member now. And in the restaurant Marcus and Donald at dinner were great....\n\n\nMore  \n\n\n", "\nI shared my room with my son, so of course we used both beds in the Double Queen bed room.\nTo my dismay, when we returned from a long day out, one bed was not made, only 1 cup was replaced in the bathroom, and there were no teabags to replace the ones that we had used.\n", "\nWas There In Mid October 2015 For Steelers Cardinals Game Nice Room No Microware Oven Hard 2 Feed A 7 Year When He Wants Mac and Cheese Nice Restaurant Downstairs Food Was Ok Drinks At Bar Was Good Very Friendly Staff Beware Of Parking 25.00 Per Day Better Off On Side Street U Will Just Need Coins\n", "\nRooms and entire hotel very clean. Beds were very comfortable. Restaurant was delicious. So convenient to Pitt.\n", "\nMy stay was excellent. I appreciated the free shuttle within 3 miles of the hotel; I found this very helpful. I stayed here my first night dropping my son off at the University and decided to stay here my last night as well, as it was so easy, convenient, and comfortable.\n", "\nI stayed 3 nights in two double bed room on 7th floor. my room was spacious, clean, and comfortable. But there was no refrigerator and minibar in the room , that was little inconvenient though.\nThe best part was kindness of one of hotel restaurant manager whose name is Ms. Gloria Dearoff. we had to check out at 5:30 am...\n\n\nMore  \n\n\n", "\nMy husband and I stayed at the Wyndham pittsburgh university center hotel on Lytton avenue on 9/3/2015. We checked in After midnight and without a reservation after a very stressful day at the hospital. The front desk attendant, Nicole, was extremely kind and went out of her way to make us comfortable. I cannot explain how much that meant to...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/oyster/980/09/f1/3f/f8/street--v10389733.jpg"}]
[{"category": "hotel", "review_count": "599", "title": "Hampton Inn Pittsburgh University/Medical Center Hotel", "rating_string": "4.0", "address": "3315 Hamlet St., Pittsburgh, PA 15213", "review_list": ["\nIf you need convenient access to UPMC this place will work. If you are looking for a terrific place to stay, this place falls a little short. It's not bad, but nothing special. It's a little far (not with in walking distance) away from any decent restaurants.\n", "\nThe Queen rooms are very small. Could hardly turn around in the shower. The bed was the most uncomfortable I have been in and usually stay in a hotel on average weekly. While \"refurbished\" the TV and desk are nice and new but the basics of room size, bed quality and room in bathroom were terrible.\n", "\nI stay in Pittsburgh often, but this is the first time I have stayed at this particular property. A couple of things to note: the property is a slight ways away from downtown; however, they have a shuttle that will take you close enough. The hotel is undergoing renovations but I was never inconvenienced by sound, dust, etc. While the...\n\n\nMore  \n\n\n", "\nThe lobby and elevator were filthy. The room was less than clean. The staff was incompetent. But it was close to everything we wanted to do in Pittsburgh. I would not choose to stay here again, although I have had good experiences with Hampton Inns in the past.\n", "\nThis was our second time here. Although it is a good value, has a good breakfast, and is a clean place to stay, I was a little disappointed. At one time, I went down to talk to the front desk clerk, and no one was there. The handwritten sign said something like: \"Making deliveries. Will be back soon.\" Why would...\n\n\nMore  \n\n\n", "\nI've stayed here a few times and always been impressed.\n- The hotel is walking distance to UPMC hospitals but a shuttle is available if needed.\n- They discount parking for hospital guests and don't mind if you leave your car at the hotel during the day after you check out.\n- The rooms are newly renovated with a fridge...\n\n\nMore  \n\n\n", "\nWe were recently in Pittsburgh for my daughter's audition at Carnegie Mellon. We had a long drive and were quite stressed in general, but we were welcomed warmly at the front desk. The clerk was very friendly and helpful with dinner recommendations, shuttle info, etc.\nThe room was nice and clean. Typical Hampton Room. Comfy beds!\nThe complimentary breakfast was...\n\n\nMore  \n\n\n", "\nWe were in PGH for an appointment with a physician and stayed overnight the night beforehand. The weather ha turned sour, frightfully cold, and we were thankful we took the extra time into the city. Not being familiar to the area of University Center, the staff told us via phone how to get to the hotel the easiest method, since...\n\n\nMore  \n\n\n", "\nOnce again a fabulous stay at a great hotel. Front desk staff was terrific. Breakfast was great with a good variety of options. Room was clean and comfortable. Price was fantastic. This is our go-to hotel when staying in the Pitt area.\n", "\nThe hotel's rooms are worn down. The staff at the check-in initially gave me the key to someone else's room, I guess they are tired too. The hotel is on the outskirts of the University Business District but it charges $14.00 per night for parking which I found to be way above a reasonable price. The heater was noisy and...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/09/55/7e/15/medical-center.jpg"}]
[{"category": "hotel", "review_count": "598", "title": "Hilton Garden Inn Pittsburgh University Place Hotel", "rating_string": "4.0", "address": "3454 Forbes Avenue, Pittsburgh, PA 15213 (Formerly Wyndham Pittsburgh University Place)", "review_list": ["\nThe hotel was right next to the hospital where my daughter just had a baby. Nothing special about this hotel. Not one of those places that provides breakfast but does have a dining room, which looked nice but was a bit more expensive than we could spend on breakfast. The location was splendid. Walked to restaurants and museum between visits...\n\n\nMore  \n\n\n", "\nNice clean accommodations, friendly staff, excellent breakfast but dinner is bad..stayed here a dozen times, eat out for dinner. Limited choices and is frequently just average at best from a quality perspective.\n", "\nNice clean hotel. Breakfast is terrific. Everything fresh. Close to University of Pittsburgh and many places to eat and drink. Easy to get to from the highway. Would absolutely stay at the Hilton Garden Inn again.\n", "\nThe Pittsburgh Hilton Garden Inn is very inconvenient with respect to your vehicle access. The only parking available is valet and it's $18/day. The room we had was two queen beds, which were quite hard. The pillows were not comfortable. The room was too small for the furniture. The bathroom did not have a vent fan to remove the steam....\n\n\nMore  \n\n\n", "\nWe chose this hotel for its convenience to my husband's doctor's office. From the time I contacted the hotel for a reservation, to checking out, the staff took every opportunity to make our stay special. The woman who took my phone reservation offered me the \"UPMC\" rate and waived the $18 daily valet parking fee, At check-in, I saw my...\n\n\nMore  \n\n\n", "\nRight in the city downtown\nVery welcoming and convenient\nAll the amenities and snack shop\nFree coffee in the lobby\nBeds were comfortable\nValet pArking\nWalking to bars & restaurants\nOnsite restaurant\nClose to university and historical sites\nRoom had a microwave refrigerator and coffee maker\n", "\nStayed here for a couple nights while doing business at UPMC. Very convenient location with a shuttle. Valet parking only. Staff are very nice, helpful, and have good follow-up. Restaurant and bar on-site - inconsistent service but good food. Clean, quiet, safe. Would stay here again.\n", "\nLove the location for visiting my daughter in Lothrop Hall at PITT. Nice to have the fridge and microwave, as we did visit several restaurants in the area. Convenient if you are taking the bus in from the airport. Bus stops right by the hotel. If driving, valet is $18 a day, with in and out privileges. Love the fruit...\n\n\nMore  \n\n\n", "\nThis hotel was very comfortable and had excellent staff. Diane and Molly were very friendly and helpful and added a personal touch asking about our trip and our interviews and helped us out a lot. Would definitely recommend this place!\n", "\nWe were in Pittsburgh for my mother-in-laws funeral. All of her adult children and their families stayed at the Hilton Garden Inn which was just 2.5 miles from the church. We appreciated being able to gather in the bar and restaurant between meals and events. It was like having a home away from home. The staff was very accommodating of...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-p/0a/3c/84/cc/exterior-at-night.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "140", "title": "Holiday Inn Express Hotel & Suites Pittsburgh West", "rating_string": "4.0", "address": "875 Greentree Road, Pittsburgh, PA 15220 (Formerly BEST WESTERN Parkway Center Inn)", "review_list": ["\nWe stayed one night here as we travelled through on our way home. The hotel was clean, staff was helpful and we enjoyed a nice breakfast before we left. It was close to a nice restaurant so we could walk.\n", "\nWe stayed here after the Pittsburgh / Denver game. The only thing that sucked was that we weren't able to check in early. The front desk staff did assure us that we would have a room once we got back from the game. We only stayed here overnight so didn't get to use any of the amenities. From check in...\n\n\nMore  \n\n\n", "\nThe staff went above and beyond to meet our needs. the rooms were clean, comfortable and quiet.\nThe shuttle service into Consol Energy Center for the Bruce Springsteen show was very convenient. Although they normally stop shuttle service at 11:00 they extended it after the concert until all hotel guest had been picked up (which was quite a few). Thank...\n\n\nMore  \n\n\n", "\nMy husband and I stayed at this hotel for a three-day getaway in Pittsburgh. The hotel is right near the highway, but not so close that you hear the traffic in your room. Because of this, downtown Pittsburgh is only ten or fifteen minutes away in weekend traffic. The staff, especially the housekeeping staff, were cheerful and helpful without being...\n\n\nMore  \n\n\n", "\nThis hotel was great. I was a little worried about some of the reviews I saw on this hotel but it was a great price and and equally great location to the city. If you are used to a 5 star hotel than this is not your hotel. If you are looking for a clean, friendly staff and with many...\n\n\nMore  \n\n\n", "\nAverage location but excellent front desk customer service and a great shuttle service to the local eating spots. Was there on a rainy night without a vehicle and the shuttle saved my evening. Nice place nice service would stay there again. Thanks\n", "\nThe suite i stayed at had a kitchenette and 2 rooms. The kitchenette had 3 chairs to sit at and eat, drink and discuss business. The rooms were clean, up to date, each had a TV, their own temperature control. The bathroom was large and modern. The bed, couch and chairs were comfortable.\n", "\nBooked based on my Rewards Points, needed a close place to stay because my husband was preaching in the city. I was confident because Trip Advisor reviews were good.\nBooked 2 rooms 1 for us, 1 for mom. We were placed in 505 and 515.\nCheck in about 8:00pm. The King rooms were small but appeared so I can happy....\n\n\nMore  \n\n\n", "\nStayed 10/29-10/31/15 the location is in a great location to downtown. The staff were friendly and accommodating. They were ready when we arrived and assigned all 5 rooms on the same floor. There was fresh coffee and fruits at no charge. The rooms are much better than the pictures. The pictures must be old because the rooms were updated the...\n\n\nMore  \n\n\n", "\nI stayed here 5 years ago when it was Best Western and had a nice stay. When I walked in and saw how beautiful it was I only could say WOW! everything was so fresh and new. The breakfast was good, fresh hot and Vicki did a get job keeping everything full and tables and food area clean. When we...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/0a/3c/81/2d/sunlit-all-season-indoor.jpg"}]
[{"category": "hotel", "review_count": "360", "title": "Courtyard Pittsburgh Downtown Hotel", "rating_string": "4.0", "address": "945 Penn Avenue, Pittsburgh, PA 15222", "review_list": ["\nI spent the night at the Courtyard Pittsburgh Downtown. The hotel is exactly what you would expect from a new Courtyard in a downtown setting. It is easy to find with convenient valet service. There is self-park if you want, but I used the valet. It's really the only Marriott property in downtown because the Marriott hotel sits up where...\n\n\nMore  \n\n\n", "\nAdjacent to the convention center and right in the mix of downtown. Short walk to the waterfront. Super friendly staff. Starbucks and breakfast available downstairs. Valet parking if you choose, or go down the street a block and park in a garage for 6 dollars a day. Great price and gray location. Would stay here ever time we come to...\n\n\nMore  \n\n\n", "\nI recently stayed at the Downtown Courtyard for a quick one night business trip. The downtown location was very convenient and even though our meeting was close the shuttle took us to our meeting so we didn't have to walk in the rain. Another good, solid Courtyard option.\n", "\nVisited for a convention at the convention center. This hotel was located, basically across the street with valet parking - so it was perfect. Rooms were lofty, clean, comfy. Cafe and snack area were very nice. Located near to good restaurants and coffee shops.\n", "\nThis hotel is great! It's my 3rd time staying here and as always, the room was nice and clean, it has a fridge for late night snacks, and the staff is courteous and knowledgeable about cool things to do nearby. It's perfect for a Steeler's Game since you can walk to Heinz Field. Great shops surround the hotel and Market...\n\n\nMore  \n\n\n", "\nyou're forced to use valet service to park your car here and the parking guys are obnoxious. they act like you're imposing on them when you need to get your car out, and I know for a fact they rummaged through my personal things in my vehicle.\nI will never stay here again.\n", "\nGood price for a hotel downtown. Very clean, very quiet. Literally right next to the convention center. Just blocks from Amtrak station, a few bus stops. The back view of the hotel is the convention center--in other words no view at all. The bistro downstairs offers trendy breakfast meals (parfait, a few pastries, fancy combo meals). Not really a kid-friendly...\n\n\nMore  \n\n\n", "\nOverall we'd recommend this hotel because of the service and convenient downtown location. This hotel was a perfect location for us - right in the cultural (theater) district and a 15-minute walk to the Strip District, ball fields, and even shorter walk to Market Square. On the positives, service was very friendly, the room was a decent size with mini-fridge,...\n\n\nMore  \n\n\n", "\nNicely located, easy walking distance to Heinz Field, and to local restaurants and bars. Room was nice and the food at the counter was as expected. Nothing incredible, but basic breakfast options. Only issue was that although the cleaning service straightened up a little in the living area, the bathroom did not look like it was touched. It was on...\n\n\nMore  \n\n\n", "\nThis Courtyard is a pleasant upscale from the normal everyday businessman's Courtyard. Starting with the Valet and Front Desk Staff the experience feels more like a full Marriott than a Courtyard. Very good value for a downtown hotel. Easy walk to numerous restaurants and Heinz Field or PNC Park.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/0a/2e/6d/a6/king-suite.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "369", "title": "Hampton Inn Pittsburgh - Mcknight Rd. Hotel", "rating_string": "4.0", "address": "4575 McKnight Road, Pittsburgh, PA 15237", "review_list": ["\nAverage hotel if you just need a place to rest your head, and that worked for us. Room was clean. Breakfast OK. Staff was always friendly. Location was outside of Pittsburgh and a little difficult to get into/out of since it's right on a highway. Close to several restaurants and shopping malls on McKnight Rd.\n", "\nWas perfect for individual business travel. Comfortable rooms with a nice desk and lighting arrangement. Though they weren't large rooms they felt spacious. Nice bathrooms. Fitness room recently remodeled and with all new equipment. Three treadmills, stationary and recumbent bikes and a cardio glider and dumbells. Plenty of room. pool was down for complete refurbishing and will be really nice...\n\n\nMore  \n\n\n", "\nStayed here one night. I had never stayed here before. Check in was fast and friendly.\nI pre checked in and from my phone picked room 223. Everything in the room was fine. Clean and your usual Hampton Inn room. That is where it ended. One o'clock in the morning I heard a loud screeching sound. I could not believe...\n\n\nMore  \n\n\n", "\nWe are a fan of the Hampton brand, but not this hotel. We reserved the king suite with whirlpool to rbing in a romantic New Year and were disappointed. To begin, the suite had a bad odor and the furniture was very dated. We were very excited about the room bc of the whirlpool, but felt a bit deceived as...\n\n\nMore  \n\n\n", "\nClean, quiet and comfortable. Fridge froze all our drinks overnight, but too cold is better than too warm. Whirlpool jets weren't that powerful, but better than nothing. Free breakfast sucked, but what do you want for free? You want a good breakfast- then you go and pay $10-$15 somewhere and get it\n", "\nWe stay here a lot and have always found it a good place to stay. The room is clean, spacious and well appointed. On this stay, however, the group across the hall were up almost all night partying and slamming the doors. We finally had to confront them to get them to shut up. The doors are a problem here...\n\n\nMore  \n\n\n", "\nThe rooms were nice and quiet. The beds were comfortable and well appointed. I should have asked for an extra towel to wrap my hair with after my shower. The internet access easy and free. The complimentary breakfast had a good variety of hot and cold items. It was very convenient to restaurants and other businesses.\n", "\nWe recently booked two nights at Hampton Inn in Pittsburgh....on McKnight road. We like Hampton Inn's because they are predictably good. This one however; was not up to the usual good Hampton standard. We booked one of the only available rooms....double beds. Not queen...but doubles. Ok..so we are spoiled and usually get the king but they were not available so...\n\n\nMore  \n\n\n", "\nTo begin with, this hotel is on McKnight Road where the road is physically divided, so you can only enter from one direction. If you are coming form the other way, you need to go a half mile past and turn into some other parking lot.\nI booked a king bed online and was told upon arrival that they only...\n\n\nMore  \n\n\n", "\nFirst time ever to stay at a Hampton Inn and very good experience. Staff always available and helpful, clean rooms and comfortable bed. Hotel quick access to highway and easy to find. Great value for the price. Will stay again when back in Pittsburgh.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/08/32/d1/6e/hampton-inn-pittsburgh.jpg"}]
[{"category": "hotel", "review_count": "286", "title": "SpringHill Suites Pittsburgh Bakery Square Hotel", "rating_string": "4.5", "address": "134 Bakery Square Blvd, Pittsburgh, PA 15206", "review_list": ["\nMy daughter and I stayed on Jan. 25, 2016. We were greeted by a very helpful front desk clerk who helped us with dining options. The hotel has a shuttle service to anywhere in a 3 mile radius of the hotel. It was extremely convenient for dinner and our trip to the hospital the next day. Shuttle drivers were pleasant...\n\n\nMore  \n\n\n", "\nThe hotel was modern and clean. The breakfast was good, and all staff members were very nice, Lavern was particularly pleasant. The hotel pool was lap sized, and some what of a disappointment, but free use of the adjacent LA Fitness more than made up for the hotel pool. The parking garage was convenient with unlimited in and out for...\n\n\nMore  \n\n\n", "\nThis hotel is camouflaged and hidden within the Bakery Square area of Pittsburgh. It is clean, modern and a nice mix of comfort and business convenience. There is no gym, but they do give you free passes to LA Fitness next door. Parking is adjacent in a connected garage. The Wi-Fi signal was strong throughout and free.\n", "\nNo frills but it was very clean and quiet. Breakfast was very good and the staff were very pleasant. I was disappointed that the pool was not opened as I thought it would be a great way to entertain children staying from out of state for a wedding.\n", "\nI've stayed here twice--once solo for work and once with family for a wedding--and each time it has been a pleasure. The rooms are spacious and immaculate, the beds are comfortable and luxurious, the desk area is perfectly suited for getting good work done, and the bathrooms are great as well. The little convenience store in the lobby is a...\n\n\nMore  \n\n\n", "\nThis was a very nice hotel. The only complaint I have is that they gave my a handicap accessible room when I did not request one. This is not something that is a big deal but I would prefer to simply have a standard room.\nThe breakfast was very good! there were numerous options and the area where you eat...\n\n\nMore  \n\n\n", "\nI want to say that this place is in a wonderful area. It is very clean and of course I haven't eaten the breakfast in the morning I did have a couple of wines. All was well with everything just working overtime as in overcast with no sleep. When one of the mornings came around a coworker calls me to...\n\n\nMore  \n\n\n", "\n...in a nice surrounding. Rooms are really spacious with bathroom and extra toilette and couch. Indoor pool available but quite small. Clean, modern design, good choice of breakfast but only plastic 'dishes and tools'. Fitnesscenter directly connected...convenient parking. Very friendly staff and 24/7 open small shop for snacks and stuff.\n", "\nWe loved this hotel. It's in a great location. It's also beautifully decorated. The colors and the lines in the hotel were wonderful!. This hotel has a very hip modern vibe. We were going to a function at the Pittsburgh Zoo and we were thrilled to take the complimentary shuttle to and from the hotel. I would definitely recommend this...\n\n\nMore  \n\n\n", "\nStayed here for a Steeler game. East liberty is getting to be such a nice area. Took a cab to game cost around 22.00 each way but didn't have to worry about parking etc. Rooms nice . They had a nice breakfast bar in the morning.\n"], "img_url": "https://static.tacdn.com/img2/x.gif", "class": "3.0"}]
[{"category": "hotel", "review_count": "247", "title": "Residence Inn Pittsburgh University/Medical Center Hotel", "rating_string": "3.5", "address": "3896 Bigelow Boulevard, Pittsburgh, PA 15213", "review_list": ["\nStayed 2 nights for business recently. Initial check in was OK. Check in woman was polite enough, but not a great welcome. No acknowledgement of Gold Marriott status...always a bit squeamish about mentioning that because it insinuates a snobbish customer attitude, which is not the case. But I do believe ALL Marriott properties should mention a customer's loyalty. Customer's do...\n\n\nMore  \n\n\n", "\nMy daughter had brain surgery at UPMC Presbyterian Hospital on 12/1/15. We got to the hotel very late on 11/29/15 and the front desk people were very nice in getting us into a very nice room in just a few minutes. The next morning the staff was very helpful in giving directions to the neurosurgeon office for a pre-op appointment....\n\n\nMore  \n\n\n", "\nBe aware there are 2 sets of elevators-one to the garage and lobby, the other from the lobby to the floors. Check in and parking was easy. Love the new Marriot mobile app! The room was nice, view of the cathedral of learning. The hot tub, unfortunately, was closed for maintenance and the pool was murky. Yuck! Location is good,...\n\n\nMore  \n\n\n", "\nWe had surgery scheduled for my daughter and needed a place close by the main Children's Hospital in Pittsburgh, Lawrenceville. This hotel was about 5 minutes away and would definitely stay here again. Our room was spacious, clean, comfortable and quiet. We had a studio with a queen bed, mini kitchenette, pull out sofa and room to lounge. The amenities...\n\n\nMore  \n\n\n", "\nI do not understand why this property has been ranked low on Tripadvisor. After reading previous reviews and ranking, my expectations were not high. But it turned out to be a very pleasant stay.\nI was in town for an event at CMU and decided to give this place a try for one night based on promotional rate that they...\n\n\nMore  \n\n\n", "\nInteresting public spaces at this hotel: lower lobby for entrance off the street; spacious check-in/breakfast lounge (reached by elevator); outdoor seating area with a city-park feel. Very friendly staff. I appreciated the hot soup available on the cold evening. A smile came across my face when I opened the door - the room layout makes for spacious, comfortable living!\nThe...\n\n\nMore  \n\n\n", "\nLocated on a hillside a fair distance from UPMC, nothing close by in terms of restaurants etc. Rooms were very large suites with kitchens. No bar or restaurant in hotel, breakfast was included and fairly decent selection.\nGym was reasonable as well as pool on site.\n", "\nCheck-in, the very large room (which was more of a suite), and the wifi were fine. There was a nicely sized refrigerator in the room. The breakfast downstairs was the usual. The hotel also provided a late check-out (2 pm), which was extremely helpful\n", "\nGave my seminar this week on life and health insurance at this property as well as stayed overnight 3 nights as well. Rooms are clean, quiet and very comfortable. Full kitchen, a feeling of being in an apartment and not a hotel. The staff especially at the front desk are warm friendly and willing to please and accommodate . Highly...\n\n\nMore  \n\n\n", "\nOur third stay at this nice Marriott location and it has been good as always.\nMy Stay: 4 nights from Oct 17th 2015\nRoom: 610 - HUGE, 2 Queen Bd Rooms separated by a living room with sofa bed, full kitchen, large fridge and freezer 2 full bathrooms. Perfect for families - Rate $179/night for 3 people; Charges $15 a...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/0a/3a/85/b2/exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "632", "title": "Hyatt Place Pittsburgh-North Shore Hotel", "rating_string": "4.0", "address": "260 North Shore Drive, Pittsburgh, PA 15212", "review_list": ["\nMy name is Sara Gargino, my family and I recently stayed at your hotel and the following morning we woke up a little late and came down for breakfast. When we got to the dining area we noticed that breakfast was already being put away as it was after 9:30. One of your employees, Brandon, was very nice to my...\n\n\nMore  \n\n\n", "\nMy boyfriend and I stayed at this hotel for one night for a concert at the Consol Center. We originally were planning on taking an Uber from the hotel to the concert, as we were unaware of the public train. Upon check in, we were made aware of the free train that is directly behind the hotel parking lot that...\n\n\nMore  \n\n\n", "\nThe room was great and the hotel staff went out of their way to help any way they could. I stayed four days and got a great rate on the room. Several days I had to stay in my room and ordered food. The food was great and saved me a lot of time instead of going out. I highly...\n\n\nMore  \n\n\n", "\nWe stayed at the hotel for 1 night on the weekend. The room was spacious and clean. The bed was comfortable. Check-in was smooth and the employees were friendly and helpful. Shuttle was readily available to take us to local attractions. Overall we had a great experience and would definitely recommend this hotel to others.\n", "\nThe rooms were fairly nice, and it was clear that the hotel was newer. One odd thing, was that there is one tv in the room, which is somewhat difficult to see if your in the bedroom, and the remotes totally suck (that was a topic of conversation with some of my fellow travel companions about their rooms also).\nI...\n\n\nMore  \n\n\n", "\nMy husband and I stayed at this hotel for 1 night. We were in town for a concert at Stage AE. We were within walking distance of many restaurants as well as PNC Park and Heinz Field. Check-in was quick and easy. Our room was on 5th floor with a view of the parking lot and highway above us. The...\n\n\nMore  \n\n\n", "\nWe will absolutely stay here the next time we're in the Pittsburgh area (and told a handful of other families we were traveling with who were staying somewhere else that they should stay there next time, too). Every staff member we met was cordial and polite, to the point where everyone in the group commented about how everyone was so...\n\n\nMore  \n\n\n", "\nIf you're accustomed to Hyatt Place's this one will not disappoint. Free breakfast and some great views of the city. If you are going to an event at PNC Park or Heinz Field this is the place to stay. Hotel was extremely clean and staff was very courteous\n"], "img_url": "https://static.tacdn.com/img2/x.gif", "class": "3.0"}]
[{"category": "hotel", "review_count": "209", "title": "Holiday Inn Express Hotel & Suites Pittsburgh Airport", "rating_string": "4.0", "address": "5311 Campbells Run Road, Pittsburgh, PA 15205 (Formerly Country Inn)", "review_list": ["\nWe stayed at this hotel December 30 before for a flight on New years eve.I wish, I could remember his name but the guy at the front desk was awesome. He really need to be giving a raise or something ! I was not the only impressed one with his service, another guest outside was talking about how kind he...\n\n\nMore  \n\n\n", "\nStayed one night on January 27. Umang at the front desk was friendly and efficient. Very welcoming. John the shuttle driver was great also. A real character (in a good way)!\nComplimentary breakfast was a plus. Comfortable beds.\n", "\nI have stayed here on several different occasions and loved it every time. Plenty of amenities and close to everything. Downtown is a minute drive. Will stay again very soon. Malls and shopping center are very close and that made me super happy.\n", "\nStayed at this hotel the night before a Steelers Football game. The rooms were clean and comfy. The best part is the entire staff had on some type of Steelers clothing the next morning at breakfast. Really got us ready for the game. Breakfast had plenty of options and hotel is close to Heinz Field.\n", "\nThis is the second time we have stayed at this hotel. We usually book a suite and both times the rooms have been very clean. Staff are friendly and prompt if we needed anything. The hotel is close to many areas to shop and eat as well as an easy drive to both the airport or downtown Pittsburgh. Will definitely...\n\n\nMore  \n\n\n", "\nWe have stayed here several times now, and each visit has been a positive experience. Rooms are very clean and quiet. Even the rooms on the back side of the hotel by the highway are quiet and the room darkening curtains keep the early morning sun out very nicely. Location is great -- it's just a quick ride down the...\n\n\nMore  \n\n\n", "\nEverything seemed clean and convenient. Breakfast was ready early for a large group leaving in the morning. Free coffee, tea, and hot chocolate available all day. Nice lounge/breakfast area with fireplace. Room for improvement: Caulking work on the bathroom sink looked completely incompetent and should have been replaced before that room was ever used. Just a big cosmetic flaw.\n", "\nI stayed here with my husband and young child after a holiday party. We checked in a little late but the desk clerk was quick to find our reservation, happy and friendly. The beds were extremely comfortable - I stayed in three different hotels this month and this bed was definitely the best. Breakfast was good, but the only complaint...\n\n\nMore  \n\n\n", "\nThis is a large, square-shaped hotel, so it is a long walk around the property. It is clean well-appointed, and is near restaurants. The breakfast is good, all the standard-fare that you get at an \"Express\" location. This is right off the highway, so you may want to stay on the side away from the busy highway if you do...\n\n\nMore  \n\n\n", "\nStopped by for the night awaiting a flight in the morning back to Chicago. Hotel was very clean, staff was nicer and more attentive than I have seen in a Holiday Inn for quite some time. Front Desk people were very friendly and helpful in many ways. Needed minor assistance on a very small item and the Assistant GM was...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/06/fb/56/6d/welcome-to-the-holiday.jpg"}]
[{"category": "hotel", "review_count": "204", "title": "Courtyard by Marriott Pittsburgh Shadyside Hotel", "rating_string": "4.0", "address": "5308 Liberty Avenue, Pittsburgh, PA 15224", "review_list": ["\nRoom was really clean, well appointed. Loved the little pull out table, in addition to the refrigerator. Bed was super comfortable. Nicely appointed room. Starbucks coffee and good food made the mornings and dinner time hassle free. Within walking distance of several restaurants. Close to the major roads and freeways as well. Staff were uber friendly, attentive and went out...\n\n\nMore  \n\n\n", "\nBeen there over night twice in 2 weeks...The front desk folks are awesome helpful..cleaning crew housekeeping friendly engaging polite.. Alice serves a nice breakfast starts your day.....PLUS clean workable gym ..pool and whirlpool..awesome workout watching the snow outside wall to wall windows in gym and pool real cool////\n", "\nNice hotel, nothing extraordinary and nothing bad to say either. If you're looking for clean, solid hotel, this is a good choice. Note: deep in PIT, so a bit of a hike from the airport, and only valet parking at the hotel. but their local shuttle is legit - took us to a local restaurant quickly.\n", "\nThis seems to be the hotel that my sons' teams book when playing hockey in Pittsburgh although not real close to the rinks.\nValue: above average but due to space constraints (it's a city hotel folks)you are going to pay for parking whether you valet or not so just let the valets do their job and remember to call ahead...\n\n\nMore  \n\n\n", "\nAccommodations: 1/5\nHotel Customer Service: 2/5\nValue for money: 1/5\nOwnership: 1/5\nShuttle Service: 5/5\nI am Marriott Gold so I was upgraded to a top floor jacuzzi room. I travel a lot and spend a lot of nights in various hotels at different price points. Therefore, it is fair to say you expect different quality when staying at a...\n\n\nMore  \n\n\n", "\nI travel to Pittsburgh twice a month, and appreciate consistency and predictability, and this Marriott Courtyard offers just that. Staff is pleasant, rates are reasonable, a healthy breakfast is on-site, numerous restaurants are in walking distance, and the hotel is well located in downtown Pittsburgh. Thumbs up.\n", "\nThis is a really great location and hotel! The staff is really nice too. I love the Starbucks located practically in the hotel too! The lobby and the rooms are very clean. Valet is the only option for parking but that's probably a good thing downtown. I highly recommend this location!\n", "\nThe staff is excellent here. Very friendly and attentive. So, it's hard to leave a negative review, but..\nFirst, parking. They charge for parking at close to $20 a day (that includes tax). Parking is premium in Shadyside, but already paying one of higher rates for a hotel in the area, to tack on parking, when there are no other...\n\n\nMore  \n\n\n", "\nWe chose to stay at the Courtyard rather than drive home ( we are local to Pittsburgh) after a night of Halloween fun on Ellsworth Ave\nEverything went as panned. Good service from all hotel staff\nWe will definitely stay there again for our next event in Shady Side area\n", "\nOn the second floor, reasonably quiet. Great location. Desk personnel not too helpful about getting around town. Room was very clean and neat, looks to be recently renovated. Great location for our purposes.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/0a/39/0a/bf/exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "119", "title": "Comfort Inn Hotel, Pittsburgh", "rating_string": "4.0", "address": "4607 McKnight Road, off I-279 Exit 4/McKnight Road, Pittsburgh, PA 15237", "review_list": ["\nOur room with a king bed was small but cozy. Most importantly, the room was very clean. Staff friendly. There is some parking under the building, which is great if you can get one of these spots when it's snowing. It had snowed overnight during our stay and we did not have to clear the car. Nice bonus!\n", "\nClean room and helpful staff. Stephanie made sure we had the right room. Kennedy greeted us warmly and made sure we have a great breakfast. We stayed in the suite which was well furnished and clean. There was a minor problem that was quickly corrected and without asking for it we were compensated for the problem. They even made sure...\n\n\nMore  \n\n\n", "\nThe staff was extremely pleasant and helpful. The hotel was clean and the breakfast was good. It was a good experience. We would likely stay there if we made another trip to Pittsburgh. Very convenient to many places.\n", "\nWhat a pleasant place to stay in Pittsburgh. We have stayed here before on several occasions and each time the staff are exceedingly helpful, pleasant and down to earth nice people. From the desk clerks to the kitchen staff and the housekeepers you have never met such nice people. Hats off to you all. We feel like family when we...\n\n\nMore  \n\n\n", "\nOur room was a little small but clean and comfortable. Breakfast gave you the option of waffles, eggs and with bacon/sausage, muffins, bagels, breads, yogurt. Upon check in we were surprised when we were informed that we were the \"Guest of the Day\", we were given a bag of snacks and a water bottle.The staff is what really set this...\n\n\nMore  \n\n\n", "\nWe found the room to be smaller than most other hotels we had stayed in but they was not a negative in any way. The staff was incredible and friendly. Our room was clean and fresh when we checked in and it was kept that way daily. We had to be at the hospital at 5:30 and asked if we...\n\n\nMore  \n\n\n", "\nRoom was not spacious, but was comfortable, quiet, clean, with efficient climate control. Exiting parking lot a bit tricky, one-way onto a 4-lane highway, but easy to navigate. Hotel staff friendly and helpful -- the strongest point of a nice two-day stay. Easy access to downtown in one direction, and to upscale shopping mall and restaurants in the other direction.\n", "\nNew hotel, very clean. Not a very convenient location for my needs, but a great stay. Love the sliding doors and the covered parking. The evening/early night on duty person is great and friendly. The late, late night staff, not so much. I've stayed there 3 times so far and my only issue has been the extra charge for leaving...\n\n\nMore  \n\n\n", "\nI was seeing a concert and this was just a stay over trip. A very tiny parking lot and lobby, but the room was as expected and a good price. I didn't get a chance to do the breakfast or anything beyond driving back and forth to the concert venue.\n", "\nRoom was very small, and the breakfast was not that great. The bed was super comfy as well as the pillows. Good hotel for stopping through and staying for a night. Could definitely use some updates to furniture. You could tell the furniture in our room was very used.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/08/a3/f5/26/exterior.jpg"}]
[{"category": "hotel", "review_count": "264", "title": "Hyatt Place Pittsburgh/Airport Hotel", "rating_string": "4.0", "address": "6011 Campbells Run Road, Pittsburgh, PA 15205", "review_list": ["\nVery clean.\nStaff was very friendly\nReceived wake-up call on time\nWe had a drink at the bar (around 9PM) -- it was a litte too crowded and too slow - but, once the bartender came our way, he was also quite friendly\nwill definitely stay again\n", "\nAs a Nor'easter was approaching, the family decided to stay at the airport the night before an early flight so as not to fight snow and ice on the road. The hotel suited this purpose, as it is integral to the airport, and a short inside walk to the ticket counters. Rooms were clean and well kept.\n", "\nWe stay at this hotel when we have an early morning flight and are always happy with the service and the room. We ordered breakfast to be delivered to the room and it came at the exact time we had requested on the card. The front desk staff are super nice and always happy to help.\n", "\nHad a long and late flight from west coast and the Winter storm JONAS had just finished and the interstate 79 was one lane to WV so chose to stay at the Hyatt at the Airport Pittsburgh. The staff was super polite and helpful. The room was big and spacious and had plenty of wall sockets for all my electronics...\n\n\nMore  \n\n\n", "\nThis hotel is connected to the Pittsburgh International Airport which makes it convenient to spend the night before a trip. The staff is very friendly, rooms are clean and the beds are comfortable. There is an indoor pool and workout center. In the lobby hosts a bar/restaurant which makes a great place. The only problem is the bathroom lighting could...\n\n\nMore  \n\n\n", "\nMy wife and I travel to Pittsburgh every year to watch a Penguins game and usually stay at the Cambria Suites next to Consol Energy Arena. Because of a reservation issue, we had to look for another place to stay and were blessed to find this gem of a hotel within easy driving distance to the downtown area. We stayed...\n\n\nMore  \n\n\n", "\nI stayed here recently so I wouldn't have to brave the Pittsburgh traffic during a snow storm. The staff is excellent and actually got me checked in early, which I greatly appreciated. It is nice to be able to just check out and walk through airport security. The lounge and restaurant are pricy, but the food decent. World class? No....\n\n\nMore  \n\n\n", "\nThis hotel is where I have stayed for every business trip to Pittsburgh I've taken. It is truly a wonderful place--clean rooms, nice glass showers, friendly and professional faces. I wish they would remember me as I'm there every other week, but they do recognize me at least. The hotel doesn't have a restaurant, per se, but does have hot...\n\n\nMore  \n\n\n", "\ncheck in quick and without incident. everyone was friendly. room was nice size with a king size bed and a couch. mattress was very comfortable. loved the walk in shower. the flat screen was nice. breakfast in the morning was simple but good. they had an indoor pool but we did not use it. we requested late check out and...\n\n\nMore  \n\n\n", "\nIve stayed at this Hyatt Place several times as this is a favorite place to crash on our way out east. Like all Hyatt Places, fresh green apples welcome you as you walk in the door. The rooms are extremely spacious with modern furnishings and the breakfasts are unlike any other with FRESH eggs, fresh fruit, etc, prepared by a...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/06/fe/31/43/hp-p269-conv-gen-1-reno.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "198", "title": "Comfort Inn & Suites Pittsburgh Allegheny Valley Hotel", "rating_string": "3.5", "address": "180 Gamma Drive, Pittsburgh, PA 15238 (Formerly Holiday Inn Pittsburgh - Allegheny Valley / RIDC Park)", "review_list": ["\nI have stayed here many times over the last couple of decades. At the end of the Holiday Inn days, it was pretty rough, but it has been renovated recently. It still seems somewhat old, but my room was clean. When I arrived, it was very cold outside but my room was very hot. When I adjusted the temperature, it...\n\n\nMore  \n\n\n", "\nIt wasn't the worst played I've ever had to stay and it wasn't the worst hotel experience but it wasn't worthy of a repeat. There is something with hair, as it was everywhere!! Pulling back the covers there was hair, bathroom floor, there was hair. Seems like an ongoing theme. The corners in the bathroom was evidence of the build...\n\n\nMore  \n\n\n", "\nRooms, halls, pool were dirty, dirty, dirty. Basic cleaning like dusting were clearly not being done. The front of the bathroom sink was covered with dust and specs of toothpaste or soap or something. Corners of the bathroom piled with dirt, hair in the shower. Even the doors to the closet and bathroom had dirty finger prints!!!! The pictures in...\n\n\nMore  \n\n\n", "\nI travel to Pittsburgh for business, and am always looking for value, comfort, cleanliness, and convenience of location. This hotel has them all. It's 10 minutes from Downtown on most days. The staff is attentive. The rooms are clean (most have a refrigerator and microwave). They are clean, although some showers are outdated. And, the price is more than right.\n", "\nDisgusting! I have had to call housekeeping three different times in less than 24 hours. There were hairs all over the bathroom floor and on \"clean towels\". It was evident the bathroom hadn't been cleaned at all. It was filthy. After speaking to housekeeping the second time, they assured me they would take good care of us. Then they left...\n\n\nMore  \n\n\n", "\nWe went to this hotel for an employee appreciation event. 3 out of 6 rooms had issues: one room still had trash in the cans, one had a red stain on the blanket, another had a filthy comb in the pull out couch. we were all on the same floor so I'm assuming that the worker that day decided they...\n\n\nMore  \n\n\n", "\nVery close to the Heinz VA facility and just off the highway. Morning newspaper delivered to room was a nice bonus. Breakfast buffet both hot and cold items were ample and well stocked. Business center computer and printer was available and useful.\n", "\nFor the past four years, we have stayed here and found it perfect for our grandson ( from age 3 1/2 to no 61/2 ) ... We usually stay two nights and then go to the zoo one day and the museum the next ;) we like the indoor / outdoor pool and the fact that there's a restaurant/ bar...\n\n\nMore  \n\n\n", "\nStayed here because it was close to where I was working. The outside looks nice and the place is pretty big. The clerks at check in seemed very robotic and didn't seem very friendly. The room looked ok except for the bathroom. I don't usually complain but the bathtub is worn and stained. It was cleaned just stained gray. I...\n\n\nMore  \n\n\n", "\nAll staff were super friendly and helpful. The beds were good and rooms clean. Showers were hot and had great water pressure. Breakfast had a lot of choices and the staff that worked in the dining area stayed on top of things, nothing ran out. Check in and check out went smoothly with no issues.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/08/42/9f/8f/exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "228", "title": "SpringHill Suites Pittsburgh Southside Works Hotel", "rating_string": "3.5", "address": "2950 South Water Street, Pittsburgh, PA 15203", "review_list": ["\nI start this by saying that I am a Marriott supporter and happen to be a longtime owner in the timeshare portion of their company. I have never had a repeated horrible visit as I did last weekend. I did as the hotel suggested after our last bad experience and requested a front room to avoid the train tracks. We...\n\n\nMore  \n\n\n", "\nWe are staying here currently for the weekend. The previous customer in our room forgot his pubic hairs. The cleanliness of the room isn't what a hotel should be. The lobby area is very skeletal. We've stayed here before and it's only because of the location.\n", "\nWhether you are stopping by or visit the Pittsburg area, this hotel is conveniently located. It is just across the river from the highway, and there are several restaurants within walking distance. For local attractions, the hotel has a complementary shuttle which will take you within 3-mile radius. The front desk lady was friendly and accommodating.\n", "\nWorst hotel I have visited in a long time. Not only was my room musty, it was filthy. Alaina and Katie were pleasant, Harry was helpful & knowledgable about the area.\nI can't say I will recommend to anyone.\nThis hotel needs work and management is definitely asleep.\n", "\nI’ve stayed in Pittsburgh a number of times and decided to try this property. The room was clean. Now the bad news: I didn’t see a single smile from any worker. When I checked in about 8 PM, no one was at the counter. I waited a minute or two then coughed. A worker came out from behind the partition...\n\n\nMore  \n\n\n", "\nNew design Marriott Springhill is nicely decorated. Located riverfront the SOuth exposure of the hotel is an active railroad track. Avoid that side when booking - the trains blow their whistles in the middle of the night. The included breakfast is typical and just functional. The housekeeping is spotty - they neglected to clean my room one the nights and...\n\n\nMore  \n\n\n", "\nEasy access to this hotel. A friend recommended this hotel because of the location and knowing I didn't want to be downtown. Still a lot to do in this area. Staff was friendly and room was clean. I'll be back!\n", "\nWent to Pittsburgh to celebrate our college freshman's birthday. She also happens to be an athlete at school. We checked in very late only to find that without a doubt, a guest had been smoking in our room. As we headed out to dinner, I notified the front desk, 2 young ladies, about the issue. I received warm smiles and...\n\n\nMore  \n\n\n", "\nI have stayed here a few times for business. I like that it's easy to get too and there are some decent food options around. Don't get a room near the underground freight rail! It runs all day and is incredibly loud! I have also had issues with hotel management when I tried to get them to deal with a...\n\n\nMore  \n\n\n", "\nStayed here for a local wedding and choose this location again for business travel. Arrived for the first time shortly after they opened. The lobby is beautiful. The location overlooking the river is peaceful watching boats and barges float by. I always ask for a room facing the river. The location is also convenient for restaurants.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/0a/3c/4e/10/exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "245", "title": "Fairfield Inn & Suites Pittsburgh Neville Island Hotel", "rating_string": "4.0", "address": "5850 Grand Avenue, Pittsburgh, PA 15225", "review_list": ["\nWe stayed here spontaneously on our way down from Ontario to Florida. Nice quiet area. Got a king size bed for a good rate considering the hotel. Large TV, huge bathroom with nice shower, overly comfortable bed, wonderful breakfast with waffles and good muffins, front desk attendant was really nice, no complaints whatsoever.\n", "\nI have been staying at this hotel since 2013. I am there at least 3-4 times a year and the service has always been very consistent. Although the area surrounding the hotel does not seem very nice, I guarantee the views will make up for it.\n", "\nLocation was great for us visiting Pittsburgh. Clean comfortable rooms. Staff was courteous, friendly and helpful. Pool and jacuzzi were great (other then too much chlorine which is like most hotel pools). Breakfast was fresh and nice assortment.\n", "\nDorothy in the breakfast room is awsome. The lady that works the third shift is really nice as well. on my most recent stay after the room was serviced someone from housekeeping tried to enter my room while I was sleeping at 1:45 p.m. I think it was the manager of housekeeping. Then I noticed how busy the person was...\n\n\nMore  \n\n\n", "\nLoved this hotel!! They are just outside of the city, so we drove into the city to see things. The room was clean, quiet...everything we need in a hotel! There was a nice restaurant just off the parking lot that had good food at a reasonable price. We had a really nice weekend here, visiting with our college freshman!\n", "\nThe hotel location on Neville Island was just outside of their industrial district.\nBut to our pleasant surprise, this hotel was very nice inside and out. With a great view of the river behind the hotel, you could enjoy the river scene with the boats and docks across the river.\n", "\nWe have stayed here on numerous occasions and no matter what room we are in the noise from the interstate and the Penske garage is quite evident. Beautiful view of the river. Clean rooms. Usually friendly employees (had one this trip not too happy). AND MOST NEGATIVE COMMENT....THE BREAKFAST SHUTS DOWN AT 9:00!! After a long night of travelling, getting...\n\n\nMore  \n\n\n", "\nI thought the hotel was really good. Nice people, nice clean rooms, comfy beds and a good breakfast.\nThe only downside is the location. It's a fair distance from downtown, without a lot, even restaurants in the immediate area. It's a very industrial area, so there are a lot of trucks on the road out front which can make for...\n\n\nMore  \n\n\n", "\nI stayed the weekend of 8/28/ -8/30/2015.\nService was good. Nice and clean place. Had planned to use the pool but it was a little small and once one family was in it the desire wasn't there to jump in. The patio was really really nice. very quiet. The fire pit that was lit at night was very nice and...\n\n\nMore  \n\n\n", "\nClean and comfortable. We requested a quiet room and fourth floor was just right. Basic amenities but no lotion or hair dryer in bath room. If you have allergies to feather pillows they will change them to good quality regular pillows. Basic breakfast with good Marriott coffee. Pleasant friendly staff. Much better experience than when we stayed here last year....\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/0a/3b/d3/51/exterior.jpg"}]
[{"category": "hotel", "review_count": "76", "title": "Holiday Inn Express Pittsburgh-North (Harmarville) Motel", "rating_string": "4.0", "address": "10 Landings Drive, Pittsburgh, PA 15238", "review_list": ["\nAnother great holiday inn express. The room was very clean, comfortable and spacious. Free wifi, in room coffee, great water pressure in the shower, and the free breakfast was terrific. The staff was very friendly. The parking lot was well-lit. And although the hotel is next to the turnpike, the \"traffic noise\" was minimal. A+\n", "\nWe stayed here to visit my cousin who attends Pitt. It is about a 15 minute drive from the Pitt campus but very conveniently located near an entrance to the PA turnpike. We also choose this location because near the ice rink in Harmarville where my cousin plays hockey. We had room on the 1st floor across from the ice...\n\n\nMore  \n\n\n", "\nWe arrived Friday afternoon, and the desk host was very pleasant to deal with.\nThe hotel was very relaxing, fairly quiet for a Friday. We stayed until Sunday, then checked out. The food was very plentiful, (hot and cold choices), and good. The cook/kitchen help was able to talk some as the hotel was not too busy at the early...\n\n\nMore  \n\n\n", "\nI stayed at this Holiday Inn Express for four nights last week. My family and I had to leave another hotel at the last minute and the staff was great in accommodating us in finding two rooms, close together at a decent price. The housekeeping staff was very helpful and always smiling, the front desk staff was always pleasant and...\n\n\nMore  \n\n\n", "\nStayed here one night on busy Labor Day weekend to visit family family in nearby Verona. The breakfast was excellent and items replenished often. We booked two double rooms, however one room's air conditioning unit was not working- just blowing air but not cool. It was ok for one family member but not the other. We were told a new...\n\n\nMore  \n\n\n", "\nI spent 4 nights here. The first 3 were ok, the last night, less than desirable. An adjoining room had someone smoking in there and the scent carried over into my room. The hotel manager did rectify the situation after the fact, but was disappointed that the MOD at the time didn't do anything.\nOverall, it's an ok hotel with...\n\n\nMore  \n\n\n", "\nRooms have been recently updated and feature clean, faux-wood floors -- really bright and modern. The suite is huge and a great value! Pool is a nice size as is the pool room itself. Free breakfast was good quality. Staff was great. And the location is nice -- a bit out of the City, but a quick 10 min to...\n\n\nMore  \n\n\n", "\nWe stopped here on the way back home because we stayed at the one at the one in Logan. Again the the rooms are clean and the service was great. The room has high ceilings which you do not see that often, quite unique. They have hot breakfast until 9 AM.\n", "\nMy boyfriend and I visited for the night to celebrate our Irish heritage. Check in was slow n felt like it took forever even being the only one in line. The hotel was up to date and included an inside pool. It was conveniently located close to a few places worth visiting like Primantis Brothers and Meadows Racetrack. It is...\n\n\nMore  \n\n\n", "\nnot too many hotels close by in Oakmont. We didn't want to go into the city so decided to stay out here. Only had three choices (super 8 & days inn next door) We were glad we chose the Holiday Inn. Nice place and staff was very friendly. Very convenient to Oakmont CC so if you go down for the...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/0a/2b/9f/0c/hotel-exterior.jpg"}]
[{"category": "hotel", "review_count": "50", "title": "Homewood Suites by Hilton Pittsburgh Downtown Hotel", "rating_string": "5.0", "address": "1410 Smallman Street, Pittsburgh, PA 15222", "review_list": ["\nMy family and I were blown away by this hotel. I couldn't believe what we got for the price. I got a terrific deal and paid about $135 for a two room suite complete with kitchen, living room with pull out couch, separate bedroom with two double beds and bathroom. It was immaculately clean, beautifully styled and had two terrific...\n\n\nMore  \n\n\n", "\nWe stayed here before the Bruce Springsteen concert. Great location with shuttle service to the arena. Parking was very convenient and there are a lot of locations to ear and have a drink. Overall a great stay. Rooms and staff great.\n", "\nGreat place for a business trip. New and extremely clean. Staff were very pleasant and helpful. Valet parking only was the only downside, but even this was a minor inconvenience at $22 per day. I recommend this Homewood Suite for any business traveler.\n", "\nWe just spent one night (3 rooms) to take a group of girls downtown for a birthday celebration. The hotel is beautiful, clean and a great location and the staff are incredibly accommodating. The rooms are completely equipped, the beds were super comfortable and bathrooms were beautiful. There is valet parking and a complimentary shuttle that will transport guests to...\n\n\nMore  \n\n\n", "\nVery friendly staff, Teena is very lively and treats all of her guests as special VIPs. Everyone likes the Happy Hour where all travelers can get together and relax after a day of sightseeing or work in Pittsburgh. I highly recommend this hotel. It is very quiet and provides very nice amenities like a indoor pool, well equipped workout room,...\n\n\nMore  \n\n\n", "\nCheck in: We were greeted by the valet with a smile and he was so friendly. Then as soon as we got to the lobby to check in the two people there greeted us with big smiles and we knew our getaway was off to a good start.\nRoom: We stayed in the 2 queen bedroom suite with an amazing...\n\n\nMore  \n\n\n", "\nWe stayed one night for our son's 7th birthday. The hotel has convenient valet parking that is 24 hour with unlimited in/out availability for $22. The hotel is brand new and has many fine features. The lobby is on the second floor and along with a large sitting area for breakfast, overlooks the river line and bridges. A large fireplace...\n\n\nMore  \n\n\n", "\nIn Pittsburgh with a seriously ill family member at UPMC. The valet, the front desk staff, bartender, maintenance, breakfast staff- welcoming, professional, accommodating, and well, nice. One front desk associate was even there late at night and again first thing in the morning.\nThe suite was exceptionally equipped and there are wonderful amenities and services for long term stays.\nThank...\n\n\nMore  \n\n\n", "\nUsed the Homewood Suites for the first time for our company meeting. The conference room was spacious and the projector and AV equipment fill all our needs. The food and services provided was top notch. The hotel rooms were clean and perfect for a week long stay. The ability to have the hotel purchase groceries for our individual rooms was...\n\n\nMore  \n\n\n", "\nExcellent hotel with friendly and engaging staff! I will definitely stay at this hotel again! This was my first experience with a Homewood Suite but it will not be my last. Rooms are modern, and clean. It felt like a home way from home. My only regret is that I was there for only one night on a business trip.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/0a/34/dc/75/homewood-suites-by-hilton.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "38", "title": "Hotel Indigo Pittsburgh East Liberty", "rating_string": "5.0", "address": "123 North Highland Ave, Pittsburgh, PA 15206", "review_list": ["\nThe hotel is new and has a great 1920's vibe. The rooms are incredibly clean and decorated beautifully. I travel often and the service here at Indigo is 5 stars from the front desk to the valet. Patrick will go above and beyond to share information about the things to do, restaurants and any other questions you may have. The...\n\n\nMore  \n\n\n", "\nThis Hotel is just simply wonderful. From the time we arrived, Patrick and his team made us feel welcomed. The room was spacious and very well decorated. We enjoyed the lounge area and had dinner and breakfast in the restaurant, the staff was outstanding. Unfortunately we had to leave, but Hallz encouraged us to returned and I assured he that...\n\n\nMore  \n\n\n", "\nMy family (husband and two teenage daughters) stayed here for a short weekend and we're delighted! The rooms were ver clean and comfortable! Love the hard wood floors! Each and every member of the staff was exceedingly friendly (shout out to Patrick at the front desk, so friendly and helpful!). Also, best free lobby coffee ever (I avoid lobby coffee...\n\n\nMore  \n\n\n", "\nI needed a hotel for one night. I was driving from Michigan to NY and was looking for a comfortable hotel at the halfway mark. I'm glad I found Hotel Indigo. After driving 5 hours, my son and I checked into this hotel at 10;15 PM. Reception was excellent - very friendly and helpful. The room was very large and...\n\n\nMore  \n\n\n", "\nThis hotel is nice and new, the rooms are very modern.\nPros:\n-Rooms and bathrooms were very.\n-Staff was mostly helpful (bellman was alittle pushy)\n-fast wifi\n-Fitness and business center with printer\n- Very large bathrooms with great showers\nCons: No very close to downtown\n-Shuttle service only will go in a 3 mile radius\n-No pool\n-Only have...\n\n\nMore  \n\n\n", "\nHad a great time here in this gorgeous hotel. We will definitely be staying here again. The valet parking was super convenient, especially with all the snow in the city. Patrick the front desk guy was so nice. Thanks for taking care of us!\n", "\nDid a quick two day trip to Pittsburgh to enjoy some restaurants(great scene, loads of new places) and some shopping.\nChose new Hotel Indigo to use some IHG points/free night from credit card. Would certainly go back on paid nights as well.\nUpgraded to a corner room with a lot of space for 4 of us. Outlets available all over...\n\n\nMore  \n\n\n", "\nI have to thank the entire staff, especially the manager Patrick, for making my unexpected snow delay so much more tolerable. I couldn't have felt any more appreciated as a guest and everyone went out of their way to make me as comfortable as possible when having to extend my stay twice due to winter storm Jonas! I look forward...\n\n\nMore  \n\n\n", "\nA colleague and I (and my family) were in town for a business convention a week ago. We drove in on a Friday and checked into our hotel. It was horrible (not 1 good thing to say about it), so we checked out - at this time it was about midnight. We called around to several other hotels in downtown...\n\n\nMore  \n\n\n", "\nWe had a truly superb experience from check in to check out. It was our first Hotel Indigo stay (although we're Platinum IHG) and we love the idea of a unique space designed for each neighborhood. Our room was phenomenal and the service was unparalleled. The only smudge came from room service--those pancakes are awful--but their over easy eggs were...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/09/0c/da/b0/hotel-indigo-pittsburgh.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "18", "title": "Fairfield Inn & Suites Pittsburgh Airport / Robinson Township Hotel", "rating_string": "4.5", "address": "1004 Sutherland Dr, Pittsburgh, PA 15205", "review_list": ["\nThis is a brand new Marriott property, and one of the nicest Fairfield Inn's I've experienced. Check-in experience wasn't the best, as the woman who checked me in seemed to be put off a bit that she had to get me checked in. Sort of a surly attitude. Didn't mention Gold status or Rewards membership. But very nice lobby; rooms...\n\n\nMore  \n\n\n", "\nThe hotel is only 3 1/2 months old and in pristine condition. The overnight senior rate was $105.00 plus taxes which included a very good breakfast. Also it included transportation to and from the airport and leaving my automobile for 4 days. Pick up from the airport at entrance 2 was completed in about 20 minutes after the call. I...\n\n\nMore  \n\n\n", "\nThe FFI Robinson is a great affordable place to stay. As a Marriott Gold, I know what to expect at FFI properties and this one is one of the best I have ever in. The fact it just opened in Oct 2015 obviously helped but everything about the stay was excellent. Check-in was quick even with me requesting an upgrade...\n\n\nMore  \n\n\n", "\nThe hotel is in a great location close to a mall and restaurants. Not close to downtown, but we had a car. Breakfast was very good, room very clean and quiet with fair space, attendants were all great. Wireless worked fine and good free parking.\n", "\nI stayed at this hotel after a Pitt Football game, just after it opened. The hotel was great, and the staff was very friendly. The room was spacious and offered plenty of amenities. This hotel is just minutes from the Pittsburgh airport, local shopping and restaurants, and other attractions. It is also a short drive to downtown Pittsburgh. A great...\n\n\nMore  \n\n\n", "\nThe rooms are all new and so are the amenities. The beds were ultra comfortable and the rooms were quiet. The pool was a little small, but a good size for the kids to splash around. The included breakfast was great and there were lots of options. Overall a great experience for a family stay. The location is great too....\n\n\nMore  \n\n\n", "\nWe stayed while on a cross country trip based on trip advisor rave reviews. And spending a night in a new place while traveling is usually a no brainer.\nIf the place had had a passable bed, I would have given the place a three. Maybe.\nThis bed was very soft, and got deeper as night went on. My husband...\n\n\nMore  \n\n\n", "\nThe hotel is about 15 minutes from the airport. It is near shopping and places to eat\nOur room was great, I think we may have been the first people to use the room. We had a problem with the bathroom door opening-it just needed someone to adjust it or plane it. We let management know. The hotel was quiet...\n\n\nMore  \n\n\n", "\nWow what a great hotel. Close to everything including the mall, an IHOP within walking distance, Plaza Azteca right in the lot too. Chic Fil a and tons of other food within minutes. 10 minute drive to the airport which is right off the highway. Great rooms in this new hotel with great shower and a good size bathroom. Comfy...\n\n\nMore  \n\n\n", "\nMy husband and I stayed here before we spent a day in Pittsburgh. It is in a convenient location and clean and new. The rooms are on the small size but well appointed with a fridge, microwave, coffee maker and nice bathroom. I guess there are suites in the hotel, but our room was just a smallish size normal hotel...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/09/19/72/9a/robinson-township.jpg"}]
[{"category": "hotel", "review_count": "84", "title": "Hampton Inn & Suites Pittsburgh/Harmarville Hotel", "rating_string": "4.5", "address": "2805 Freeport Road, Pittsburgh, PA 15238", "review_list": ["\nWould stay there again. Clean, friendly. Nice size rooms. Great location. Staff very helpful. It snowed and the parking lot was immediately plowed for the guests. Stayed for a hockey tournament - the staff was not over whelmed by the girls taking over the lobby and accommodated all our needs and request. Looking forward to staying again.\n", "\nGreat hotel/ great staff / great breakfast / great pool and workout room. Very clean. Wonderful location easy to get to. Excellent all the way around. This was a trip for a family wedding. The staff did their best to keep us all together on the same floor and they allowed us to gather in the lobby during our stay...\n\n\nMore  \n\n\n", "\nThis hotel has become one of our favorites. We were excited to find out they were building a new hotel just a couple of miles from my brother's house. We tried it after it opened and have gone back a few times. The staff is so friendly and has been a big help to us. It is well located around...\n\n\nMore  \n\n\n", "\nWe recently stayed at this Hampton Inn for my brother's wedding. It was in a great location, the lobby was nice, the rooms were spacious, and the bed was so comfy! I loved the amount of pillows it had on it. The staff was very friendly and always complimented my little girl who was the flower girl in the wedding!...\n\n\nMore  \n\n\n", "\nThis facility appears to be new and is convenient to the turnpike and the HealthSouth rehab hospital where we were visiting a relative. Our room was clean, comfortable, and attractive (though we had a king-sized bed rather than the queen we reserved). We appreciated the well-designed bathroom. The check-in person was friendly and offered restaurant advice. There are several places...\n\n\nMore  \n\n\n", "\nRooms were clean and spacious. My only complaint is in the amneties of this hotel the say they have a spa and a bar and lounge to relax. There is no spa or bar and lounge. Other than that it is a great place to stay.\n", "\nThe room was very large. The breakfast was bigger and more varied than other hotels. The room was clean and newly refurbished or newly built. There was a lovely fire pit and even a putting green outside. The only issue is the terrible view... there is none. The only thing to look at is the new hotel being built next...\n\n\nMore  \n\n\n", "\nI had been to Pittsburgh for a couple of days with my family on a leisure trip. I had booked this hotel based on some search on Net and frankly I was happy to have done so. This is a nice hotel for leisure and business visitors to Pittsburgh. It is situated a little away from the downtown but there...\n\n\nMore  \n\n\n", "\nThe Hampton Inn in Pittsburgh was a great choice for the families of the hockey players to stay for the weekend of our tournament. Our room was exceptionally large, it was clean, and the beds and pillows were very comfortable. There was a great selection offered at breakfast, and there was plenty of food. This was a \"step up\" compared...\n\n\nMore  \n\n\n", "\nAn Amazing stay with impressive Northern Hospitality. We visited our relatives in the north and the location and excellence of the Hotel made it a memorable experience. It was around Thanksgiving and it was in a great location for eating and malls. I give it five ***** stars.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/07/d5/74/03/harmarville.jpg"}]
[{"category": "hotel", "review_count": "21", "title": "Holiday Inn Express & Suites Pittsburgh North Shore Hotel", "rating_string": "4.5", "address": "228 Federal St, Pittsburgh, PA 15212", "review_list": ["\nWe checked in late on a Friday after work. Every year we go to Pittsburgh for our birthdays; as they are all in the last week or so of January. The hotel is quite new and very clean. The rooms are spacious yet simple and very well kept. We like to stay in areas where night life and bars are...\n\n\nMore  \n\n\n", "\nThis is a fairly new hotel (less than a year old) and I have stayed here before. However, on this visit, everything seemed to be just slightly off. My profile with IHG has me listed as wanting a high room. I ended up with a room on the second floor. When I tried to get on the Internet (free wifi...\n\n\nMore  \n\n\n", "\nI recently stayed at this property for new year's eve for two nights. We were greeted at the front desk by Natalia who provided a phenomenal first impression of the hotel staff. She immediately recognized me as a Gold/Elite member. In fact, I dealt with her again on another occasion and she was, once again, perfectly pleasant. She is to...\n\n\nMore  \n\n\n", "\nI booked this hotel for the family to stay at for our New Years vacation. As a travel agent, I am always looking for lodging that I can recommend my clients to stay at and this one is at the top of my list for this area. If you are attending a Pirates or Steelers game, or visiting the Science...\n\n\nMore  \n\n\n", "\nI have stayed in a lot of hotels and this hotel was brand-new and catty-corner to PNC Park yet they had a unbelievably low rate. The staff was extremely friendly and helpful, even walking down the street to guide me to the hotel lot since all of the surrounding streets were closed due to the Pirates home game. We decided...\n\n\nMore  \n\n\n", "\nI was so happy to find this new location on the North Shore as the options were limited. The property is brand new and the area nice and clean. Parking is a value at $20.00 ish and the staff more than friendly, Nicole was awesome at the front desk and the housekeeping staff smiling and friendly. Breakfast is great and...\n\n\nMore  \n\n\n", "\nStayed here for 1 night to attend a Steelers game. I do not have any other hotels to compare this new hotel to in the area (this was my first overnight in Pittsburgh). Picked this hotel in particular due to price and location... here is a breakdown of the stay: We had a 3rd floor room. The room itself was...\n\n\nMore  \n\n\n", "\nGreat location for the Steelers game, tailgaters all around us. But, if you want a good night sleep, do not come here. The bed and pillows were hard as a rock. I tossed and turned all night till I just stayed up at 7am. The breakfast is great and staff very nice. Just couldn't sleep well\n", "\nWow. Possibly one of the nicest hotels I've stayed at. Great place to stay if wanting to watch Steelers or Pirates. It's only 60 yards from PNC park. Rooms at mini fridge, coffee maker, and microwave. We had a great view of the city from our room. Standard style bathroom. Everything in room was modern style. Flat screen tv. Off...\n\n\nMore  \n\n\n", "\nFirst time staying here. Great location in the North Shore area near PNC Park and within a mile or so to Heinz Field. Very friendly front desk staff. Enjoyed their free hot breakfast! Within walking distance to a couple bars on Federal St. Definitely would stay again!\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-p/08/fb/13/cf/holiday-inn-express-suites.jpg"}]
[{"category": "hotel", "review_count": "33", "title": "Hyatt House Pittsburgh / Bloomfield / Shadyside Hotel", "rating_string": "4.0", "address": "5335 Baum Boulevard, Pittsburgh, PA 15224", "review_list": ["\nSo the place seems really new and clean when you first come in, but I wasn't immediately greeted at the desk employees were j u st kid of kicked back having a good ol conversation. Melissa finally greeted me with kind of a phony fake smile, she was talking really loud to me as if I were old, or deaf....\n\n\nMore  \n\n\n", "\nThe area was easy to go anywhere. The staff was attentive and helpful. Everything was up to Hyatt standard and more. Good breakfast included and the rooms were good size and current. We will stay here again on our next Pittsburgh trip. Nothing more I can add\n", "\nWe arrived early, like 9 am and the concierge was happy to set us up in our room a full 6 hours before official check in, which was wonderful because we'd been awake for a full 24 hours and seriously needed naps. The room (a King Studio) is crazy nice and clean. The little kitchen has all the things you...\n\n\nMore  \n\n\n", "\nFirst off the place seems brand new. It is very clean, very modern, and the rooms are very spacious and full of emanates. Excellent location for business or going out in the East End of the City of Pittsburgh such as Shadyside, Bloomfield, Oakland. The service was lacking though. I don't know it it is because they just opened, but...\n\n\nMore  \n\n\n", "\nThis was a great stay for us in Pittsburgh. The hotel is in a nice area near lots of restaurants and bars. We booked a king suite and you get a nice size room with couch/pullout bed and a fully equipped kitchen. You also get free breakfast every morning. The service was also great, everyone was very nice and when...\n\n\nMore  \n\n\n", "\nWe stayed at this property over a weekend in December. This is a nice hotel. Clean with very nice staff. Free wi- fi. Very nice breakfast buffet. Ok location. Would return if we are in the area again. Pittsburgh is a nice city with friendly people and nice restaurants.\n", "\nWe stayed at several Hyatt properties over the Thanksgiving holidays and this was one of the favorites. Hyatt Houses are in general great properties for families as most rooms have a kitchenette, separate living room area, pools and hot breakfast included. But they aren't all created equal.\nStarting with check in, the front desk staff is fantastic - they listen...\n\n\nMore  \n\n\n", "\nModern and nicely decorated, good location and good amenities. It is a bit noisy, perhaps the floors are thin because I could hear every step of my upstairs neighbors. Service quite good and friendly. Beware: there is a $15 charge per day for parking that is NOT shown on many booking websites, or is buried deep in the hotel's description....\n\n\nMore  \n\n\n", "\nThis hotel is less than one year old. It is tastefully decorated, clean, and the staff was very pleasant (reception, housekeeping, chef, etc.) However, I was surprised that a newly constructed building would be so noisy. We stayed there four nights and each night, about 11 PM - midnight, I heard the person upstairs walking across his room. I nicknamed...\n\n\nMore  \n\n\n", "\nWe stayed here 3 nights over a weekend end September. The staff was extremely cordial and tried to bend over backwards to say ( but maybe not do) the right things. I had the impression that they were responding to the pep talks they get from their higher ups to compensate for some of the deficiencies that are beyond their...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/08/c7/96/7f/shadyside.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "136", "title": "MainStay Suites Pittsburgh Airport Hotel", "rating_string": "3.5", "address": "1000 Park Lane Drive, Pittsburgh, PA 15275", "review_list": ["\nI stayed here nearly every week between August 2015 and February 2016 for business, and would be happy to return again. Below is a brief review of different aspects of MainStay Suites Pittsburgh Airport.\nROOMS: Rooms were newly renovated last summer and still retain that \"fresh\" feeling and have a modern look. Nearly all my stays were in rooms with...\n\n\nMore  \n\n\n", "\nI had an early flight out, and decided to stay here the night before and catch the shuttle to the airport. On arrival, it was somewhat confusing, as the main entrance was under construction. Entry was thru a side door, and that could have been better marked.\nCheck-in was a breeze, and the desk staff was cheerful and pleasant. arrangements...\n\n\nMore  \n\n\n", "\nWe were in town for only a couple days to see a game and connect with family - this hotel was ideally located near the airport, but still within a short ride of downtown Pittsburgh. The setting is quiet - there's not much around, so you either need to have a rented car, or do your dining before arriving! The...\n\n\nMore  \n\n\n", "\nWe were four of us who stayed for 2 nights. We searched for a kitchenette containing room and this place was wonderful. Staff very pleasant. We enjoyed the complimentary breakfast and anytime tea, coffee facility. We heard about its recent renovation. We did get an online offer price for earlier booking. Good parking space. We would opt to re-stay here...\n\n\nMore  \n\n\n", "\nStay here about 2x a year and am growing increasingly satisfied. staff has always been friendly, and now with hotel renovation it is really becoming a place that has very few things to complain about. breakfast has improved. remodeling has removed the bad (smoke?) smell from the hallways. very good stay, will be back again no doubt. Wifi strength was...\n\n\nMore  \n\n\n", "\nThis is a great hotel that we ended up staying at only after Comfort Suites messed up my reservation. What a blessing in disguise! Clean, updated, and they had plenty out for us for breakfast as we had a 7:00 flight. Left my vehicle here for four days....no issues! Shuttle prompt, especially after we arrived at the airport last night!...\n\n\nMore  \n\n\n", "\n2 night stay at this Hotel. Suite was very nice and well equipped. Zero road or hallway noise. Queen bed was very comfortable - slept well. Access to I-376 was easy although traffic may be heavier during the week due to adjacent office buildings. Breakfast was \"just OK\" and the coffee was bland. I would stay here again when in...\n\n\nMore  \n\n\n", "\nThis location also has Sleep Inn at same location but different floors or wings. Excellently maintained property with new furnishings in the rooms as well as freshly painted. Staff is very friendly- all staff greet you when they see you - maids, front desk, maintenance, kitchen manager. Outdoors has a patio area with a grill as well as a basketball...\n\n\nMore  \n\n\n", "\nI have stayed at this hotel several times for business in Pittsburgh. The location of the hotel is fantastic for having the ability to drive a very short distance to find very nice places to dine, eg., Quaker Steak and Lube, Max @ Erma's, Long Horn steak house. It is also close to shopping, eg., Walmart, Target and the shops...\n\n\nMore  \n\n\n", "\nI booked this hotel based on inability to be closer to my daughter's college due to a Steelers game and then on reviews. My daughter was sick and I was going to surprise her and take care of her for the night. Check in was easy. I ordered pizza delivery and went to the front desk to ask for change...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/09/f7/97/6e/exterior.jpg"}]
[{"category": "hotel", "review_count": "6", "title": "Ace Hotel Pittsburgh Boutique Hotel", "rating_string": "4.5", "address": "120 S Whitfield St, Pittsburgh, PA 15206", "review_list": ["\nTraveling to Pittsburgh last weekend gave me the opportunity to try out the new Ace Hotel in the East Liberty neighborhood. We arrived at the Ace on Friday afternoon and thee was a buzz in the lobby/bar area. The informal setting was complimented by a friendly and helpful staff. The rooom was a pleasant surprise, filled with light, a great...\n\n\nMore  \n\n\n", "\nIt was our first time staying in an Ace hotel and we arrived one week after the hotel opened. Mostly, we were impressed by the enthusiasm and helpfulness of the staff. They really tried to meet all of our needs. Even going so far to find a great live music venue on a Monday night at our request. We also...\n\n\nMore  \n\n\n", "\nThe Ace hotel is a wonderful down to earth place to stay in East Liberty. It has recently opened and is still undergoing renovations to what was a former YMCA.\nWhen you enter you can see many antique looking furniture as well as a record player, board games, a lounge area, a restaurant and a bar on the other side....\n\n\nMore  \n\n\n", "\nJust went to the bar and plan on going to brunch. The hotel is a refurbished YMCA, surprisingly hip and current. Bar makes great cocktails and the atmosphere is energetic.\nCasual youthful professionals.\n", "\nTake a near wreck of a YMCA in an area that suffered the most from urban renewal of the 60's - dump a ton of money into the infrastructure - create an environment that will continue to attract people to an area that 5 years ago was a wasteland and you have the Ace Hotel. Now add a craftsman based...\n\n\nMore  \n\n\n", "\nI visited the hotel the second day they were open and was taken aback by the unassuming charm that was obviously intended. This hotel is in the renovated old YMCA of East Liberty. I went for dinner and drinks, but was given a tour of one of the Jr. suites. Be forewarned! There was an old-fashioned claw foot tub right...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/09/d8/16/93/ace-hotel-pittsburgh.jpg"}]
[{"category": "hotel", "review_count": "455", "title": "La Quinta Inn & Suites Pittsburgh North Hotel", "rating_string": "3.5", "address": "4859 McKnight Road, Pittsburgh, PA 15237 (Formerly Holiday Inn)", "review_list": ["\nPoor maintenance overall in motel. Room was clean and price was right. The TV had a list of channels but half of them didn't come in. High speed internet access was not high speed. Bathroom had chipped paint, shower rod was coming off the wall. Shower curtains were too small and it was impossible to keep water off the floor....\n\n\nMore  \n\n\n", "\nWe were here for three nights. Friendly staff, comfortable beds and wonderful breakfast selection made our stay nearly perfect! The front desk and dining room staff were very friendly. My only complaint would be that the lighting is poor in the rooms, but that doesn't keep me from giving it five stars.\n", "\nIt was my pleasure, along with my lovely wife, to have stayed there last week for 3 nights. We have stayed there many times as I am part of a group that stays there every January. The price is more than reasonable and the stay includes a hot breakfast. They have a complimentary coffee in the lobby and it is...\n\n\nMore  \n\n\n", "\nmy Husband was staying in the Hospital after a serious operation, I wanted to be near so I booked a room at your Hotel, everyone was very friendly, and caring after waking to snow covering the ground, they suggested I wait till they where able to plow the drive way, I thought that to be very considerate, will be heading...\n\n\nMore  \n\n\n", "\nMy wife and I have stayed for 5 nights at this hotel. Front desk staff could be more welcoming. Breakfast team very good and the food option is huge with waffle, fruit, egg, yogurt, bread and many other. Cleanliness was ok the only thing is that rooms lacks maintenance and is very dark.\n", "\nOn 10 pm the day before my planned arrival I happened to look at my reservation and see that I had mistakenly reserved the room a day earlier than I intended. And it was 4 hours after the cancellation cutoff! I immediately called the hotel, and the general manager graciously agreed to revise my reservation and not charge for the...\n\n\nMore  \n\n\n", "\nLove la quinta for one night stays when travelling with our dog. They do not charge a pet fee that will kill ur night. This hotel is updated, beds are very comfortable and rooms are clean. Great location, there is a big mall near by with lots of popular stores and restaurants. Will definately be back.\n", "\nWe stayed at North Hills facility for 4 nights and got linens exchanged twice. Cleaning crew claimed our \"Do Not Disturb' was on door. Incorrect! It was inside the room right where we left it. Had to get towels at night, beds not made. I assume cleaning is part of the room rate, were not reimbursed for no service, manager...\n\n\nMore  \n\n\n", "\nMy boyfriend and i had a staycation for 2 days. We arrived very late at night it was about 230 am and the woman at the front desk was cheerful and inviting. When we got to the room it was so nice and very clean. The location of the hotel is perfect, Ross park mall isn't too far and there...\n\n\nMore  \n\n\n", "\nExcellent service from all the staff. Especially the Breakfast bar lady. Full breakfast with eggs, Bacon,biscuits and all the usual breakfast fare. Even the coffee was good.The interior and dog areas are quite clean.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/09/e3/11/e3/exterior-view.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "3241", "title": "Wyndham Grand Pittsburgh Downtown Hotel", "rating_string": "3.5", "address": "600 Commonwealth Place, Gateway Ctr, Pittsburgh, PA 15222", "review_list": ["\nNice building, nice people. Accommodating to people needing assistance finding their way around town. Beautiful view from the upper floors. Right in the center of a bunch of nice food and drink establishments\n", "\nHad to take a trip home for a funeral and my Husband booked this location. I read the reviews and I was skeptical. We had a good stay considering the situation. My only complaint would be that parking was expensive to park ourselves. We chose the Valet option. We never had any issues when getting our car from the valet...\n\n\nMore  \n\n\n", "\nUpdated rooms with fantastic views of the rivers and bridges and the incline on the far side of the river. The staff was helpful and directed us to the areas we wanted to see. There are comfortable beds, the television needed to be updated it was a flat screen but the pixel quality was horrible.\n", "\nThis Wyndom is located on the point where the rivers come together, quite a scenic spot. The price was below what would normally be expected downtown or at a Wyndom, so value for money was good. The staff was very friendly and helpful. The room was a good size and comfortable. However. the bathroom needed attention with a toilet leaking...\n\n\nMore  \n\n\n", "\nThe bathroom door did not close and you had to get wet to on it. The remote channel could not flip and even after calling the service, they did not fix it. The man say u do not know its comcast service.\n", "\nThe views from our room were amazing. Could see PNC Park and Heinz Field from our room. The room was clean, comfy and updated.\nOur main complaint was that there was vomit near the elevators when we were there on our floor, we let the front desk know but 4 hours later, it was still there and gross.\nOther than...\n\n\nMore  \n\n\n", "\nI stayed here for a couple of nights while I was in the city for business. The location is excellent and it is within walking distance to most of the attractions within the city. The hotel is clean and has been recently renovated. The staff is a bit out of it no matter when you go to them but the...\n\n\nMore  \n\n\n", "\nHotel is extremely nice, it's location is right there as you come out of the tunnel. If you stay here try to request the rooms that face the stadium. My room didn't but the view that I had was good. The rooms were comfortable, the only complaint I would have is when my neighbor would take a shower it was...\n\n\nMore  \n\n\n", "\nWe stayed because we were going to the Springsteen concert downtown. Apparently the 'shuttle' that they say they have isn't running anymore, but that was not disclosed. Also there was a vomit stain on the rug in the room, but it was only half cleaned up. The glass in the picture hanging on the wall was also broken. First off,...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/01/a3/98/6e/standard-king-guest-room.jpg"}]
[{"category": "hotel", "review_count": "94", "title": "Comfort Inn - Pittsburgh / Steubenville Pike Hotel", "rating_string": "3.5", "address": "4770 Steubenville Pike, Pittsburgh, PA 15205", "review_list": ["\nMy room was very large. It was clean and the bed was comfortable. The bathroom looked liked lt had been recently remodeled with new fixtures. There was a mini fridge & microwave in the room. The free breakfast was decent & included the ability to make waffles. There was an exercise room with a couple pieces of equipment. No pool....\n\n\nMore  \n\n\n", "\nAfter a wild mishap with a cruiseline, our flights to Orlando were cancelled and so was our planned cruise. Upon learning of the cancelled flight, we thought it would be possible to drive to Orlando and catch our cruise ship - wrong. After driving about an hour and a half and making it virtually -no where-, we decided to stop...\n\n\nMore  \n\n\n", "\nSo glad we booked this hotel. Price was great, hotel and rooms were clean. Staff was so nice and friendly, large rooms. They have a breakfast but on the smaller side. They have soda, snack and ice machines. It's away from all the traffic but a cab ride to down town is quick. We would defiantly stay here again.\n", "\nI've stayed at this hotel twice and will not stay again. In both cases I checked into a room that smelled like it had been smoked in many times. To make matters worse the windows are fixed and cannot be opened. I personally cannot stand any room that has been smoked in, it always gives me slight headache. When I...\n\n\nMore  \n\n\n", "\nWe were in Pittsburgh for Baseball at PNC Park and chose this hotel due to its location. It is located about 10-miles from downtown and there are several routes to take depending on traffic and construction. The Interstate and Fort Pitt Tunnel is most always crowded especially during the work week and rush hour. There are a couple of route...\n\n\nMore  \n\n\n", "\nClose to everything yet away from the congestion. Incredible staff - polite and very helpful. They take care of this hotel - recently renovated and clean, clean, clean. Would recommend anyone going through the area to spend the evening here.\n", "\nNice hotel. Rooms look like recently renovated. Good beds. I've had better comfort Inn breakfasts. Waffles were good other stuff not great. Getting in and our were tough due to median. Drive to pittsburgh not too bad. Followed 60 in and out. Staff nice. Close to mall the other way.\n", "\nthe room was clean, well maintained. the bed was one of the most comfortable beds i have ever slept on! the breakfast had something for everyone, waffles, eggs, sausage, fresh fruit, cereals, bagels, juice, coffee, tea, muffins, nothing fancy. the staff at the desk were super friendly and helpful.the air conditioner took a while to really cool the room, it...\n\n\nMore  \n\n\n", "\nThe hotel is nice enough if you are just passing through, however the bedspread & the blanket both had stains on them. Shower wasn't the cleanest either, I have stayed here before and was pleased with previous stays however I don' think I will be going back any time soon.\n", "\nI stayed here two nights while in town for a concert with 3 friends and was very impressed! Clean, updated, comfortable with great staff and nice rooms. Our room had two double beds and to my surprise a pull out sofa bed. Great shower pressure as well! The free breakfast was great. Eggs, sausage, waffles, etc. Way more than you...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/07/7f/72/69/exterior.jpg"}]
[{"category": "hotel", "review_count": "268", "title": "Quality Inn University Center Hotel, Pittsburgh", "rating_string": "3.0", "address": "3401 Boulevard of the Allies, Pittsburgh, PA 15213", "review_list": ["\nVery affordable and great room conveniently located in the city. The room had a balcony with a fun view. Large room with a couch. Very clean. Stayed the night and went to a Penguins game. Friendly hotel staff brought us to the game via shuttle. I also used the gym which was clean and had nice equipment!\n", "\nMy fiancé and I stayed at this hotel two years ago and well, wasn't pleasant.. room was drab and needed a LOT of updating. But due to the the location to McGee's Women's Hospital and recent reviews, we decided to stay again, and glad we did.\nThe lobby has been updated and each floor now is brighter, and very warm...\n\n\nMore  \n\n\n", "\nThis is a great hotel in a great location! All of the staff were very pleasant and helpful, and it was very easy to get to any location in Pittsburgh in an easy and timely manner. This hotel was a tremendous value for the price.\n", "\nMy kids have dubbed this one as \"the best hotel ever\"! When we checked in just a couple of days after Christmas, my kids were allowed to pick presents from under the tree. It was not an extravagant gift, some small things to occupy them but you would have thought they had been given something huge! The ladies at the...\n\n\nMore  \n\n\n", "\nEmily (and a guy who looked like Josh Groban) greeted us and both were friendly, quick to register and willing to assist. Emily was awesome.When she learned of health issues, she offered and went to my car, placed the parking pass, returned keys to me and also brought goodie snack items(because we moved to a different room that would accommodate...\n\n\nMore  \n\n\n", "\nThis is a great economical hotel, with free parking, wifi, newspapers and coffee. This is the perfect hotel for families, students who are checking out the University or if you just arrived in town to check out the Stealers game. The hotel is close to downtown Pittsburgh, steps away from the University and a short distance to Mount Washington which...\n\n\nMore  \n\n\n", "\nStayed two nights for some medical appointments. We had a great stay. The courtesy shuttle drivers were so nice and helpful and full of great information. The front desk staff were friendly. Plenty of parking.\nOur room had some cosmetic maintenance issues such as small cracks in drywall, poor workmanship around the air/heating unit and the balcony door was bent...\n\n\nMore  \n\n\n", "\nThis hotel \"motel\" was one of the dirtiest places I have ever stayed. My door was left open by housekeeping staff. We were staying there while my husband was at UPMC. The staff were rude. There was one nice older lady who was at desk and drove the shuttle van. The price is cheap and that is because this is...\n\n\nMore  \n\n\n", "\nI really just expected an average experience for the one night I stayed here but, as it is many times when you travel, it's the kindness and service of the staff that really make the difference. When I asked for a quiet room, even though they were going to be full that evening, they delivered with a corner room on...\n\n\nMore  \n\n\n", "\nHaving only stayed here for just one night to be able to see the Montreal Canadiens play the local Penguins at the Consol Energy Center, I have nothing but compliments to the staff for providing excellent service and a fine room which suited my needs.\nRecent reviews comment on the helpfulness of the reception staff who go out of their...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-p/01/c6/1c/33/quality-inn-university.jpg"}]
[{"category": "hotel", "review_count": "216", "title": "Comfort Inn Conference Center Hotel, Pittsburgh", "rating_string": "3.0", "address": "699 Rodi Road, Pittsburgh, PA 15235", "review_list": ["\nWe stopped here for an overnight stay after finding a coupon in travel magazine. We had no reservation but were greeted by the friendly desk clerk and given a wonderful room. The room was clean and bed nice.\nBeing after 8pm we had dinner in the resturant/bar/lounge on site. Dinner was very good and beer was cold. Waitress young lady...\n\n\nMore  \n\n\n", "\nMy son attends Carnegie Mellon so we often need a hotel, but can't really afford to spend a lot. This Comfort Inn is awesome! They are pet friendly, which means I don't need to kennel my dog. Breakfast is included and includes a waffle station, eggs, meats, yogurt, cereal and pastries. Service is always great at the desk and in...\n\n\nMore  \n\n\n", "\nWe go Christmas shopping every year and we always spend the night and this was the first trip that we stayed here and we really enjoyed it! The staff was friendly and helpful and we were the guests of the day as well so we got some cookies and water etc. which was nice. Our room was nice and comfy...\n\n\nMore  \n\n\n", "\nWe come to Penn Hills frequently to visit an elderly relative. This place is frequently booked up and we have to venture further away to find a room. We were in luck this time and I'm happy we were able to stay here. The layout of the motel is confusing but once we found our room, we were very pleased....\n\n\nMore  \n\n\n", "\nI was in the Pittsburgh area for a family member's funeral this past week. The location of this Comfort Inn was great for my purposes. My husband and I had stayed at this same Comfort Inn five years ago and weren't impressed. When I saw that the hotel's website indicated the facility had been updated, I thought okay, maybe. I...\n\n\nMore  \n\n\n", "\nWe just arbitrarily stopped here for an overnight stay on the way to a family wedding in Stroudsburg, PA. We had no reservation but were cordially greeted by the desk clerk and given a very nice room. The room was clean and well lit. We were very tired so rather than go out for dinner we ate at the \"In...\n\n\nMore  \n\n\n", "\nI have stayed at this hotel many times over many years and I must say that the service is declining. We reserved our room online and got into town around noon. We were unable to check in until 3pm and the hotel would not hold our luggage for us. We were charged half the room rate for 2 hours past...\n\n\nMore  \n\n\n", "\nMy husband and I just spent two l-o-n-g nights at this hotel. I usually avoid Comfort Inns, however, this one had been rated with 4-stars on a different website and due to a shortage of hotel rooms in the Pittsburgh area this weekend (10/9-10/11/15), we took a chance. My impression? One word: Ugh. Despite having some obvious updates (flat screen...\n\n\nMore  \n\n\n", "\nThe first thing we saw was a big dark spot on the bed covering. There was hair on the shower wall and hair on the bathroom floor. There were food crumbs in the refrigerator. There was a blob of sticky stuff on the inside of the Comfort Inn notebook. The chair had spots on it so that we did not...\n\n\nMore  \n\n\n", "\nThe hotel is located just a 20 minute drive away from downtown Pittsburgh and right by the exit along the highway 376. It is quite the picturesque location, situated at the top of a hill. Check-in was smooth, rooms were nice and clean though the bathroom seemed a little dated. They had a decent spread for breakfast and very friendly...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/06/fe/1f/02/exterior.jpg"}]
[{"category": "hotel", "review_count": "44", "title": "Econo Lodge Motel, Pittsburgh", "rating_string": "3.5", "address": "4800 Steubenville Pike, Pittsburgh, PA 15205", "review_list": ["\nFairly clean..friendly staff....less than 1000 feet from the highway and gas station with a store so request a room on the back if you're a light sleeper. My cousin liked the breakfast, it has fresh fruit and danishes and coffee.\n", "\nWe were just looking for an inexpensive place for a weekend trip. The Econo Lodge is older but the rooms have been updated some. There is nothing fancy but our room was clean and the bed was comfortable. There is a mini fridge and microwave in the room. The front desk was friendly and the free breakfast was fine. I...\n\n\nMore  \n\n\n", "\nstayed here for two nights, while in the area for a MLB game. the gentleman at check in was very friendly and helpful. we had a room with a king size bed and couch. bathroom was a little small, but clean. plenty of water pressure in the shower. the room was very clean, and the bed was just right (not...\n\n\nMore  \n\n\n", "\nWhen I pulled up to this motel, I was concerned. It was late, it looked like it was not kept up and the guest signing up in front of me was a little disconcerting. When I walked into the room, the style was outdated. I didn't even know if I would stay the second night. However, it was a super...\n\n\nMore  \n\n\n", "\nI was extremely satisfied with my stay here! The staff was pleasant, the room was very clean, the internet was fast, the location was great to Pittsburgh, and the price was awesome! I would no doubt stay here again!\n", "\nI'm Diamond with Both Choice and Best Western. I've Never stayed at an Econo Lodge before. It was Late, I was Exhausted and it was right off the Highway. I Pulled up, checked my I phone and saw an 81% Recommended. I said it's Only to Rest, I'll Get a Real hotel in the Morning. Needless to say, I'm Staying...\n\n\nMore  \n\n\n", "\nShowed up really late - almost midnight - so was not sure what we were really getting into. Huge potholes in lot - found them bu surprise. The rooms were very, very, very outdated. If you need a place just to lay your head for one night - and one night only, you should be ok.\nWe had a good...\n\n\nMore  \n\n\n", "\nvery nice rooms, and the staff was friendly, not a very good location or parking if you are moving with a truck and trailer, there is no room to turn around. found parking and had a very nice night breakfast was great, I would stay here again\n", "\nI'm assuming that for those who decided to stay in this motel, you are not looking for an extravagant experience. The place is just like the picture from some previous reviews. Very 50s feel. The location is roughly 15-20 mins between airport and the city. Although it is very close to a large shopping area if anybody cares. Staff is...\n\n\nMore  \n\n\n", "\nI am a Choice Hotel employee, and when I had to make an emergency trip to Pittsburgh from Nashville TN, I checked into the Econo Lodge, expecting the worst, and was pleasantly surprised. The room was clean, nice big television, and the staff was friendly. Would stay here again.\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/09/e5/84/1a/exterior.jpg"}]
[{"category": "hotel", "review_count": "1", "title": "Sleep Inn & Suites Pittsburgh Hotel", "rating_string": "4.0", "address": "1000 Park Lane Drive Sleep Inn Bldg B, Pittsburgh, PA 15275", "review_list": ["\nStayed 4 days. The place is being renovated. Breakfast is alright. Wifi is very good. My door lock stopped working on day 3 and I was moved to a room across the hall. My only real complaint is that the TV's cant compete with the HVAC in the room. I constantly had to adjust the volume of the TV to compete with the HVAC.\n\n\nMore  \n\n\n"], "img_url": ""}]
[{"category": "hotel", "review_count": "531", "title": "Econolodge Inn & Suites Hotel, Pittsburgh", "rating_string": "3.0", "address": "900 Chauvet Drive, Pittsburgh, PA 15275", "review_list": ["\nI am truly thankful unto the Lord for affording me such a wonderful trip to \"Steeler Nation\". Heinz field is now my favorite stadium. I had a blast! The viator tour was amazing!!! I stayed at the Microtel Eco lodge Inn and suites. My room was clean. The staff were friendly and professional. It was affordable and had breakfast every...\n\n\nMore  \n\n\n", "\nVery average hotel but served our purposes. We stayed there the night before we departed for Cozumel, Mexico. I could use some renovation and it looks like they are trying to do this. Price was great, shuttle to and from airport and included parking.\n", "\nstayed here late night (2am) in november. was greeting by a sleeping desk clerk (h3ll, i don't blame her) on two roller chairs in the office behind the desk. asked for a quiet room facing the back. got a quiet room facing the front. room was as teeny as in nyc but it did the trick. got a solid quiet...\n\n\nMore  \n\n\n", "\nSome Microtel Inns are great. This is bit one if then. The room was in need of upgrading and better maintenance. The staff was. It particularly welcoming. Once was enough. I found better places to stay in the area.\n", "\nIf you want a lot of amenities then this is not the place to stay. The rooms are very small and compact. Not good for families unless you have a suite and then I wouldn't recommend for families. Clean and decently priced. No pool. A average stop and go, not a park and stay.\n", "\nClean sheets and towels in an otherwise wornout hotel. This is no longer a Microtel but is now an Econolodge. It is overdue for a renovation and a deep cleaning in the common areas. It is OK for a quick stay before or after a flight but don't expect much.\n", "\nWell I booked the room because I traveled with my children and POOL was one of the amenities. when I checked in I asked what time does the pool close and she told me that there was no pool. I was pissed. Never again!!!!!\n", "\nHave been here before and received a great deal from booking.com Would probably not return as the bed was one of the most uncomfortable beds ever. Wonderful and very helpful staff. clean room. less than average continental breakfast with waffles.convenient location in Robinson township.\n", "\nI have stayed here before but this is the last time. When we got to our room I found that there was not an iron. We stopped at the front desk to ask the clerk for an iron and she said the only way to do that was to change rooms. I told her I just needed one for 10...\n\n\nMore  \n\n\n", "\nWe booked through an online site. When we arrived the front desk clerk acted as if we were a bother. Barely an audible greeting, if one at all. She had no smile on her face or even in her body language. I am a people person, so I pick up quickly on others! If it weren't for the price &...\n\n\nMore  \n\n\n"], "img_url": "https://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "442", "title": "Days Inn Pittsburgh Motel", "rating_string": "2.5", "address": "1150 Banksville Road, Pittsburgh, PA 15216", "review_list": ["\nWe stayed in the hotel for the location of local activities that we could gain easy access to enjoy. Breakfast was sparse but good. The room was comfortable and the staff was very accommodating.\n", "\nWe stayed for one night because we drove in from philly for the bruce springsteen concert. The main reason we chose this hotel was because of the shuttle service. The shuttle going to the concert was great unfortunately the shuttle going back to the hotel was overcrowded and they had to keep returning. The girl who checked us in was...\n\n\nMore  \n\n\n", "\nWe stayed there for one night. Our room was last in the hall, no windows visible to outside. It was like staying in a basement.. Very outdated..\nBut the girl at the front desk was so incredibly helpful, kind and welcoming.\nHowever everyone in the area knew how \"sketchy\" this place was. The pizza delivery person even said \"you're stayin...\n\n\nMore  \n\n\n", "\nI actually only live about 60 miles from this hotel, but I frequently entertain customers in the downtown Pittsburgh area, and choose not to drive when I've been drinking. I've only recently found this property, and have stayed at all the budget to mid range hotels in the area. The hotel is a short and inexpensive cab ride across the...\n\n\nMore  \n\n\n", "\nUpon checking into room we went immediately to sleep as it was late and we had an apt at UPMC the following morning for my daughters surgery. Upon waking up at 430 am I was eaten up with Bed Bug bites from head to toe with welps all over my body. When I checked out at 530 am the clerk...\n\n\nMore  \n\n\n"], "img_url": "https://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "241", "title": "Days Inn Pittsburgh-Harmarville Motel", "rating_string": "2.5", "address": "6 Landings Drive, Route 28 & Pennsylvania Turnpike, Pittsburgh, PA 15238", "review_list": ["\nFirst off the reservation was not in their system, even though I had 3 confirmation emails in which the receptionist who was also the manager spoke to my employees like they were trying to scam her (don't know how you could scam a hotel off of reservations). Then the rooms we had 3 rooms all were disgusting outlets didn't work!!!!...\n\n\nMore  \n\n\n", "\nI considered\nI will rate this property (guest room) as average. The room (217) was clean but the furnishings dated and the towel rack in the bathroom was unstable to the touch falling when a towel was removed. Floor tiles around the wall and tub had considerable water damage and needed to be replaced. The bed was comfortable, pillows were...\n\n\nMore  \n\n\n", "\nI stayed here with a friend following a sporting event. It is inexpensive, easy to find and convenient to service stations, convenience stores and the PA Tpk interchange. We arrived about 9 PM and were gone by 6 AM. It fulfilled our needs\n", "\nUpon check in we requested a non-smoking room and upon entering our room it smelled of smoke. The one bed had been laid on as the comforter and pillows were out of place. Made a complaint and was assigned another room. Second room smell was better but small. Had to step up into the shower and step down. The front...\n\n\nMore  \n\n\n", "\nThe experience was very bad due to the 1st room had human stuff on the toilet seat and rim, 2nd rm full off mold and mildew in the shower and carpeting was very dirty. The rm security very poor and see thru door. I steam cleaned the room carpet myself due to bad odor. If my company didn't pay for...\n\n\nMore  \n\n\n", "\nWe usually stay here when we go to a Pirates game. Don't normally have complaints, but this time we got the only room left unoccupied and it was the \"handicap\" room. I'd feel very sorry if an actual handicap person had to stay here. It was cramped, bathoom was moldy. Not the most pleasant stay we've had here, but will...\n\n\nMore  \n\n\n"], "img_url": "https://static.tacdn.com/img2/x.gif"}]
[{"category": "hotel", "review_count": "Unknown", "title": "Embassy Suites by Hilton Pittsburgh Downtown Hotel", "rating_string": "Unknown", "address": "535 Smithfield Street, Pittsburgh, PA 15222", "review_list": [], "img_url": "https://media-cdn.tripadvisor.com/media/photo-w/09/a6/6b/f2/embassy-suites-by-hilton.jpg"}]
[{"category": "hotel", "review_count": "109", "title": "Hilltop Inn PIttsburgh Motel", "rating_string": "2.5", "address": "100 Kisow Dr., Pittsburgh, PA 15205 (Formerly Travelodge Pittsburgh)", "review_list": ["\nMy previous review of this property was not posted- not sure why. I provided a very detailed and truthful chronicle of the worst hotel stay of my life. This hotel is filthy and in disrepair. the room I had was infested by bugs. Do not stay here.\n", "\nHad this hotel not been pre booked (cancellation window passed) we would have walked to one of the neighboring hotels after smelling our room's sour moisture aroma.\nMy first concern was watching someone in front of us check in without reservation or credit card. Indicator they don't hold their own property in high regard.\nAt first glance the room seemed...\n\n\nMore  \n\n\n", "\nWhere to begin...\nThe purpose of the trip was a last minute football venture where a friend of mine and I drove from Toronto to Pittsburgh for the evening.\nWe used hotels.com to book, which will be the last time using that website, and let's just say, you definitely pay for what you get, and get scammed while you're doing...\n\n\nMore  \n\n\n", "\nMy husband's sister passed away suddenly and we were looking for a reasonable motel to stay in close to the airport. When we got into our room it was hot and stuffy. The carpet is covered in stains, appears to be black grease. Black paint was also splattered on the wall near the \"air conditioner\" which I use the words...\n\n\nMore  \n\n\n", "\nI stayed at this hotel while on my way home from Philadelphia, just to sleep for the night before finishing our drive home. The inn is more of a motel where each room has a door leading out to the parking lot and its own box air conditioner in the window. Upon first entering the room, we noticed a strange,...\n\n\nMore  \n\n\n", "\nWe arrived at this dive at 3am. They made us pay for the room as soon as we arrived instead of the usual payment at checkout. Right then I knew something was up. Checkout is 11am, keep in mind that we are the only car in the lot and only couple staying in this motel. We traveled over 6 hours...\n\n\nMore  \n\n\n", "\nI've remained neutral in any hotel I've ever stayed. This one took the cake.I pulled up to this \"hotel\". Very bare (for lack of a better word) and hidden from any signs of life.(It was next to another hotel and a huge corporation and just parking lots). I usually like to grab something to eat near a hotel I'm staying......\n\n\nMore  \n\n\n", "\nThe staff at this hotel act like you are bothering them when you interact with them in any way from checking in, to asking questions, to checking out. The rooms themselves are horrible, many items in the rooms are either poorly repaired or altogether broken. the first room they assigned us to, the lights over the sink didn't work and...\n\n\nMore  \n\n\n", "\nDon't beleive the \"free breakfast\"; a trip advisor post warned me it would be just white toast and reconstituted orange juice, but when I went the toaster was broken and they wee out of OJ. No glassware in the room; ever try to make hot coffee in a styrofoam cup? And the slowest wifi I have ever encountered; reminded me...\n\n\nMore  \n\n\n", "\nI went to stay there with my family and had one if the worst experiences there. The staff are not friendly and one of the staff guys accused us of stealing their towels ( in broken English with an accent ).\nThe lady at the main lobby kept spying on us when we went to have breakfast.\nThe rooms are...\n\n\nMore  \n\n\n"], "img_url": "https://media-cdn.tripadvisor.com/media/photo-o/07/7b/97/0e/guest-room.jpg"}]
[{"category": "hotel", "review_count": "Unknown", "title": "Hilton Garden Inn Pittsburgh Airport South / Robinson Township Hotel", "rating_string": "Unknown", "address": "303 Park Manor Drive, Pittsburgh, PA 15205", "review_list": [], "img_url": "", "class": "3.0"}]
[{"category": "hotel", "review_count": "Unknown", "title": "Hilton Garden Inn Pittsburgh Downtown Hotel", "rating_string": "Unknown", "address": "250 Forbes Avenue, Pittsburgh, PA 15222", "review_list": [], "img_url": "https://static.tacdn.com/img2/x.gif", "class": "3.0"}]
