[{"category": "hotel", "review_count": "727", "title": "Days Inn Sedona Motel", "rating_string": "4.0", "address": "2991 Hwy 89-A West, 3.5 mi West of Junction 89A & 179, Sedona, AZ 86339", "review_list": ["\nI was nervous about booking these two rooms before we got here because I thought for the low rate it couldn't be that good. I was relieved when we arrived the staff was very nice and the rooms were good and clean, also comfortable and right in the center of all the activities in Sedona. I would stay there again....\n\n\nMore  \n\n\n", "\nWe stayed two separate nights, coming and going from the Grand Canyon. First room was wonderful, but the second time was a different room (not as nice, but larger). Very comfortable rooms, and clean. Breakfast was a disappointment, so we skipped on that. Staff were pleasant and welcoming. Good value in a very expensive (but beautiful) area of Arizona.\n", "\nRoom was good size, everything worked and it was a pleasant stay. We were very disappointed with the \"breakfast\" At all other hotels we stayed during our sightseeing trip of Arizona, most had eggs, bacon or sausage, fruit, cereal, yogurt and waffles. The only choices we had were oatmeal, toast, cereal and banana. Also, in the bathroom there was a...\n\n\nMore  \n\n\n", "\nWe stayed here just to sleep after seeing Sedona. The sleep was good. Breakfast was skimpy. Sedona is a beautiful place but like any tourist trap it is costly. With all that in mind, this Day's Inn was acceptable. In a more reasonably priced area we would look for more amenities.\n", "\nI recently stayed at the days inn in West Sedona. It was a perfect hotel for me. Clean, comfortable and spacious, quiet and breakfast was delicious, and the service was wonderful! Thank you very much I would stay here again for sure!\n", "\nThis was a comfortable stay for anyone on a budget. I was there for a week. It was clean and easy to get to and from so it suited my needs very well. The free breakfast was terrible but the staff were nice and friendly.\n", "\nWe stayed at Days Inn in Sedona for five nights hiking and mountain biking in Sedona Red Rock country. The motel is a little bit on the far end of 89A, but still close enough for short walks to nearby restaurants in the evening (if you don't want to drive to other restaurants a few miles away, that is). Worth...\n\n\nMore  \n\n\n", "\nThe rooms were clean, beds comfortable, and the staff was nice and friendly. And the breakfast actually had a healthy choice--unsweetened cooked oatmeal to which you could add bananas, raisins, or other toppings.\nVery happy with this hotel for the price.\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "697", "title": "Amara Resort & Spa, a Kimpton Hotel, Sedona", "rating_string": "4.5", "address": "100 Amara Lane, Sedona, AZ 86336", "review_list": ["\nGoodness how do I describe this perfect little hide-away? From the moment we stepped into the hotel to when we checked out- it was exactly what we didn't know we needed to relax and get away from it all.\nIn true Kimpton style, the staff and amenities were on point. It was my husband's birthday and the staff rose to...\n\n\nMore  \n\n\n", "\nMy husband & I enjoyed our stay at Amara greatly. We felt welcomed from the moment that we arrived. Our room was comfortable and inviting. The property was beautiful. Cocktail hour was a nice touch and a fun time to meet other guests as many people took advantage of the yummy drinks provided. Great food onsite! Nice shuttle service around...\n\n\nMore  \n\n\n", "\nThere is much to like about Amara Resort. The location is perfect, a short walk to the main shopping area with stunning views of the red rocks of Sedona. The staff (especially the Concierge Teah) is warm, welcoming, and helpful. Our room was modern and stylish (finally, a hotel that is not afraid to add some bright color to a...\n\n\nMore  \n\n\n", "\nStayed here for a girls trip--we loved everything about the resort!! It's not too big and has a very warm and welcoming feeling. Everyone was so friendly and it was very clean. Scenery is beautiful. The hotel is dog friendly too, which is great!! Food was delicious and reasonably priced. Complementary wine hour at night was fun too! We played...\n\n\nMore  \n\n\n", "\nRecently spent 3 days at the Amara Resort and Spa. We had the king room with creek views and jetted tub. The room was large and comfortable with a nice little balcony overlooking Oak Creek, the views out the balcony doors were beautiful. The bed was comfortable and the room was big enough you did not feel trapped in a...\n\n\nMore  \n\n\n", "\nIt was my first weekend in Sedona, and I traveled there with 6 girlfriends. Not only was the Sedona area remarkable and beautiful, I was so impressed with the Amara from start to finish. It is centrally located in the town, but it manages to be a quiet and peaceful place at the same time. The lobby is airy and...\n\n\nMore  \n\n\n", "\nThis is an amazing boutique hotel! Service was exceptional- valet (complimentary), shuttle driver, and front desk staff all very friendly, polite, and helpful! Nicole at the front desk was very helpful in arranging a quick hike near the hotel with shuttle service to/from the trailhead (Jordan trail). The views are gorgeous from everywhere on the property. The pool is heated...\n\n\nMore  \n\n\n", "\nWe sincerely enjoyed our stay here and the staff were exceptionally friendly to our two dogs. The food at the restaurant is top notch and the hotel room is well appointed and comfortable. The wifi connection worked immediately and at a high speed.\n", "\nIf you want to be in the center of town, then this is the perfect place to stay. They also have some rooms with wonderful views. Just make sure you ask specifically if you want a patio. The restaurant was wonderful, as was room service and the hotel in general. I love Kimptons, and this one did not disappoint. It...\n\n\nMore  \n\n\n", "\nMy husband and I were planning one night in Sedona while on a trip from Grand Canyon National Park to University of Phoenix Stadium. I was really looking forward to a night of luxury after hiking in the Grand Canyon all day. All I wanted was a shower. We check in, unpacked, and I headed toward the bathroom for a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/04/07/af/06/amara-hotel-restaurant.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2043", "title": "Enchantment Resort, Sedona", "rating_string": "4.5", "address": "525 Boynton Canyon Rd., Sedona, AZ 86336", "review_list": ["\nMy husband and I enjoyed two nights at the Enchantment over Valentines weekend and took advantage of all the resort had to offer. The couples we met were interesting, the spa treatments and amenities were luxurious, and the resort activities kept even my active husband entertained while I did yoga and spa activities. We both were able to do what...\n\n\nMore  \n\n\n", "\nWe went here for our 20th wedding anniversary. It was an amazing resort with spectacular views. I sure do miss them already! It was a very relaxing place to visit. We ate at the resort restaurant for breakfast each day and Oscar and Miguel were so amazing. Very attentive and accomodating. Each morning we were greeted by name which gave...\n\n\nMore  \n\n\n", "\nEnchantment is an outstanding place. The canyon, spa and restaurants are all spectacular. The hike down to the end of the canyon is easy, and, though not advertised, the views of the cliff dwellings are awesome. It is just a great, private place to stay just outside of touristy Sedona. Not much more to say than that, frankly.\n", "\nWe stayed here for 3 nights and it is one of the best places we have ever stayed. The setting is spectacular and the resort is first class in every way. The service,the food,the activities,the beautiful location and the world class spa make this a top choice of places to go .\n", "\nIt is not the first time I have stayed at this amazing resort nestled in Boynton Canyon and surrounded by red rocks. If you are lucky or ask for it... your casita will have a beautiful view of the mountains. The resort is located in West Sedona and you should stay here for more than one night to enjoy all...\n\n\nMore  \n\n\n", "\nThe Enchantment resort is bound to mesmerize you. It is located within a gorgeous canyon - surrounded by the red Sedona mountains visible from every part of the hotel.\nThe bell staff is so efficient, friendly and helpful.\nThe rooms have been renovated and they exude elegance and good taste.\nThe resort is composed of many casitas all of which...\n\n\nMore  \n\n\n", "\nEnchantment is such a magical place! We spent a good amount of time in the spa using the facilities (steam/sauna/hot tub). Everyone that works there are just so friendly and want to make sure you always have everything you need. Can't wait to return!!!\n", "\nWe stayed with our 2 boys, ages 11 and 15, for 3 nights at Enchantment. We all loved it! The surroundings are gorgeous! I am so glad we did not stay right in Sedona. It is not that far from Sedona so you can easily drive in but far enough away that it is private. The restaurants and room service...\n\n\nMore  \n\n\n", "\nWe have been to Enchantment many times but this was the last. We were given a gift for loyalty then put into a room with construction outside of our door. We had to go to the front desk and demand to be moved. Customer service has gone downhill quite a bit since we first started visiting. Seems they cater more...\n\n\nMore  \n\n\n", "\nthis hotel had great villas for families..and was exactly as its named..enchanting. beautiful views, grounds pool, and to top it off amazing food. you can see the famous red rocks from inside, and outside as well. will definitely return.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/1e/cc/1a/best-view-for-happy-hour.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1975", "title": "L'Auberge de Sedona Resort", "rating_string": "4.5", "address": "301 L'Auberge Lane, Sedona, AZ 86336", "review_list": ["\nWe go here every year when traveling to Sedona and always love it. This year was no different except when we got there. The front of the house said they were ready to seat us but then told us to sit at the bar and 20 minutes later after I finally asked they seated us. It was early and tables...\n\n\nMore  \n\n\n", "\nFabulous experience for my daughter's and myself. We felt pampered and catered to by the very attentive and knowledgeable staff. We needed to make a couple of changes in our plans during the week and the spa staff was most helpful in choosing options that fit our needs. Such beautiful surroundings as well. The view overlooking the water during meals...\n\n\nMore  \n\n\n", "\nMy husband and I had a wonderful weekend here. We stayed in a room overlooking the resort with a beautiful view of the red rocks. The service was fantastic! Everything from the concierge, Graham, helping us to make restaurant reservations to the complementary shuttle to local restaurants and bottled water whenever we picked up our car. Close to the restaurants...\n\n\nMore  \n\n\n", "\nWe took time out from a business trip to Arizona to do a 2 night romantic interlude here. The staff was wonderful and friendly, and our room (we got upgraded to a cabin) was very comfortable. We had dinner in their restaurant and truly enjoyed it. Overall a great relaxing splurge!\n", "\nThis trip will definitely be etched into our memories of the most romantic vacation together. We were so impressed by every little detail of our stay at L'Auberge in Sedona. I believe we will make this an annual trip!\n", "\nFrom the minute we arrived until we departed, the L'Auberge staff was fantastic. Randy, Correy, Chris, Alex, Luzliun, JP, Lee, Hunted, and Sarz set the standard for all other resorts to emulate. The cottage renovations could not have been nicer! The food is second to none. The thoughtfulness, professionalism, and courteous nature of the staff made the experience one to...\n\n\nMore  \n\n\n", "\nThis trip was a very relaxing and romantic getaway. The spa cottages are gorgeous and are tastefully renovated. They are also very private. We will definitely be returning to this resort for many years to come.\n", "\nBeautiful room with fireplace by the creek. Enjoyed the rushing water. Would have liked to have had a trail to walk alongside but only short way was possible. Only able to have a partial view standing on left side of the room because another cabin sat in front of us blocking rest of the view. Parking at $18.00/nite was too...\n\n\nMore  \n\n\n", "\nWe stayed this past weekend over Valentine's Day and service was top notch from arrival. We are avid mountain bikers and always make it a point to bring our bikes to Sedona. Normally, we are forced to take the bikes out and drag them into the hotel room. Sars in the valet area took special care of the bikes and...\n\n\nMore  \n\n\n", "\nThe property is gorgeous. The service is exceptional. The food was top notch. It probably helped that we lucked out with beautiful weather in February (75 and sunny during the day). This is the only place we will stay in Sedona.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/6a/63/68/l-auberge-de-sedona.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1475", "title": "BEST WESTERN PLUS Arroyo Roble Hotel & Creekside Villas, Sedona", "rating_string": "4.5", "address": "400 North State Route 89A, Sedona, AZ 86336-4214", "review_list": ["\nMy son and I arrived somewhat late. Room stank of tobacco smoke, but we tried to sleep anyway, considering the hassle of changing rooms. However, I couldn't sleep at all, breathing the horrible cigarette small. Worst of all, in the morning the towels in the bathroom really stank, and were hard to use considering the smell. When I complained, they...\n\n\nMore  \n\n\n", "\nGreat location and room was great. Bed was a bit hard for my taste but everything else was great. We come to Sedona often for anniversary or valentines day, christmas and birthday celebrations and normally stay at L'Auberge de Sedona. We love it there, but when we can't get a room we will stay here. It was very satisfactory. The...\n\n\nMore  \n\n\n", "\nWell ran and very nicely maintained. Staff is friendly, helpful and knowledgeable. I enjoyed conversations with both the evening and day shift. Breakfast was well prepared and varied to suit different tastes. Location is good for walking to shops and driving up Oak Creek Canyon. Lots of little places to relax on the grounds. Beds were comfortable and the accessible...\n\n\nMore  \n\n\n", "\nI booked this hotel because it was listed on the Half Marathon site. It was cozy and perfect. The hot breakfast and bus pickup across the street were icing on the cake. First class hotel with very friendly staff and a breathtaking view of the mountains.\n", "\nStayed here one night just passing through. Very clean and the staff was helpful and friendly Beautiful scenery and walk to everything no need to drive. A nice place to stay that included a free breakfast. Maybe a little pricy for a best western but still worth the money I guess\n", "\nThe view from all rooms at the Arroyo Roble is of the red rock panorama that defines Sedona, and the location allows for easy walking to anything in downtown Sedona. The outdoor pool offers the same great view as the rooms. In colder weather, a good alternative is the indoor pool and workout area accessible to hotel guests. (This is...\n\n\nMore  \n\n\n", "\nMy wife and I spent a week at Arroyo Roble Resort in January. Friends visited and stayed with us during part of the week. The weather was perfect for hiking, sightseeing, and just relaxing along Oak Creek. The Resort is a perfect place to stay. Coming back to the resort each day after a day of exploring, and firing up...\n\n\nMore  \n\n\n", "\nThe hotel was in an excellent location. The room was clean and well organized. The staff cleaned it quickly each day (one time during the time it took us to eat breakfast on site. It was very easy to check in and out. The staff was friendly and helpful.\n", "\nWe had a wonderful couple of nights here. The staff was friendly, efficient and helpful. The room was clean, spacious and the bed firm and comfortable. The views from our room were spectacular. I would recommend this hotel as a great value.\n", "\nThe staff at this hotel really make you feel like family. The fire place in the lobby is so inviting. Stayed in the Creekside Villas this time around and it was perfect. Visiting with my daughter, Aunt and Mum for a long weekend. The villa was perfect. We had room to sit and talk and play games in the evening....\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/05/8a/ec/6c/pool--v905565-19.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1074", "title": "Sedona Rouge Hotel and Spa", "rating_string": "4.5", "address": "2250 West Highway 89A, Sedona, AZ 86336", "review_list": ["\nThe Sedona Rouge Hotel & Spa is a fantastic hotel! We visited for the holiday weekend (President's Day) and had a great time both at the hotel, restaurant and Spa. Our two bedroom suite located in their new building in the rear of the hotel was spacious, clean and tastefully done. You can tell they took great efforts to make...\n\n\nMore  \n\n\n", "\nThe Sedona Rouge is a wonderful place for a spa experience. My husband and I are celebrating our 35th wedding anniversary today, Valentines Day 2-14-16. We did the couples massage and it was amazing. After the massage we soaked in the tub with rose petals all around. It was awesome. Nancy and Bobbi were our therapists and they were great....\n\n\nMore  \n\n\n", "\nWe needed to break up our drive home and stayed here. We were lucky enough to get three of the new rooms (there's 8 of us). The rooms are beyond amazing! We had dinner at Red's, the food was excellent. I wish we could have stayed longer, and I can't wait to go back.\n", "\nThe hotel is well appointed, the room was clean and the ground kept up. We did get free vouchers for a \"small plate\" at Red's restaurant (property restaurant) for each night we were there. We did not use the spa amenities so cannot speak on that, but we would stay here again.\n", "\nWe have stayed at this property with our dog often. We have loved the dog wing which is isolated from the highway noise, facing a courtyard of green grass. Parking is free and easy. The location although on 89A is noisy, the rooms are quiet (but not the ones facing the road). We love the convenience of eating at Red's...\n\n\nMore  \n\n\n", "\nvery nice hotel,personell very gentle.room clean and perfect. amenities super. breakfast very good.\nspent there one week. also location is very good.\nService superb . Restaurant also very good even a bit expensive compared with others in the city.\n", "\nThe hotel is beautiful and there are lots of things to do in Sedona and the surrounding area. Unfortunately the hotel is a gold plated bucket of crap. The staff is rude and everything seems to be an inconvenience and you have to go to management for everything. Thousands of dollars for the family to attend a conference and we...\n\n\nMore  \n\n\n", "\nWe were so pleased with our stay at Sedona Rouge. The rooms are beautiful and the restaurant was an amazing surprise. Food and drinks were exceptional. At first I was slightly disappointed by the location on a busy street. But, after checking-in, the room was quiet and very private. I would highly recommend this hotel to everyone. The patio area...\n\n\nMore  \n\n\n", "\nWow, I have been home for 3 days and finally can begin to put into words my trip to Sedona and about our stay at the Sedona Rouge. I have never written a review on Tripadviser before but because our stay so magical I feel the need to share this time with everyone. First, thank you to everyone at The...\n\n\nMore  \n\n\n", "\nFirst mistake was booking on hotels.com. Hotel received great reviews both on that site and on Trip advisor. I searched for pet friendly hotels. This came up and had fireplace rooms. Nothing on the hotels.com website said dogs were limited to three crappy rooms overlooking a parking lot and hi way. Yet the site let me upgrade by $60 night...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/05/a4/cc/f0/sedona-rouge-hotel-and.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "727", "title": "Adobe Grand Villas Hotel, Sedona", "rating_string": "5.0", "address": "35 Hozoni Drive, Sedona, AZ 86336", "review_list": ["\nThis is well worth the five star rating. I rate a lot of places, as I travel often and I am very fussy. Usually I can find something to say that could make a place a better stay. However with Adobe Grand Villas I can't come up with one negative. The room was beautiful and clean, and everything so well...\n\n\nMore  \n\n\n", "\nAGV have created a fun, comfortable, well thought out experience. Each villa is uniquely decorated, well laid out and made homey with fresh bread baked daily in the room (imagine the smell) and fully stocked with drinks and snacks on the house. The Chef is outstanding and the staff friendly and helpful. I recommend and will visit again the next...\n\n\nMore  \n\n\n", "\nMy husband and I stayed in the Antiquities suite. Incredible! This b&b has everything you need and more. The grounds are beautiful as well as the rooms with lots of detail. Free drinks and snacks, gourmet breakfast, evening hors d'oeuvres, amd daily freshly made bread in your room!\nProbably the best place we've stayed. Can't wait to go back.\n", "\nThis was a great place to stay - expansive, clean, beautiful, well-decorated room. We felt good just being in it. Wonderful service, in-room breakfast was delicious each day. We could not have asked for a better base for this hiking, dining, and shopping long weekend, and definitely plan to be back.\n", "\nWe stayed here a couple of months ago and have such good memories. We reserved the Sage villa which was so beautiful and peaceful. Large bedroom with kitchen, fireplace and a large bathroom with another fireplace. We had dinner prepared and brought to our room. Course by course, Chef Michael prepared an exquisite meal. My wife had the filet and...\n\n\nMore  \n\n\n", "\nWe stayed in the Twin Kyody Villa and it was absolutely perfect! The room was very large, pristinely clean and decorated with great attention to detail. The bed was unbelievably comfortable, the room was completely quiet and the wifi signal was good. There are views of the mountains and a lovely balcony. The breakfasts were a great start to the...\n\n\nMore  \n\n\n", "\nWhen we think of anyplace we've stayed in the past, nothing comes to mind ahead of the Adobe Grand Villas. It it truly our happy place! We went two Thanksgiving weekends in a row. The first time for two nights, and this year for three. Highly recommended!\n", "\nLove the uniqueness of each room. Theres a fireplace in the bathroom and bedroom also a bread maker baking bread in your tiny kitchen for when you arrive. Very cozy and the service is amazing.\nDefinitely will com back.\n", "\nWow where to start ? Having found Adobe Grand Villas on here I have no hesitation in recommending them to you all. From our first enquiry until we left the quality of customer service & attention to detail could not be faulted. My partner & I were flying into Phoenix Christmas Eve at 20.30 which meant that we wouldn't arrive...\n\n\nMore  \n\n\n", "\nNo other Bed & Breakfast, inn or hotel has ever so completely positively overwhelmed the senses as did this wonderful establishment. Our villa, Sagebrush, was sublimely quiet, smelled of fresh baked bread as we entered, was squeaky clean and smartly outfitted and luxuriously fitted with comfortable pillows, bed, robes and an abundance of snacks and beverages. The toiletries were Aveda-...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/06/36/5b/a3/pool--v2519084.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "1282", "title": "Sedona Summit Resort", "rating_string": "4.0", "address": "4055 Navoti Drive, Sedona, AZ 86336", "review_list": ["\nWe stayed here a couple of nights while visiting Sedona. We had a studio apartment that was quite comfortable. Unfortunately it did back up to a major road so noise was a factor.\nThe people in the community seem very nice. We had met a nice couple in the hot tub and enjoyed talking with them.\nThe staff was also...\n\n\nMore  \n\n\n", "\nGreat condo with good views. We had our own laundry and a fully equipped kitchen. The balcony was a bit dark ( the sun never hit it ) but the view of the mountains was lovely. Love all the lovely heated pools and infinity hot tubs! It was nice to have access to a number of outdoor barbecues. They also...\n\n\nMore  \n\n\n", "\nA one week stay at the Sedona Summit Resort might not have improved our auras, but we certainly felt ourselves in a vortex of beauty and calm. Our one bedroom ground floor unit was close to the adult \"Tranquility\" pool and hot tub area, and a short walk to the fitness center, where a morning yoga class was superb. The...\n\n\nMore  \n\n\n", "\nThis was a comfortable condo in a nice quiet resort. We had a very enjoyable trip even though the weather was chilly. The reception staff (Marcus) was friendly and efficient. We arrived at 11:30 PM after a long travel day and that was no problem. The condo was clean and very roomy. Beds were comfy and the bathrooms were spacious....\n\n\nMore  \n\n\n", "\nThis places is simply gorgeous! The staff is wonderful, the rooms are gorgeous, and the scenery is breathtaking. Be sure not to book a studio room but a one bedroom with a full kitchen. It was a great experience for our 35th wedding anniversary. Nice spas and restaurants in the area.\n", "\nSedona is a small town that encourages an \"out and about lifestyle\" and the sedona summit further encourages that. Located at the top of West sedona, about 5 minute drive from downtown, the view day and night is unreal. We were able to jump into the car each morning and evening and head to various locations within 5 -7 minutes...\n\n\nMore  \n\n\n", "\nWe have been to Sedona 6 times & the Sedona Summit is the only place we have ever stayed at. It is the perfect place for us. The resort is a little removed from town(3 miles), the accommodations are first class & they have the views. They also have Diana Cannon who has checked us in the last 5 times...\n\n\nMore  \n\n\n", "\nI rarely write reviews, however I feel it is important to warn visitors what they may be in for while staying at this resort. I will say that the staff was very friendly upon check-in and check-out, however the unit we stayed in was horrible. We had a party of four and were unable to sit and relax together in...\n\n\nMore  \n\n\n", "\nWe stayed at this place during a long weekend and it was great. The staff went above and beyond to make sure our stay was amazing. Also, right outside of your doors you can find a trail to do a hike on. Overall, this place was really well organized and the staff is great.\n", "\nThe Good\nWe have stayed at the Sedona Summit numerous times and have been very satisfied. The last two times we stayed, we were fortunate enough to be greeted and taken care of by Sofia, the assistant front desk manager. Sofia is not only delightful, but very professional.\nAfter a little negotiation, we were able to once again upgrade from...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/02/3d/d3/e8/resort-check-in.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "291", "title": "Hilton Sedona Resort at Bell Rock", "rating_string": "4.0", "address": "90 Ridge Trail Drive, Sedona, AZ 86351", "review_list": ["\nI decided to add on a to my biz trip to Phoenix a weekend in Sedona and stayed at this hotel, I'm glad I did. The entire resort is a wonderful property and the high quality decor is consistent from the lobby, to the public areas right to the rooms.\nThe staff here was extremely friendly and helpful, from the...\n\n\nMore  \n\n\n", "\nWe have been to Sedona many times. Sedona is beautiful and a wonderful place to have a cocktail at sunset. We had never stayed at this hotel before so we tried it and were extremely pleased. Our room was exceptionally clean and very well decorated. The staff were very kind. We thoroughly enjoyed our stay and recommend this hotel as...\n\n\nMore  \n\n\n", "\nWhen check-in, did not be welcome as a hhonor gold member, didn't get any hotel information until I asked.... (Room number, resort map, gold member benefit, breakfast.....none of them). Breakfast credit is only $28 dollars for gold member. Which is good for two single items from menu, maybe can include drink if you order not so pricy items. Or two...\n\n\nMore  \n\n\n", "\nMy wife and I really enjoyed our room at the Hilton. The fireplace is a nice feature and we had a sectional couch to relax on, after hiking the Red Rocks of Sedona. The only negative is the location. It's a ways from downtown Sedona. All in all I highly recommend the Hilton and Sedona!\n", "\nRoom layout was outstanding, The separate living room with fireplace and Sedona views were great for our 3 day stay .The staff went above and beyond to answer all my questions about sunrise and sestet photo sites . Restaurant not so much.\n", "\nHilton Resort in Sedona is absolutely beautiful. We stayed on the third floor and loved our room. It had a sitting room with a king bed in a separate room. There was no bathtub, only a shower, that's all I missed in this room.\n", "\nGood location just off the highway along the scenic byway at the first roundabout. The hotel offered very nice accommodations including a gas kiva in our suite. The breakfast buffet was a little on the pricey side, though the food was good with lots of options. The spa was most inviting and we regret not leaving enough time to enjoy...\n\n\nMore  \n\n\n", "\nI've been going to the Hilton Sedona for many years. Overall, it's been nice, and fairly decent value. However, even after a major renovation, many aspects of the hotel remain dated, such as the heating/cooling system in the rooms. I could never get the system set at a certain temp.\n", "\nThis Hilton has gone through a renovation in the last few years. For a while it was getting old. Have had a handful of meetings at the hotel which has been fine. Knowing where the hotel is located, decided to stay here before the Sedona Marathon. There was nothing special about the hotel or the service.\nWas running the marathon...\n\n\nMore  \n\n\n", "\nNice, clean hotel with very friendly and accomadating staff. Our suite was attractive and spacious and had a beautiful view of the redrocks. There are several restaurants within easy walking distance and a grocery store nearby. However, downtown Sedona is about 10 miles away. Nevertheless, we enjoyed our visit and would definitely recommend this resort to family and friends\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/05/8a/f6/0a/the-hotel--v905908-10.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2300", "title": "BEST WESTERN PLUS Inn of Sedona Hotel", "rating_string": "4.5", "address": "1200 W Highway 89A, Sedona, AZ 86336-5741", "review_list": ["\nGreat price and THE VIEWS!!!!! They have everyone one needs for an enjoyable stay. Wi-fi, breakfast, mini fridge, fire pits.. I was so pleased with this stay! We had originally booked a VRBO but in a serious of unfortunate (weather related) events preventing us from actually getting to the cabin, this popped up on a list of hotels to stay...\n\n\nMore  \n\n\n", "\nNot worth the money. Far to expensive to what you get. Nice room and friendly staff. The pool and fitnessroom was a joke. Breakfast was ok but the sittingarea to small. Bed ok. Some ogf the staff needs to learn more about the area..\n", "\nMy husband and I spent our anniversary weekend in Sedona for the the first time. We had a wonderful time. The staff are great and friendly. We had the view of the red rock from the balcony. The inn is waking distance from the summit trail, whole foods and various stores. At night, the staff turns on the fire pit...\n\n\nMore  \n\n\n", "\nWe had a great time at the Best Western Plus Sedona. We are a running club and we\nwere in Sedona for a race. The staff was friendly & accommodating. The free breakfast\nwas very good. We had a variety of hot food choices. The views from the rooms were\namazing. The rooms were clean and quiet. We used the...\n\n\nMore  \n\n\n", "\nThis is the place to stay! Excellent service! Excellent Room - very clean and updated - wonderful fireplaces in rooms and terraces to sit or look out at the beautiful mountains in front of you! I highly recommend staying here!\n", "\nFrom the moment we checked in to the moment we checked out - not that we wanted to leave - my husband and I, along with our incredibly well-behaved dog (yes, they love dogs here!), LOVED the Best Western Plus Inn of Sedona.\nAnd what's not to love? The location was really quite stunning, the room we had picture perfect,...\n\n\nMore  \n\n\n", "\nGreat stay, hotel very clean and friendly, good sized rooms, some rooms back onto an outdoor patio with fireplaces which was great at night to have a drink and relax, it can be a bit chilly and night so bring a blanket with you! The breakfast is great in the morning, not just the normal dry eggs and gross toast,...\n\n\nMore  \n\n\n", "\nAnd I don't just mean the views from the Best Western Plus Inn of Sedona. I wasn't 100% sure what to expect as my wife and I booked this hotel for 2 nights prior to moving on to a nearby spa for a week. Well, any questions I might have had were instantly dashed once we saw 1) just how...\n\n\nMore  \n\n\n", "\nit was a last minute booking and i got the last available room and steps from Judis awesome restaurant! nice room pool and hot tub great breakfast clean will be coming again with family for spring break 2016!\n", "\nWe love to travel to Sedona regularly and this was our first stay at the Best Western Plus of Sedona. This hotel should be the model for BW world wide. The terrace / patio out the back door of our room has panoramic views of the Red Rocks surrounding Sedona. The staff is very well trained and love what they...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/50/97/7d/best-western-plus-inn.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "781", "title": "Poco Diablo Resort, Sedona", "rating_string": "4.0", "address": "1752 State Route 179, Sedona, AZ 86336", "review_list": ["\nI was very disappointed with quality of the rooms, they need updated badly. There was a refrigerator but no microwave to heat the food. Forget about getting on the Internet, I couldn't download a page. There is a resort fee of $15.00 whether you use the outside amenities or not. The food in the restaurant is very expensive. I don't...\n\n\nMore  \n\n\n", "\nIt's 10:00 p.m. and I have an urge for chocolate M&Ms but can't find a vending machine. Turns out there isn't a vending machine for guests... but there IS one for employees! So the front desk clerk goes out of his way to check in the employee lounge to try and find a solution for my chocolate craving. This is...\n\n\nMore  \n\n\n", "\nA lovely hotel with beautiful views, jacuzzi (in the sun!!) and a golf course! We enjoyed our stay here very much, staff were superb, location is perfect - close enough to the shops to get to but far away enough for it to be really peaceful), all together a very good choice, we will be back!\n", "\nA more magical and soul centering destination can't be found. The bonus of having our room on a golf course and the wonderful staff made this stay perfect! The pool and hot tub also equally relaxing. We found everything about this stay more than satisfying.\n", "\nWe hesitate to write such a glowing review, because we want it to remain our secret hideaway, but it was simply too good not to share. The grounds are absolutely beautiful. It is near enough in town that food and shops are a brief drive away, but far enough that it's QUIET. The room (upgraded to a king suite w/...\n\n\nMore  \n\n\n", "\nFrom check-in to check-out, we experienced top notch service. We were traveling with our boston terrier and they truly pulled out all the stops to make his trip a memorable one as well. The rooms were large, clean and equipped with a giant jacuzzi tub. Just a quick drive to everything....real close to Chapel of the Holy Cross. We will...\n\n\nMore  \n\n\n", "\nMy husband and I stayed here for two nights and we wish we could have stayed longer. Sedona is absolutely beautiful with so many awesome trails to hike. The scenery is spectacular! As for the resort, we had nothing but positive things to say about it. Our room was huge, the staff were very courteous and it's ideally located. I...\n\n\nMore  \n\n\n", "\nWe had such a great stay. We selected this resort because of a conference we were attending was being held there. We were greeted immediately by Gina at the front desk who gave us a beautiful upgraded room and helped us get checked in and settled. The restaurant staff is excellent as well as all the other people we ran...\n\n\nMore  \n\n\n", "\nFantastic hotel. Friendly staff great food and our room is clean comfortable and super gorgeous with balcony fire and jetted tub with an amazing view. We will be back next year for sure. This had been a wonderfully relaxing holiday. We have played tennis and the club welcomed us with open arms so we have joined in drills and doubles,...\n\n\nMore  \n\n\n", "\nTook a quick getaway with my wife to Sedona over the 4th of July weekend and picked Poco Diablo Resort based on the reviews. Was impressed with the views and room size with outdoor patio. Very easy access to downtown Sedona and all of the Red Rock sites.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/09/d7/11/0f/exterior-view-poco-diablo.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "338", "title": "Arroyo Pinion Hotel, an Ascend Hotel Collection Member, Sedona", "rating_string": "4.0", "address": "3119 West Highway 89 A, Sedona, AZ 86336 (Formerly Kokopelli Suites)", "review_list": ["\nWe decided on Arroyo Pinion because it was dog friendly and seemed good for the price and it absolutely was. Our room was spacious, clean and inviting. We had a jetted tub and a fireplace which made for a great Valentine's Day. The bed was comfortable and the shower was very roomy.we also had a private patio out back which...\n\n\nMore  \n\n\n", "\nStay here for 2 nights for are anniversary, The room was comfortable and pretty quite. There was a jacuzzi tub which was a nice plus. It's not in the down town area , but it's a close drive and there is plenty of public parking available, but be careful where you park as some of it has a 3 hour...\n\n\nMore  \n\n\n", "\nWe arrived at the Arroyo Pinion after a very busy day. We were on the ground floor. All night long it sounded like a herd of elephants were above us. When it wasn't walking it was showers and snoring next door. I guess we should have know that it would be loud when we found earplugs in our room. It...\n\n\nMore  \n\n\n", "\nSecond time we stayed at arroyo pinion. The staff is warm and welcoming, sedona helped us with hiking choices. Our room was comfortable with the usual amenties.it is well located but set back from the road so it is quiet. A good deal for the price.\n", "\nWe booked on a third party site, and got a deep discount on our stay. That was about the only plus. This facility has no elevator and no interior entries. You don't see that information on the webpage, so be sure to let them know if you can't do steps.\nThe room was clean, albeit it noisy.... refrigerator running almost...\n\n\nMore  \n\n\n", "\nWe stayed here for a week touring the beautiful area. The entire staff was friendly and efficient. The breakfast manager, Angel, was a gem. The area was always clean and always filled and ready to go. The hotel was located west of Uptown Sedona but still had plenty of great food establishments. Would definitely return when in the area.\n", "\nHad a very enjoyable rest here from our daily hikes for the past few nights. Clean, comfortable, spacious rooms. Pleasant staff. Convenient location. Nice area for breakfast or coffee in the lobby. Nice group rate for our hiking group. Thanks!\n", "\nPool and hot tub closed. Breakfast ok, but not great. Rooms clean, but no cable channels. Clerk that checked us in acted high, or maybe she was. I think we'll go some place else next time. Not one of our best hotel experiences by far!!! There are better choices in Sedona.\n", "\nThis was my first trip to Sedona. Arroyo Pinion Hotel made it a great visit. The room we stayed in was a good size and clean and had a cool little patio. Also a good location and the staff were knowledgable about the area and made you feel at home.\n", "\nThe hotel was great! Staff at check in were overly helpful and so sweet. Will definitely be stay here again. Get the premium suite with fireplace and hot tub. Walked in the room and the fireplace was already on, and the room was so cozy. Slept great both nights. You won't be disappointed!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/04/99/27/15/exterior.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "984", "title": "Desert Quail Inn Motel, Sedona", "rating_string": "4.5", "address": "6626 Highway 179, Sedona, AZ 86351", "review_list": ["\nThis motel looked newly renovated, was very clean and in good location. It was south of the scenic byway and about 10 minutes from upper sedona. Good restaurants near by. We made last minutes rest and it was one of the cheaper inns. Very nice staff.\n", "\nThe hotel isn't in the city of Sedona, Sedona is a very short drive down the same road, but it is in the perfect location to see everything. The staff is very friendly and helpful, our room was clean and large and the beds were very comfortable. I wish the bathroom was a bit bigger but that is minor. The...\n\n\nMore  \n\n\n", "\nThe room was spacious, had nice finishes and was very clean. The office attendant was very pleasant and accommodating. The rate was excellent. It was very close to the conference hotel that was all booked, and it was also close to a grocery store and restaurants. The only downside is that the wifi seemed spotty. Sometimes it requested a code...\n\n\nMore  \n\n\n", "\nGreat place to get a good nights rest! Clean, comfy, quiet, and relaxing. Rooms are big and virtually spotless. Gentlemen at the front desk was very helpful answering any questions, or giving suggestions on things to do. I hope this review helps you to choose Desert Quail for a great experience. Location is not in the town of Sedona (short...\n\n\nMore  \n\n\n", "\nHotel Desk was nice and made sure you knew of several dining options in the area as well as a close grocery store (I did feel like the restaurant recommendations may have need paid advertising but they were still very good recommendations). Accommodations were clean and comfortable. I always appreciate a hotel that is not stingy with the coffee. :)....\n\n\nMore  \n\n\n", "\nThe rooms were newly remodeled and spotless. The location was an easy walk to several great restaurants. The owners were very nice and gave us wonderful suggestions to the area. The large TV, microwave and fridge were a plus!\n", "\nFrom the moment we arrived, our experience of the Desert Quail Inn could not have been better. The manager at reception was polite, helpful and really friendly, and gave great tips for breakfast and dinner spots. The room was large, very clean, and had a really comfy bed, great wifi, and a little seating area. Having a laundry on site...\n\n\nMore  \n\n\n", "\nI can see why the Desert Quail is so highly ranked on Trip Advisor! Everything about this little place was awesome. The man who worked the front desk the entire time during our stay was extremely friendly and very helpful.\nThe rooms are a little older but we had no problems with that. The room was very clean and we...\n\n\nMore  \n\n\n", "\nWe really loved our stay at The Desert Quail Inn. The room was very spacious with a gloriously comfortable bed. Large TV screen and free HBO.\nWi-Fi worked well and we were never bothered by outside noise.\nThe staff seem really friendly and the location is pretty good as well.\nAdd competitive price to the mix and you have a...\n\n\nMore  \n\n\n", "\nThe motel was clean. My husband thought it was in Sedona proper because of the way it's listed. However, we had to drive in to Sedona each day, which took away from the experience. On the bright side there is a highly rated, excellent restaurant located in the strip mall just behind the Quail Inn parking lot called Red Rock...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/04/01/3c/77/desert-quail-inn.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "610", "title": "Casa Sedona Inn Hotel", "rating_string": "5.0", "address": "55 Hozoni Drive, Sedona, AZ 86336", "review_list": ["\nWe just returned from a 2 night stay and absolutely fell in love with this place. We were in the Juniper Shadows room with a beautiful balcony that looked out over Thunder Mountain and the surrounding area.\nCasa Sedona is on the West side of town away from all the bustle fo uptown Sedona but is close to everything Sedona...\n\n\nMore  \n\n\n", "\nWe stayed at the Casa Sedona Inn for 3 nights. Andreas & Sara made sure that are stay was memorable. The place is incredible. The location is beautiful and the accommodations were fantastic. This is the place to stay in Sedona.\nBook it!!!\n", "\nStayed 2 nights at Casa Sedona Inn in February 2016 with my wife. We got upgraded to the Navejo Room which was fantastic - huge space with one of the best bathrooms for a hotel ever including a huge tub and amazing shower. The room also had a fire place and little balcony off the bedroom. While we didn't watch...\n\n\nMore  \n\n\n", "\nWhat a delightful B & B in such a great location and yet so quiet and peaceful. The decor was priceless and the staff very helpful. The breakfasts were unbelievable with a very diverse menu too. What great service. The one staff member even washed our windshield for us on the inside. Enterprise should hire him!!! I would highly recommend...\n\n\nMore  \n\n\n", "\nfirst time to Sedona,great location, wonderful rooms, beds like sleeping on a cloud. wow!! breakfast is on premise and is very good. wonderful service by sarah. thanks to her advice we had excellent dinner also. downtown area good for some shopping.\n", "\nBeautiful surroundings, quiet, gorgeous sunsets, delicious breakfast (actually, the best I've ever had in a hotel!). Rooms are decorated uniquely Southwest and we loved the bathrooms! The staff were very professional and exceptionally helpful and, as stated above, the chef's breakfast is not to be missed! I wish I had taken a picture, but we will be back!\n", "\nWhat a lovely surprise to feel at home while on vacation. That is exactly what I found Casa Sedona to be! I chose Casa Sedona based on prior TripaAdvisor reviews. The best ones are not only accurate, but fall short of what a great place this is.\nIf you are looking to stay in a place that is as good...\n\n\nMore  \n\n\n", "\nEverything about this Inn is fantastic! Very clean and nice! Would definitely come back. Kim and the entire team were very helpful with tips about the area and places to eat. Make sure you dine at Mariposa if you want a great fine dining experience!\n", "\nWe loved it! Very nice, beautiful interior quality, I love the doors in this place!! Breakfast is a little pricey but very good. Get the French Toast, you'll love it. We had the honeymoon suite with the semi-private veranda and it was beautiful. Will def. go back if in Sedona again.\n", "\nThis is truly a very special Inn. My wife and I spent three wonderful nights at Casa Sedona. We did our initial search for a place to stay in Sedona using Trip Advisor. We reserved a room well in advance of our scheduled trip. On our way down from the Grand Canyon we got a call from Sarah asking us...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "571", "title": "Ridge on Sedona Golf Resort", "rating_string": "4.0", "address": "55 Sunridge Circle, Sedona, AZ 86351", "review_list": ["\nMy husband and I chose this resort based on reviews and it delivered on what we expected. Got the one bedroom based on suggestions and it was nice to have a kitchen for breakfast as well as a livingroom for some alone time. The bathtub is huge and great for soaking sore muscles after the many bike rides and hikes....\n\n\nMore  \n\n\n", "\nThe room was fine, although, the furniture in the living room isn't very comfortable. We had a scenic view of the golf course and some rock formations. We made the mistake of agreeing to speak with their timeshare sales people. It was promised to only last 2 hours with no high pressure sales. It took four hours to get out...\n\n\nMore  \n\n\n", "\nTraded through timeshare. Its a Diamond Resort which I have always found nice. 1 bedroom was a decent size for 2 adults and 2 young adult children. Sharing 1 bathroom did get a little cramped sometimes but it didn't ruin our vacation. The lady at check in did not pressure us into seeing a presentation for \"free stuff\". She told...\n\n\nMore  \n\n\n", "\nI recently rented a unit for $300 per night based on the \"nightly rate\". It was non-refundable. Upon receipt of my credit card statement I was charged $900 per night because my party was a group of 3. THERE IS NOTHING in the site or advertisement that tells you it is a per person rate. They were very difficult to...\n\n\nMore  \n\n\n", "\nWe traded a Marriott timeshare for a two bedroom villa at Ridge on Sedona Golf Resort. We loved our week here. The resort is located just south of Oak Creek--convenient to golf, shopping and restaurants. The villas are very spacious and well maintained. We loved the pillows on the bed so much we bought two of them and had them...\n\n\nMore  \n\n\n", "\nGreat place. Very close to all the great hiking trails in the area and being on a golf course pretty much guarantees amazing views. Wife and I got one of the small suites. Very spacious and beds were comfortable. Huge bathroom and having a full size kitchen certainly helps. Get a few things from a store and have breakfast and...\n\n\nMore  \n\n\n", "\nWent for a birthday celebration with friends and found a fantastic place. Rented a two bedroom suite. Wow couldnt have found a better place for 5 people. Sedona is such a beautiful place to visit. The resort has beautiful views. Great places to eat close by. Shopping is a quick beautiful drive.\n", "\nThe Ridges at Sedona is a very nice resort and we thoroughly enjoyed our stay. The staff was helpful with recommendations and reservations. This was our second trip to Sedona and this resort met all of our expectations.\n", "\nStayed for 1 week through New Years. Booked the 2 room lockoff option. The rooms were very nice and spacious. Clean and overall in very good repair. The family was impressed and liked the layout to give you options to have more space for an extended stay. The full sized Kitchens and a washer and dryer in room are nice...\n\n\nMore  \n\n\n", "\nStayed in mid November for 2 nights with my fiance. Had an extremely unfortunate experience while there. I tried to rectify the situation over a private correspondence with the company and never received a follow up, so I thought I would share my concerns and the company's lack of concerns for their guests welfare.\nFirst night of my stay at...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/4b/23/ce/ridge-on-sedona-golf.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1148", "title": "Sedona Real Inn and Suites Hotel", "rating_string": "4.5", "address": "95 Arroyo Pinon Drive, Sedona, AZ 86336", "review_list": ["\nMy family of 3 decided on a Grand Canyon trip over President's Day weekend. From Southern California, we drove first to Sedona and stayed at this absolute gem of a hotel. We had our little dog with us and chose the hotel mostly based on how dog-friendly it was...so I wasn't expecting it to be so amazing! We were checked...\n\n\nMore  \n\n\n", "\nEverything you could ever ask for in a hotel. This hotel is located not too far from the main strip in Sedona, and was a very comfortable stay. I would recommend this to any visiting the area that aren't looking to spend a massive amount of money.\n", "\nOne of the nicest places I have ever stayed. Room was clean, large, and comfortable. Had a fireplace in the room. The front desk was friendly and helpful. The breakfast was just shy of going to a restaurant ad ordering off a menu. I can't say enough about it. Will be back soon.\n", "\nThe Inn is clean and comfortable with basic amenities. The breakfast buffet was also kept very clean and well stocked. The food quality was very good. The entire staff was very friendly and entertaining. The inn is located within a few miles of dining and shopping areas.\n", "\nWe were here for 3 days. Our corner room was huge. It had 2 TV's and a gas fireplace. It is so nice to have the couch and easy chair at one end of the room and the bed at the other. The facility is very clean and well maintained. Sedona can be expensive, but this was reasonably priced for...\n\n\nMore  \n\n\n", "\nWe have booked a deluxe king bed suite in this hotel long in advance and were expecting a nice suite that this hotel had pictured on their website.\nInstead, we were given a second floor corner suite, which had stairs (without elevator) and which was facing a major roadway, so we had to deal with traffic noise all night long....\n\n\nMore  \n\n\n", "\nWe stayed here on our first night in Sedona on our way to Mi Amo. We were greeted with a complimentary upgrade to a fireplace suite. They have coffee, water and a free breakfast in the lobby and up to date movies that you can rent and they even give you microwave popcorn with the movie. We would definitely come...\n\n\nMore  \n\n\n", "\nMy boyfriend and I spent 4 nights with our dogs. The staff was great,. They gave the dogs bowls, leashes and biscuits, There was a fenced pet and family area, where the dogs could be off leash. The area was well landscaped, very clean. Our room was great, the bed was comfortable,everything was above average.We will be staying there again...\n\n\nMore  \n\n\n", "\nComfortable and quiet room in a convenient location.\n* located very near road going into Boynton Canyon (location of business meeting)\nWould like to bring my family here some time.\nOn edge of Sedona .. easy to go into town .. quiet place to spend the evening.\n", "\nI don't have anything negative stay . Room was spacious and overlooked the pool area and had a fireplace , fridge and microwave. Employees Brian and Edwina plus the concierge were extremely helpful . They gave us coupons and discounts on several places without us even asking for them . The breakfast every morning was much better than your typical...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/09/ec/2d/c3/sedona-real-inn-and-suites.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "819", "title": "The Inn Above Oak Creek Hotel, Sedona", "rating_string": "5.0", "address": "556 Highway 179, Sedona, AZ 86336", "review_list": ["\nThe Inn Above Oak Creek was very comfortable with a beautiful view of rock formations and the creek from inside the room and on the balcony. We stayed in room 12 which has a king bed and large jetted tub. The staff was very helpful and friendly. I highly recommend The Inn.\n", "\nThis was my family's first trip to Sedona. It was a short trip to celebrate by 30th birthday and our accommodation was perfect. It was within walking distance to great restaurants, cafes, souvenir shops and bars. The staff was very friendly and personable. The rooms were clean and included private balconies with amazing views. My family and I will be...\n\n\nMore  \n\n\n", "\nFrom the balcony of our room (11), we were able to look out on Oak Creek and two rock formations, which glowed with sunrise and/or sunset. The staff couldn't have been more helpful! The Inn Above Oak Creek was the perfect place to celebrate our anniversary.\n", "\nThe Inn Above Oak Creek came highly recommended from friends. The Inn exceeded all of our expectations. We stayed in room 11 which had wonderfull views of Oak Creek as well as the mountains. The staff went out of their way to make our stay enjoyable. We loved Sedona and when we come back we will be staying here.\n", "\nmy wife and i spent 2 night in this hotel we booked room 13 has nice scenic vue from the top the service was nice i highly recommend it to everyone ! we missed our memories for sure we will come back !\n", "\nWe love Sedona and wouldn't consider staying anywhere else. This was our third visit to The Inn Abive Oak Creek and it was yet again a wonderful experience!! See ya next year!!! Special thanks to Victor and the staff!!\n", "\nInn Above Oak Creek was a great choice. Excellent hospitality, comfortable accommodations, very helpful staff. Walking distance to great shops and restaurants. Highly recommend pork tacos at Hudson's across the street! We will definitely stay here again if and when we return to Sedona. I would recommend Inn Above Oak Creek to others traveling to Sedona.\n", "\nOur room with a balcony that overlooked Oak Creek with fireplace and large jetted tub was exceptional. It was a wonderful retreat to return to after hiking beautiful Sedona. The large common room with large fireplace was comfortable, and the continental breakfast was fine. Wakyna greeted us and was eager to help us plan our stay in Sedona. Many stores...\n\n\nMore  \n\n\n", "\nI try to visit Sedona in winter and summer every year. It's just magical. For what I want--comfort, beauty, utter relaxation--there's nowhere better than the Inn Above Oak Creek. Innkeepers Victor, Wakyna, Amberli (and occasionally the owner, Spence) welcome me back like family. The view of red rocks and Oak Creek from Room 12 is, I think, the best in...\n\n\nMore  \n\n\n", "\nThis is a perfect place to stay while in Sedona. My husband and I have stayed in many other places in this beautiful area, but The Inn Above Oak Creek is right up there with the best! Victor rang us to let us know that our room was ready around 11AM which was perfect as we had just arrived in...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/05/1d/60/37/inn-on-oak-creek.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "1246", "title": "The Orchards Inn of Sedona Hotel", "rating_string": "4.5", "address": "254 Highway 89 A, Sedona, AZ 86336", "review_list": ["\nAs a female traveling solo, I found The Orchards a perfect place to stay. The views are truly amazing from the balcony, and the fireplace was a warm addition each night. Located in Uptown Sedona, it made walking to good restaurants and shops very easy. Clean and quiet, I was happy to spend a week here.\n", "\nWe had 3 nights at this wonderful establishment! Staff were delightful on arrival, and our room, a 1 bedroom suite, was cosy and had the most magnificent view! Located in Uptown Sedona, and an easy walk to shops and restaurants. Would love to return.\n", "\nReally nice when I stayed there during the off season. During the high season you will be in the middle of everything and won't have to troll for a parking spot in up town. Stayed on top floor in the main building with a beautiful view.\n", "\nOk. So the best room Is 433 because it is top floor corner room with almost 260 degree views. The rooms are a bit out dated, but are clean and the fireplace is a really nice addition. Breakfast is included and is not bad. Staff is excellent, pool and hot tub are great! The location can't be beat because you...\n\n\nMore  \n\n\n", "\nCannot say enough about this property. The staff, especially Ms Kimberly Hough who recommended wonderful tours prior to our arrival and helped make changes due to Winter Storm Jonas in NYC, were wonderful!! The room was fine, we had the King Deluxe on the 3rd floor. But its the uptown location and the view that makes this place.This is NOT...\n\n\nMore  \n\n\n", "\nI was really impressed with my room, I got upgraded, woohoo! Visiting from Canada, the room prices in Sedona were looking a little crazy, but this place suited my budget very well, cos really I needed a room to sleep in as I was out touring during the day but I did want a view, and what a view.......just fantastic....\n\n\nMore  \n\n\n", "\nOur biggest regret was that we were only passing through Sedona and stayed here one night. The young woman at the front desk was an absolute delight to deal with. She graciously answered any questions we had and called us after we got to the room to make sure everything was in order. Location of the hotel couldn't be better,...\n\n\nMore  \n\n\n", "\nWe checked in after dark and woke up to truly breath taking views from the front parking lot entrance. The room was just OK, but had a gas fireplace and was very clean.\nThe staff was helpful in a \"laid back Sedona\" way.\nThe location is at the north end of town, not so close to the artsy part, but...\n\n\nMore  \n\n\n", "\nWe stayed for five nights. The Orchard's inn is the perfect place to say in Sedona. When you visit Sedona all the directions are from the \"Y\" where 87A and 178 intersect. The Orchard's inn is located at the \"Y\". The pink jeep, the trolly, shopping and everything else is right at your doorstep. Every room in the Orchard's inn...\n\n\nMore  \n\n\n", "\nThe title says it all - you just can't beat this location. A combination of picture perfect views of the red rocks of Sedona plus its right off the main street so you can park your car and walk to a good range of shops and restaurants too. Check in was efficient and the staff friendly and helpful. Breakfast is...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/0a/16/21/53/red-rock-king.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "721", "title": "Hyatt Pinon Pointe Resort, Sedona", "rating_string": "4.5", "address": "1 North Highway 89a, Sedona, AZ 86336", "review_list": ["\nI feel very comfortable recommending this hotel. We stayed in a one bedroom suite. The room was immaculate and decorated with the southwest decor and colors. The fireplace made it very homey. We even had our own covered patio with a table and chairs. The kitchen had everything we needed for cooking. I enjoyed having access to the washer and...\n\n\nMore  \n\n\n", "\nThe location is great, the rooms, and views fantastic but the best is the service. Today we watched the Super Bowl in the recreation room. Cliff, the bellman and Chis Hite didn't stop accommodating us all afternoon. The kept coming around asking us if we wanted or needed anything else. Thank You.\n", "\nAs an owner of Hyatt Residence Club or the timeshare part of Hyatt, I was able to book a week in a studio unit at Pinon Pointe in Sedona to explore the surrounding area to see the Red Rocks of Sedona.\nLocated in Sedona which is a ruggedly area in the SouthWest, Hyatt Pinon Pointe is well located near a...\n\n\nMore  \n\n\n", "\nWe stayed at the Hyatt because our tour of Sedona was to pick us up at the facility....our accommodations were very nice and the views surrounding our room were spectacular...everyone we encountered was very friendly and helpful.....it also has an excellent location.\n", "\nStayed in the 'vacation property' side, since I'm a HVC owner.\nLocation-great location with really good views.\nAccomodation-stayed in a single bedroom which included the full kitchen, living room, dining area, washer/dryer, etc. Generally well kept and comfortable. The fireplace was nice and was natural gas. The TV in the bedroom is a bit small, the TV in the main...\n\n\nMore  \n\n\n", "\nI was worried reading some of the reviews but this place exceeded our expectations. I had wanted to stay at enchantment but due to high season, the 2 bedrooms were around $1200/ night so we booked the Hyatt at a quarter of the cost. Everything was great... The location is perfect, the rooms must have just been remodeled, the views...\n\n\nMore  \n\n\n", "\nWe have stayed at this resort numerous times over the past several years, and it never disappoints!\nOur most recent stay was two weeks in November; I was celebrating my birthday and it was the perfect place to invite family and friends to join us!\nThe location and views cannot be beat; you are right in the middle of it...\n\n\nMore  \n\n\n", "\nWe requested a villa with a view, which we were given, upper level and it was lovely. The rooms were comfortable with a fire place in the living room, the bed was comfy. The highlight of the place is the pool area, situated high on the property and the views are gorgeous.\n", "\nThis is one of my favorite places to stay in Sedona. It is in the center of everything. The rooms are nicely appointed and comfortable. I like the fireplaces and full kitchens. My only hesitation here is the sales pitch for the time shares at check in. So, know going in that they want you to see the \"concierge\" who...\n\n\nMore  \n\n\n", "\nWe shared a two bedroom apartment on the ground floor with friends who are timeshare owners. It was a perfect arrangement with my husband and I in the connecting studio unit which had a king bed, bathroom, TV, microwave, and bar fridge while our friends had the larger unit with fully-outfitted kitchen, dining area, fireplace, two TV's, separate bedroom and...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/0a/36/89/f3/enchanting-views-of-the.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "458", "title": "Junipine Resort, Sedona", "rating_string": "4.5", "address": "8351 N. Highway 89A, Sedona, AZ 86336", "review_list": ["\nA great place to spend a few days. Wonderful southwestern style furnishings in a condo deep in Oak Creek Canyon beside beautiful Oak Creek. A fireplace with wood replenished daily in the living room and in the bedroom completes the picture!\n", "\nWe spent 6 nights at Junipine. We had a good unit but it was a bit tired. We moved to a second unit that was incredible! The staff, all included was wonderful. The comfort of the accomodations can not be matched for the price and the views are amazing.\n", "\nJunipine is a pretty resort, about 15-20 minutes north of Sedona. Idea for peace and quiet. We were impressed with the cleanliness of the our condo/townhouse. Two large working fireplaces, kitchen and a large bathroom. Would absolutely stay here again.\nWi-fi was a little spotty, and limited cell service, although not an issue for us.\n", "\nMy husband and I spent 2 nights at the Junipine Resort in September. We got one of the riverside townhouses and it was so worth it. There was a king size bed in the bedroom with a fireplace and a fireplace in the living room. They had a nice little kitchen and a loft. There was also a large porch...\n\n\nMore  \n\n\n", "\nCame here in November and December. Stayed in Cabin 5 in November. Nice area by the creek; but the cabin needs remodeling. Came back in December and requested a remodeled cabin and was given Cabin 1. Stayed six days and made great family memories. Had plenty of room, kitchen was fully stocked and had room for our Christmas tree. Housekeeping...\n\n\nMore  \n\n\n", "\nGreat place. Beautiful Grounds. Great place to stay for large family gatherings. Individual condos allow the convenience of being close to each other and the needed separation to get away from everyone when needed.\n", "\nThe setting was just perfect for a \"girls\" getaway. Ample space for 4 of us on our annual trip. The setting was just rustic enough with all of the essentials, including a nicely stocked kitchen, clean and neat beds and baths, and wood burning fireplace-ready to go. Great hiking trails nearby, as well as Sedona's plethora of activities and great...\n\n\nMore  \n\n\n", "\nVery clean •• comfy ••2 fireplaces ••patio deck with furniture ••great views••quiet••by creek ••spacious••master with bathroom and shower and fireplace with sliding doors to patio ••another room with 2 queen/ full beds ••full kitchen •• forest views •• another level with two twin beds •• non-smoking ••\n••restaurant ••cafe •• trail\n", "\nLovely scenery, but there was mice in our suite. Be credulity not to leave anything on the counter. The suite was not clean and the bedding smelled like stale farts. There is no cleaning service but you can ask for clean towels. The front desk staff is always on the phone.\n", "\nBeautiful setting, surrounded by the mountains, quiet and cozy. We rented a two bedroom cabin, very spacious with kitchen, two fireplaces and a loft which has two addl. twin beds. Great big wrap around balcony off living room with access also from master BR (with tables/chairs). The kitchen is fully equipped, we made breakfast each morning which saved $$, went...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/05/8a/f8/a4/forest-view-creekhouse-with-hot-t.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "404", "title": "Arabella Hotel Sedona Motel", "rating_string": "4.0", "address": "725 Highway 179, P.O. Box 180, Sedona, AZ 86336 (Formerly Kings Ransom Hotel & Inn)", "review_list": ["\nWe really did not expect much when we booked the Arabella. We booked it largely because the couple we were traveling with had a dog with them and it was the least expensive option that would take a pet. We were pleasantly surprised both in the size and comfort of the rooms and jus the over all experience. We have...\n\n\nMore  \n\n\n", "\nArabella is a wonderfully relaxing destination in beautiful Sedona! Minutes from town, Tlaquepaque and all the wonderful restaurants and shops! The staff was very welcoming and friendly, probably the fastest check-in and check-out we have ever experienced. The room was very clean and inviting; the views from our balcony were breath-taking! The wait at the Elote Restaurant was well worth...\n\n\nMore  \n\n\n", "\nI'd like to see the property when the renovation is done. Nice location, nice room, very nice staff. The outside of the hotel could use a little sprucing up, but that might be scheduled for a bit farther down in the renovation process.\n", "\nA step up from AmericInns. Great value! Good location; a several block hike at a steep incline to center of town not very far from the major shopping area. Quiet, although walls are paper thin so it depend on your neighbors. Friendly, eager-to-please service: their hearts are in the right place, although they probably need more training and better management....\n\n\nMore  \n\n\n", "\nIf you are going to stay here bring ear plugs. The walls are too thin and if the people next door came from a trailer trash community they will be drunk and yelling all night and you won't get any sleep.\n", "\nThe price was right at this hotel. The staff was very welcoming and we liked our room. The complimentary breakfast was also very good. The popular Etole restaurant is on the property and the Hudson Restaurant is in the Hillside shopping complex just up the road (very easy 5 minute walk). There is also an Irish pub in that same...\n\n\nMore  \n\n\n", "\nThe hotel was chosen for us as a promo for doing something -- but it is definitely someplace we would consider staying again. Room was extremely clean (which seems an unusual commodity in smaller hotels.) I am guessing this is an old motel with many additions, but it's been wonderfully restored. Decor is nice quality and fresh-looking; it looks like...\n\n\nMore  \n\n\n", "\nWe stayed at the Arabella in early February for one night. We were greeted by a very bubbly person who was extremely helpful and efficient. We had the same experience at checkout with a different clerk.\nThe hotel was just renovated and the room we had was surprisingly large and comfortable. The room was clean and the bed was comfortable....\n\n\nMore  \n\n\n", "\nThough the hotel was centrally located. Rooms were clean and spacious. Not luxury. Bathroom sink area is open to the room. Could hear the neighbors toiler flush very loudly. Our toilet ran a long time. Definitely a dated bathroom, but clean. Next to one of the best Mexican restaurants in the city. Hotel is under construction. It starts at about...\n\n\nMore  \n\n\n", "\nChecked in yesterday for a 2 day stay in Sedona. The woman at the desk was so friendly and upgraded us to a renovated room (I think all their rooms are getting renovations) with the most gorgeous view from the balcony! Room is very clean, beds are comfortable and the shower had really good water pressure (very important for us!)...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/0a/02/b9/33/arabella-hotel-sedona.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "663", "title": "Las Posadas of Sedona Hotel", "rating_string": "4.5", "address": "26 Avenida de Piedras, Sedona, AZ 86351", "review_list": ["\nMy wife and I came to Sedona to relax, explore some of the natural beauty of the area, and carve out some personal time for each other.\nThis hotel is located in the Village of Oak Creek, just a few minutes south of Sedona proper on Route 89A. We very much enjoyed that the Village was a bit removed from...\n\n\nMore  \n\n\n", "\nWe traveled to Sedona many times but this was our first visit to Las Posadas. The rooms are beautiful, the staff is friendly and helpful, the\nproperty is quiet, and the breakfast is great. Be sure to ask for a room with a view. There is also a pool and hot tub. But we were in the wrong season to...\n\n\nMore  \n\n\n", "\nBritney at the front desk went above and beyond to make our friend's trip special! We wanted to do something special for our friends and order them Champagne and Strawberries, but did not know we needed to give a 24 hour notice, I asked what she could do, she called me back in less than 10 minutes and made it...\n\n\nMore  \n\n\n", "\nWe stayed 2 nights in a suite which had a king bed, sitting area with small table and chairs plus a sleeper sofa, a large bathroom with a double vanity, large garden tub, and a walk-in shower, and a see-through fireplace. I surprised my husband with the romance package - sparkling wine, chocolate covered strawberries, and rose petals throughout the...\n\n\nMore  \n\n\n", "\nWe arrived on New Years Eve and stayed through the weekend for our daughters wedding. The location was great - the wedding was at the golf club across the street. The rooms were comfortable and inviting with a Southwestern flair. We had 3 suites for the family and also booked a Villa for the stay. What a great combination. The...\n\n\nMore  \n\n\n", "\nWe stayed here for three nights and we're glad that we were able to avoid the busy downtown streets of Sedona. Love the suite and privacy at this location. The breakfasts were great (Chef Jeff!). A recommended stay.\n", "\nVery friendly front desk staff making it easy and seamless to book. Beautiful and cozy accommodations with fireplace in the villa for this chilly weather, also mini kitchen to store food and make coffee if need be. Chef Jeff from Boston is charming and breakfast delicious! Love the location of this B&B being just on the outskirts of the main...\n\n\nMore  \n\n\n", "\nWe stayed here for two nights at Thanksgiving. What a treat. Our room (#45) was great, wonderful view, so peaceful and nice. I can't say enough about the staff people that we interacted with....just great. From the front desk to the chef to the housekeepers, all were friendly, helpful and appropriate. The only (very minor) complaint that I had was...\n\n\nMore  \n\n\n", "\nFirst time visiting but won't be our last! We found this gem in the Village of Oak Creek in the beautiful red rock oasis on our way to Sedona. The rooms are very comfortable with a dual sided fire place that kept out the fall chill in the air; one side facing the bedroom & the other side facing the...\n\n\nMore  \n\n\n", "\nI noticed this little place driving down the road. I stopped in & Brittany took the time to show me around & some of the rooms. She explained at length the policies & procedures. When I booked a stay a month later, I was able to check in early & was given my choice of room. I was introduced to...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-fw/05/8a/fe/62/one-bedroom-villa--v906431-79.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "429", "title": "Bell Rock Inn Hotel, Sedona", "rating_string": "3.5", "address": "6246 Highway 179, Sedona, AZ 86351", "review_list": ["\nSedona is a beautiful area and most visitors will find themselves outside enjoying nature's dynamic display. With that understanding - the Bell Rock Inn is showing its age and not in a good way. Security locks that do not lock,appliances and exhaust fans that are extremely loud and bathroom tile that is in need of replacement. Also as a timeshare...\n\n\nMore  \n\n\n", "\nBest stay just outside of Sedona in our 4th visit there. Reasonably price and slightly tucked outside the main stream of the tourist sector. Wonderful accommodations and very reasonably prized. Will be back again.\n", "\nThis was just what was needed for our family as most places wanted to double up on rooms therefore charging more. This has the room! It also had a nice mini kitchen with a dishwasher. We were pleasantly surprised! The fireplace was a nice touch. 2 baths were helpful too. We were able to get rested up for the next...\n\n\nMore  \n\n\n", "\nWe stayed two nights here for less than the cost of a standard motel. Make sure you ask for a room with a view. Accomadations were spacious and comfortable with a small kitchen area. This unit had a small patio deck which was great for sipping morning coffee. Many similar properties in the area do not have this feature. My...\n\n\nMore  \n\n\n", "\nYou check in and already they try to sign you up for a timeshare presentation. The facility is old. Likely circa 1970's. The efficiency apartment was for handicap, which is okay by me. There were two washing machines and two dryers but one of the dryers was out of order. I had to wait an extra hour for my turn...\n\n\nMore  \n\n\n", "\nThe staff was very helpful. The rooms were old and needed a major renovation. The lock on the back entrance didn't work. When we arrived the hallway and a very strong odor from people cooking. The kitchens have no ventilation.\n", "\nThis week stay was a \"free week\" courtesy of our Interval membership. Actually the charge for the week amounted to about one night at a decent hotel, so it was a bargain. The studio we had was adequate but was showing its age. However, it was upgraded with new drapes, sheers and a valance while we were there. The fitness...\n\n\nMore  \n\n\n", "\nWe stayed as Diamond timeshare owners so our unit is like a 1-bedroom apartment, and there was everything we needed for the whole week. The staff all went out of their way to answer questions and respond to a maintenance issue. This was my second stay there and I like this resort and its location, away from the crowds but...\n\n\nMore  \n\n\n", "\nThis was a short notice trip to celebrate our 43rd Anniversary. We always enjoy Sedona and had not been there for several years. Bell Rock inn is before Sedona in Oak Creek Canyon. As others have written, it is quiet and peaceful. The staff was very friendly and efficient and check in was a breeze. The room too was efficient...\n\n\nMore  \n\n\n", "\nWe spend two nights at the Bell Rock Inn, and it was fine. We had a one bedroom suite. The room was clean, and there was a full kitchen in the unit. The staff at the Bell Rock Inn was very friendly and helpful. The reason I am rating the Bell Rock Inn as Average is that it is a...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/08/2f/91/2d/pool-view.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "721", "title": "The Views Inn Sedona Motel", "rating_string": "4.5", "address": "65 East Cortez Drive, Sedona, AZ 86351", "review_list": ["\nPROS: The hotel was quiet and very clean. We arrived on a Saturday night and were greeted by name by the front desk agents. Our stay was pleasant and we had all the amenities promised: free continental breakfast, wifi, plenty of toiletries and fresh clean towels in the room.\nOverall our stay was peaceful. BUT...!\nCONS: The walls are very...\n\n\nMore  \n\n\n", "\nThis motel is nestled quietly among the red rocks. it is not in the busy touristy downtown of Sedona, but rather in OakCreek Village a ways outside of Sedona. Our beds were comfortable, the accommodations were gracious. We had friends over and there was enough room to sit around and have a glass of wine. The saff was friendly and...\n\n\nMore  \n\n\n", "\nOur stay at The Views Inn was a pleasant surprise. First of all, the rooms were priced at least $50 less than other hotels just a short distance away. Secondly, we were impressed by the cleanliness of the room. And, finally, the hotel staff was exceptionally pleasant and helpful, and they served a continental breakfast with more food options than...\n\n\nMore  \n\n\n", "\nWe really liked this place. We still had great vies from the hotel but were a little ways from the craziness of the tourist packed Sedona. The breakfast was good. Rooms were clean. The desk people were helpful and nice. There is only one very important thing you need to remember about this place. Stay away from the fake Tourist...\n\n\nMore  \n\n\n", "\nThe Views Inn is 15 min south of Sedona. It is near so many hiking and biking trails. Some are easy and others are for advanced hikers. The trails are magnificent and it was worth staying at the Views so that we could get to the trails early in the morning. The Inn had very clean rooms and was quiet....\n\n\nMore  \n\n\n", "\nWe booked The Views Inn before we left England at a very reasonable price.\nWe were pleased with our room and the location of the Motel.\nThe staff were always very helpful and pleasant.\nOur booking was for 2 nights but we stayed for 4 nights as we enjoyed Sedona and every thing about it was good.\n", "\nLovely setting, nestled among red rocks. Friendly and accommodating owner/manager and family. Clean and modern rooms. Quiet. Easy to get to and from Sedona proper. Complimentary breakfast is just right. Moderately priced, a good value for the area and the accommodations. Would definitely stay there again.\n", "\nWe stayed at The Views Inn Sedona for one night. The manager was friendly, accommodating, and very helpful, showing us the best places to view during a one-day stay, recommending we begin our tour with a stop at the Ranger Station (a very good idea), providing assistance in locating a restaurant for dinner, and checking in with the airline for...\n\n\nMore  \n\n\n", "\nin sept-2015 i was in sedona in views inn hotel for 3 nights. In the early morning with sunrise, i've seen a marvelous view of \"RED ROCK\" mountain,which i've never seen before. staff of the hotel is very familier & the facility in hotel very nice. They've a veri nice accomodation for the tourists.Free wi-fi, swimming pool etc. I'm going...\n\n\nMore  \n\n\n", "\nWe had booked to stay here in Oak Creek as it seemed a good value for money option just a little south of Sedona.\nAlthough located about five miles south of Sedona itself, it's a great place to stay.\nThere is a garage/fuel station across the road and also a very small retail park just a block away.\nThe hotel...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "727", "title": "Days Inn Sedona Motel", "rating_string": "4.0", "address": "2991 Hwy 89-A West, 3.5 mi West of Junction 89A & 179, Sedona, AZ 86339", "review_list": ["\nI was nervous about booking these two rooms before we got here because I thought for the low rate it couldn't be that good. I was relieved when we arrived the staff was very nice and the rooms were good and clean, also comfortable and right in the center of all the activities in Sedona. I would stay there again....\n\n\nMore  \n\n\n", "\nWe stayed two separate nights, coming and going from the Grand Canyon. First room was wonderful, but the second time was a different room (not as nice, but larger). Very comfortable rooms, and clean. Breakfast was a disappointment, so we skipped on that. Staff were pleasant and welcoming. Good value in a very expensive (but beautiful) area of Arizona.\n", "\nRoom was good size, everything worked and it was a pleasant stay. We were very disappointed with the \"breakfast\" At all other hotels we stayed during our sightseeing trip of Arizona, most had eggs, bacon or sausage, fruit, cereal, yogurt and waffles. The only choices we had were oatmeal, toast, cereal and banana. Also, in the bathroom there was a...\n\n\nMore  \n\n\n", "\nWe stayed here just to sleep after seeing Sedona. The sleep was good. Breakfast was skimpy. Sedona is a beautiful place but like any tourist trap it is costly. With all that in mind, this Day's Inn was acceptable. In a more reasonably priced area we would look for more amenities.\n", "\nI recently stayed at the days inn in West Sedona. It was a perfect hotel for me. Clean, comfortable and spacious, quiet and breakfast was delicious, and the service was wonderful! Thank you very much I would stay here again for sure!\n", "\nThis was a comfortable stay for anyone on a budget. I was there for a week. It was clean and easy to get to and from so it suited my needs very well. The free breakfast was terrible but the staff were nice and friendly.\n", "\nWe stayed at Days Inn in Sedona for five nights hiking and mountain biking in Sedona Red Rock country. The motel is a little bit on the far end of 89A, but still close enough for short walks to nearby restaurants in the evening (if you don't want to drive to other restaurants a few miles away, that is). Worth...\n\n\nMore  \n\n\n", "\nThe rooms were clean, beds comfortable, and the staff was nice and friendly. And the breakfast actually had a healthy choice--unsweetened cooked oatmeal to which you could add bananas, raisins, or other toppings.\nVery happy with this hotel for the price.\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "265", "title": "Wyndham Sedona Hotel", "rating_string": "4.5", "address": "1500 Kestrel Circle, Sedona, AZ 86336", "review_list": ["\nWe stayed in a beautiful big appartment with a bedroom with an ensuite bathroom, a huge fully equiped kitchen. The living room was also big and comfortable.\nWhen we checked we were invited for a timesharing meeting. We denied it.\n", "\nWant to feel welcomed and appreciated? Book a room here.\nThis condo has all the amenities and great mattresses!\nWe even rented a walking stick for a hike! Great activities every night.\nQuiet rooms and good pool.\n", "\nWe just returned from a week's stay at the Wyndham Sedona, booked through an RCI exchange. From start to finish, everything about our stay was great. Before going, I had read the negative reviews about this resort on TripAdvisor and was concerned. I contacted Assistant Manager Alan Holt by email and then by phone prior to our visit. He responded...\n\n\nMore  \n\n\n", "\nThe Wyndham in Sedona is really a fantastic property. It's very spread out but easy to get around. It has a great location on the main road with dining and other spots right across the street. It's also about 5 minutes from downtown Sedona. The views from the resort are amazing.\nThe room was fine, standard one bedroom suite. Very...\n\n\nMore  \n\n\n", "\nThere have been some complaints here about the small 1 bedroom units. If you want space, don't skimp, reserve the larger 1 bedroom or the 2 bedroom floor plan, and bask in spacious accommodations! We had a 2 bedroom for our family of 3, and were left disappointed that no one else could come with us to share this amazing...\n\n\nMore  \n\n\n", "\nWe had stayed in a Wyndham in Pompano Beach and were pleasantly surprised. Our one bedroom deluxe was much larger than that in Florida. The room was very clean and the kitchen had all appliances we needed. We ate in for all breakfasts and lunches and two dinners. We were asked to attend a free lunch and seminar (read time...\n\n\nMore  \n\n\n", "\nHad a two bedroom lockout unit through VRBO. Full run of place, pool & hot tub were fantastic and open 24 hours. Only bothered once about the time share presentation but after a quick \"no thank you\" we never heard from them again. Units were fully supplied including washer and dryer, dishwasher, etc. Very nice property.\n", "\nThis resort is on the western outskirts of uptown Sedona. There is a Safeway supermarket not far away, and you can walk to several restaurants. The pool and hot tub are open 24/7 to see the stars. Quiet, well-maintained, well-stocked unit. We had a one bedroom deluxe on the ground floor. No view of Sedona hills, but comfortable bed and...\n\n\nMore  \n\n\n", "\nThis is a decent place. Nice and clean and well kept. Not the fanciest place you have ever been but definitely not the worst. The main issues that detract from it are the check in process which is like an indoctrination and is a huge pain when you are tired and have traveled all day and just want to get...\n\n\nMore  \n\n\n", "\nWe booked 4 units at this property. The condos were nice, large and well-maintained. The property had a nice variety of amenities. However, the excruciatingly long check-in time was nearly unbearable and, of course, followed by a sales pitch. As nice as this property is, I won't go through that process again.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/f5/f7/ac/wyndham-sedona.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "709", "title": "Southwest Inn at Sedona Hotel", "rating_string": "4.5", "address": "3250 State Route 89a, Sedona, AZ 86336", "review_list": ["\nWe always stay here on our annual trip to Sedona. This year I wasn't as happy as in previous years. Not sure if new management but they seemed somewhat disorganized when clarifying our reservation....I got 5 phone calls! The rooms are nice and big and comforting but the amenities were not as good this year. No iron ( not sure...\n\n\nMore  \n\n\n", "\nWe always stay at Southwest Inn when we visit Sedona. Clean, beautiful and comfortable Southwestern decor, great location, very nice breakfast, hot tub, quiet (away from congested downtown), close to hikes, PLUS dog friendly! I guess thats why we always chose to stay here year after year.\n", "\nMy wife wanted to stay in Sedona because we were two days ahead of schedule on our escape from the freezing North. We stayed here on the basis of positive reviews and were not at all disappointed.\nI got a good rate for booking on line at the hotel's website - better than any of the pop up brokers!!!. We...\n\n\nMore  \n\n\n", "\nWe stayed here just for one night but it has definitely been one of the top hotels I've stayed at. It was very homely and small. The owner was great, very friendly, helpful and gave us some tips on where to eat and what to do. The room was very clean, the fire place definitely was a luxury especially with...\n\n\nMore  \n\n\n", "\nThis motel is comfortable and clean, with great amenities. But what really impressed me is what happened following a minor disappointment. I called the front desk to ask if I could borrow a corkscrew, and where I might get some ice. I was told that the front desk was busy, but that both were available there. So a few minutes...\n\n\nMore  \n\n\n", "\nI will try to avoid Sedona post Christmas (busiest week of the year). This was the only place that sounded nice that we could afford. The gas fireplace was nice esp. since Sedona was cold during our stay. The room had a view (over the parking lot) but it was too cold to hang out on the balcony where you...\n\n\nMore  \n\n\n", "\nWas in Phoenix for a conference, my wife and I headed up to Sedona for the weekend. Found the Southwest Inn on Hotel Tonight and man what a great value! The room was a good size for the two of us, the fireplace was a nice touch, bathroom was in good condition and clean and we used the attached porch...\n\n\nMore  \n\n\n", "\nMy daughter and I had the pleasure of staying at this lovely Inn while traveling from WI to Newport Beach. I spoke with the proprietor while on the road. We wanted a comfortable clean room and we definitely found it here. We found this room to have all the comforts of home at a very reasonable price. They slowed our...\n\n\nMore  \n\n\n", "\nLoved this place! Breakfast was make it yourself, which was good! Tons of places around to eat and explore. Kenny (guy that works there) talks WAY to much!.... Omg had to pretend to receive a call to get out of the conversation! Good guy though!\n", "\nWe stayed at the Inn for one night in January. We booked it last minute & were very happy. Its a quaint room with two beds & a fireplace. Its your typical \"motel\"...as far as the setup...but the room was very nice! We noticed an outdoor pool but it was too chilly to enjoy.\nThe breakfast was included & based...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/05/2e/88/c0/sw-inn.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "296", "title": "Oak Creek Terrace Resort Hotel, Sedona", "rating_string": "4.0", "address": "4548 N. Highway 89A, Sedona, AZ 86336", "review_list": ["\nWife and I checked in with our two, 3 year old labs right after it snowed. We stayed in cabin 14 which is a little closer to the creek. Everything in the room was just like advertised. Room was very clean, especially with allowing dogs. We have stayed in \"dog friendly\" places before but this place is very clean. If...\n\n\nMore  \n\n\n", "\nI wanted a cabin with a fireplace, close to Sedona and Oak Creek Terrace fit my needs perfectly. The cabin was cozy and clean with nice amenities. You can't burn wood in the fireplace, but they provide one Duraflame log per day (and you can burn more if you buy them). Housekeeping was excellent--I wasn't sure we would have daily...\n\n\nMore  \n\n\n", "\nBooked in after driving past on Jan 14th 2016. Cutlery, glassware missing. No saucepans, just 2 frying pans. Not even enough for 2 people. \"It's get stolen\" was the response. They eventually found odd bits. Steps/deck was very icy & hadn't been cleaned. \"We've used all the salt\". Some was found with a plastic cup to spread it as there...\n\n\nMore  \n\n\n", "\nThis place was great. Clean room, Jacuzzi was super fun, great fireplace. I ended up staying an extra night, just because it was so comfortable and nice. Being right on Oak Creek is such a treat. If you're a fisherman, be sure to ask about the fishing gear they have on site.\n", "\nI do not know which rooms others had reviewed but our room was awful. It took two days for the floor to warm up. I guess in the summer that might be a good thing, but in the shadows of the canyon, in November, a little heat would have been nice. I decided to save the extra $10 a night...\n\n\nMore  \n\n\n", "\nGreat location, great rooms, jacuzzi was awesome, fire place was awesome. The rooms (not cabins) are small, very romantic, but not much room for anything more than a couple and their luggage. Oak Creek is right out back, and there is a beautiful koi pond. you can be back in Sedona in a few minutes.\n", "\nLovely area for a wedding, next to the creek. A few friends and family rented rooms and we had the cabin down by the creek, which served as an area for to share for meals and conversation. Staff was very friendly and helped with electric cords for lights and music. Rooms were clean and comfortable.\n", "\nOak Creek Terrace has a superb location for visiting the area, magnificent views of the mountains, access to the creek, and a friendly and accommodating staff. The room was comfortable and it was great to walk out the door and be outside with fresh air and marvelous views (as opposed most hotels). We look forward to returning some time down...\n\n\nMore  \n\n\n", "\nWonderful place!!! The grounds are beautiful. Look forward to returning! We visited Sedona for the day and stopped for the night on the way to the Grand Canyon. It's located a little ways out of the city in the foothills of the mountains. It's very quiet and has a homey atmosphere with beautiful views.\n", "\nWe had room 20 with a bedroom areas, sofa, 1 bath. Couch and family room furniture was old and didn't look overly clean! Patio with grill was a nice addition. Kitchen and bath were updated and nice. For the price (255), it was average not much more. Outdoors is absolutely the perk here but could have seen the same at...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "408", "title": "Wildflower Inn Hotel, Sedona", "rating_string": "4.0", "address": "6086 State Route 179, Sedona, AZ 86351", "review_list": ["\nWe made a reservation here only about a week before a busy weekend: President's Day and Valentine's Day. Sedona was nearly booked up so this was one of a few options left. It met the requirements -- clean, quiet and comfortable. Nice views of the red rocks were a bonus. Didn't take advantage of the included breakfast; it looked to...\n\n\nMore  \n\n\n", "\nLovely hotel with amazing views. Staff were very friendly and helpful. Breakfast was limited and my bagel was stale. The room was quite nice and very clean. Fireplace and heater worked very well. Would definitely stay here again.\n", "\nThe Wildflower Inn is actually a few miles south of Sedona in the Village of Oak Creek.\nWe drove in after dark and got our first sight of the gorgeous red rocks in the morning sun. The room looked to have been recently refurbished and was spotless. The staff in the evening and in the morning were genuinely friendly and...\n\n\nMore  \n\n\n", "\nArriving in Sedona for the very first time after nightfall, The Wildflower Inn was easy to find. It's conveniently located on the 179 traffic circle below the Bell Rock. The room was clean - the desk clerk was friendly, helpful and very pleasant. And in the morning when I opened the door - I found the views to be breathtaking!!...\n\n\nMore  \n\n\n", "\nThe front desk staff was very nice and helpful. I had a nice, clean, room. The hotel is a little outdated, but that didn't bother me much as my room was very clean and comfortable and looked straight at Bell Rock. They have an observation deck and I was able to grab a cup of coffee in the lobby and...\n\n\nMore  \n\n\n", "\nThe furnishings and carpet are from another decade, but everything is clean and in very good condition.\nWhile the address \"Sedona\" is a bit misleading, there ARE nice views to be had from the hotel.\nFor the price, it really can't be beat, and unless you want to stay in the craziness of actual Sedona, this is a really nice...\n\n\nMore  \n\n\n", "\nI love coming to Sedona and thought we would go visit. The wildflower in for out second stay..There is new staff with the exception of one and they all seem very uncomfortable being nice fake smiles fake attention it was to say the least horrible to witness..The rooms are spacious but the sheets were stained carpets dirty and mold on...\n\n\nMore  \n\n\n", "\nThis was a very nice room, spacious with quite adequate light. Very nice views, with a nice second floor patio deck. It was close to restaurants and food stores. Also night life locations were within walking distance. Though a little ways to \"downtown\" Sedona, it is an interesting and quick drive.\n", "\nI was glad I called to let the staff know that we'd be arriving very late - the lobby/check-in desk is NOT open 24 hrs/day. We were given instructions for getting our key from the lockbox, and (luckily) had no trouble. The room was clean and quiet and the location was perfect. And, it was a bargain!\n", "\nThe motel itself was fine - clean rooms, updated beds, carpet, etc. Now I can't be sure it is someone from the Wildflower Inn but my credit card was used fraudulently. I generally pay by cash and I've only used my credit card for this hotel in the past week so I think it someone from this motel. Wildflower Inn...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/04/9b/b1/d3/wildflower-inn.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "622", "title": "Super 8 Sedona Motel", "rating_string": "4.0", "address": "2545 West Highway 89A, Sedona, AZ 86336", "review_list": ["\nthe hotel is average regarding everything either cleaning, service, food or even the Wi-Fi speed !!\nbut the free breakfast is not bad plus the location is really good\nthey have good offer on Groupon website\n", "\nEasily the most elegant Super 8 I've ever stayed in. The bathroom was marvelous, with a real tub and nice dispensers for shampoo etc instead of a ton of tiny bottles. The bed was comfortable, the staff helpful, and the breakfast area had a pretty good selection and a cute bookshelf. The only drawback is I think they have a...\n\n\nMore  \n\n\n", "\nStayed two nights and everything we needed and wanted was at this hotel. Great location to get around Sedona at a reasonable price. You can tell the owners/manager takes pride in this hotel with the renovations and refreshes currently going on. Comfortable bed, clean room, quiet during the night. The breakfast in the morning was everything you will need to...\n\n\nMore  \n\n\n", "\nHonestly was not expecting much from Super 8, but this place really changed the way I see this motel chain. Surprisingly in excellent condition. Newly remodeled and freshly painted. AMAZiNG quality room!!! Could not believe how beautiful the inside of the hotel was. Even the hallways were impeccably clean. Such a BEAUTiFUL place!!! :) We were lucky enough to get...\n\n\nMore  \n\n\n", "\nThe facility is old, the rooms are very small, beds are not comfortable and it's over all an outdated hotel.\n", "\nThis was a great hotel. The young man at the front desk was pleasant and very helpful suggesting the best routes to take to see the beauty of the area. The pet friendly room was newly painted and the beds were comfortable. Even the shower was great. The hotel is off the road and quiet. I would definitely stay here...\n\n\nMore  \n\n\n", "\nPhillip Was a very knowledgeable front desk person. He help me figure out where to go during my stay. The water in the room had excellent pressure and was the right temperature. Wifi was great too I could watch a movie and it did not freeze. Negative side of this hotel was the ac unit but, it was not bad...\n\n\nMore  \n\n\n", "\nMy husband and I stayed one night here, and it was rough! The room reeked of fresh paint, but when we brought it up at the front desk they said the whole hotel had just been painted, so we could not swap rooms. They just gave us some Febreeze to try and cover up the fumes. It was also so...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "204", "title": "Sugar Loaf Lodge Hotel, Sedona", "rating_string": "4.0", "address": "1870 W. SR 89A, Sedona, AZ 86336", "review_list": ["\nAll you could want! Location right in uptown Sedona on the main drag. Pool and hot tub were clean and working, room was clean, bed was comfortable, TV & WiFi worked flawlessly. Owners take great pride in their motel. The mini-fridge was not working when we got there, I let them know when we left for a day-long hike -...\n\n\nMore  \n\n\n", "\nThis affordable motel was a perfect end to my short stay in AZ. I travel by myself most of the time, so I have a checklist of basics that make a place great for me. This place hit them all! Easy phone reservation, affordable price, friendly welcome (the desk guy had already turned on the lights and heat when I...\n\n\nMore  \n\n\n", "\nI scheduled this hotel for my wife while she was on a road trip. Her experience was shocked when she arrived late but they had a note for her that they had left the heat and light on for her. She said the bed was extremely comfortable and the room was nicely comfortable. The price was the lowest in the...\n\n\nMore  \n\n\n", "\nThis is not your typical modern hotel. It is what we used to call a motor court motel. The rate was OK, no negotiating on price which for a mid week and a low occupancy night, many dark rooms, I was surprised.\nThe room I occupied was dated but comfortable. Very clean and comfortable bed. The AC unit delivered substantial...\n\n\nMore  \n\n\n", "\nClean cheap and friendly and close to everything..\nReminds me of my grandma's house..Maybe outdated and not fancy but clean and bedding is made so tight you can bounce a quarter off..\nALSO liked the bathroom floor Redrock tile and the pool and spa rules..\nIncredible deal for dudes..Especially mountain bikers outdoorsy type...\nJason\n", "\nI only stayed here for one night during a whistle stop two day tour of Arizona but it was an ideal place to stay. Located in the West part of Sedona and surrounded by many shops and restaurants and other hotels this cute motel has all you want, if you don't want the frills, bells and whistles. Although this also...\n\n\nMore  \n\n\n", "\nThis small motel is in West Sedona, close to several stores (Walgreen's, Basha's (grocery store), and a heatlh food store) and restaurants (Heartline Cafe, Coffee Pot Cafe, and 2 Italian/pizza restaurants). It's fine for travelers who don't care about all the bells and whistles, and who spend most of their day exploring the beauty of Sedona. The bed mattresses are...\n\n\nMore  \n\n\n", "\nWe stayed for 8 days in a room facing the street, there was little to no traffic noise or any type of noise. Air conditioner was easy to set & maintained temp perfectly. Room was clean, fridge, microwave, Wi-fi, hair dryer & shower worked well. Hair-dryer stored in closet by the iron & ironing board. We had so much stuff...\n\n\nMore  \n\n\n", "\nStayed for 4 nights. We had a standard room with 2 double beds and a mini fridge. Room was nice sized, beds were comfortable. Bathroom was very basic with standard shower and sink area. Room was very clean, and quiet! Used the hot tub in the pool area which is very nice on a cool night. Outdoor fireplace poolside was...\n\n\nMore  \n\n\n", "\nI love this pace. It felt like home away from home. The guy in the office was very nice and helpful. The room had a fridge, coffee pot, microwave, very clean and quaint. The pool area is amazing with a hot tub , nice pool and a grill to use. Parking is in front of your unit which is also...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/03/83/99/50/sugar-loaf-lodge.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "629", "title": "Hampton Inn Sedona Hotel", "rating_string": "4.0", "address": "1800 West Highway 89A, Sedona, AZ 86336", "review_list": ["\nSedona was amazing, hotel staff was very friendly, breakfast was good, hotel was clean, rooms were clean but very average, good location for hotel, short drive to downtown Sedona, many restaurants close by\n", "\nWe were looking to stay cheap, in town to hike so we were not looking at high end hotels. As a HH Diamond, decided to stay here rather than the Hilton resort for two reasons. First, the HI is right in town and walkable to many restaurants. Second, due to the time of the year, the resort was not fully...\n\n\nMore  \n\n\n", "\nComfortable beds. The fridge in the room was great after a stop at the grocery store. Good location on 89A. The check-in staff recommended a great place to go to catch the sunset. The continental breakfast was fantastic- so many options including oatmeal, waffle maker, scrambled eggs and breakfast potatoes, as well as the usual.\n", "\nWe have stayed at this hotel in the past; but, it is now well past its prime and sorely in need of updating. It has a shabby appearance and feel to it. I will choose another option in the future. Location is still excellent.\n", "\nExcellent stay with my dad showing him around the Sedona, Flagstaff, Village of Oak Creek, Valley Verde area. Am in planning stage to move to Sedona. When I do I would highly recommend the hotel to friends and business associates to stay. Everything needed is a walk away, restaurants, cinema, banks, etc...\n", "\nThe lobby area and breakfast area were nice. The room was fine and the bed and furnishings were comfortable. There were a ton of electrical outlets in the room. I liked the fact the the old fashioned heater below the window had a thermostat rather than simply hot or cold hi/low. A few miles from downtown but everything was close....\n\n\nMore  \n\n\n", "\nHampton, or something from the Hilton franchise, is usually my first choice when traveling. This hotel was true to the Hampton franchise and standards. Would stay here again while visiting Sedona. The king suite not only had the large room for bed, sleeper sofa but there was also a folding bed in a closet large enough to use for another...\n\n\nMore  \n\n\n", "\nWould definitly Stay here again . Staff is amazing .. Breakfast is great because it goes from 6-10 , most places stop at 9 and for those of us who are not morning people it works perfectly .. Room was clean and really nicely decorated , modern bathroom .. Location perfect center of everything..\n", "\nHotel has a beautiful lobby area including an area where you can meet with visitors by the fireplace. The staff is friendly and helpful. They gave us suggestions about restaurants and easy directions. We were disappointed when we got back at 9pm the second night and they were no cookies left, but it was late. Breakfast left a bit to...\n\n\nMore  \n\n\n", "\nWe were looking for a less expensive place in this pricey area, and picked this Hampton although it had a 2 star AAA rating. This shows how unreliable those ratings are. The location is good, room was larger than expected, staff were friendly and breakfast was above average. Excellent restaurant (Heartline) a short walk.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/b1/76/dc/hampton-inn-sedona.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "629", "title": "Hampton Inn Sedona Hotel", "rating_string": "4.0", "address": "1800 West Highway 89A, Sedona, AZ 86336", "review_list": ["\nSedona was amazing, hotel staff was very friendly, breakfast was good, hotel was clean, rooms were clean but very average, good location for hotel, short drive to downtown Sedona, many restaurants close by\n", "\nWe were looking to stay cheap, in town to hike so we were not looking at high end hotels. As a HH Diamond, decided to stay here rather than the Hilton resort for two reasons. First, the HI is right in town and walkable to many restaurants. Second, due to the time of the year, the resort was not fully...\n\n\nMore  \n\n\n", "\nComfortable beds. The fridge in the room was great after a stop at the grocery store. Good location on 89A. The check-in staff recommended a great place to go to catch the sunset. The continental breakfast was fantastic- so many options including oatmeal, waffle maker, scrambled eggs and breakfast potatoes, as well as the usual.\n", "\nWe have stayed at this hotel in the past; but, it is now well past its prime and sorely in need of updating. It has a shabby appearance and feel to it. I will choose another option in the future. Location is still excellent.\n", "\nExcellent stay with my dad showing him around the Sedona, Flagstaff, Village of Oak Creek, Valley Verde area. Am in planning stage to move to Sedona. When I do I would highly recommend the hotel to friends and business associates to stay. Everything needed is a walk away, restaurants, cinema, banks, etc...\n", "\nThe lobby area and breakfast area were nice. The room was fine and the bed and furnishings were comfortable. There were a ton of electrical outlets in the room. I liked the fact the the old fashioned heater below the window had a thermostat rather than simply hot or cold hi/low. A few miles from downtown but everything was close....\n\n\nMore  \n\n\n", "\nHampton, or something from the Hilton franchise, is usually my first choice when traveling. This hotel was true to the Hampton franchise and standards. Would stay here again while visiting Sedona. The king suite not only had the large room for bed, sleeper sofa but there was also a folding bed in a closet large enough to use for another...\n\n\nMore  \n\n\n", "\nWould definitly Stay here again . Staff is amazing .. Breakfast is great because it goes from 6-10 , most places stop at 9 and for those of us who are not morning people it works perfectly .. Room was clean and really nicely decorated , modern bathroom .. Location perfect center of everything..\n", "\nHotel has a beautiful lobby area including an area where you can meet with visitors by the fireplace. The staff is friendly and helpful. They gave us suggestions about restaurants and easy directions. We were disappointed when we got back at 9pm the second night and they were no cookies left, but it was late. Breakfast left a bit to...\n\n\nMore  \n\n\n", "\nWe were looking for a less expensive place in this pricey area, and picked this Hampton although it had a 2 star AAA rating. This shows how unreliable those ratings are. The location is good, room was larger than expected, staff were friendly and breakfast was above average. Excellent restaurant (Heartline) a short walk.\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/b1/76/dc/hampton-inn-sedona.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "487", "title": "Days Inn Kokopelli Sedona Hotel", "rating_string": "4.0", "address": "6465 Highway 179, Sedona, AZ 86351 (Formerly Kokopelli Inn)", "review_list": ["\nroom was clean ,roomy and comfortable . pleasant staff . We used this room for one night as we were traveling .we liked it so much on our way back we returned for another night . there is a sense of pride that shines thru.\n", "\nThe front desk lady informed me this hotel was in Sedona, (technically that is their address) however after looking at Google maps, it is right in the middle of The Village of Oak Creek 7.2 miles from downtown Sedona.\nThe location was really ok for driving to all the different tourist spots, did not find it difficult to navigate around....\n\n\nMore  \n\n\n", "\nThe rooms are clean, love the bed and pillows! Big T.V... sofa sleeper was halfway seperated from our king size bed which gave our daughter her own space. Anya was super sweet, great customer service from her. The lady who works in the morning isn't as nice.. And the lady that was doing breakfast on 1/20 made us feel rushed...\n\n\nMore  \n\n\n", "\nThe front desk allowed us to check in early and gave us a room with a nice view of the mountains. The rooms was comfortable and clean! Breakfast was okay, would have been nice it they served bagels, fruit and muffins.\n", "\nStaff was nice, room was very clean just needs updating bad! Location was good. It is about 15 mins away from the main streets. Breakfast did not look good at all. We went over to BlueMoon Cafe which is down the street.\n", "\nWe stayed two nights and on both nights when we tried to take a shower the piping behind the wall leaked and poured out from behind the walls and onto the floor, flooding the bathroom. The wallpaper in the bathroom was pealing off the wall and behind the wallpaper, mold was visible. The bathroom trim was warped and rotting due...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "490", "title": "Sedona Pines Resort", "rating_string": "4.0", "address": "6701 West Hwy 89A, Sedona, AZ 86336", "review_list": ["\nMy mother and sister planned a family vacation day to spend a day in Beautiful Sedona, but our day was hijacked. The Sedona Activity Center – Sedona Pines Resort masquerades as tourist travel center but it is not. It lures the unsuspecting into their facility with signs of jeep rides, helicopter rides, red rock passes, lodging, clean restrooms, free maps,...\n\n\nMore  \n\n\n", "\nWonderfull stay,great staff(even helped with suggestions of the great hiking trails in the area),nice hot tubs,free laundry room,mini-golf,activities during the day and entertainment most evenings.Special thanks to Terri she is a definite asset to the resort\n", "\nThe location was perfect for day trips to the tourist spots in that general area. Entering the resort via car to the roads to the units was awkward, especially at night. The on site restaurant was exceptionally great but a little pricey for our budget. It would have been good to have something modest available for breakfast and lunch when...\n\n\nMore  \n\n\n", "\nMy wife and I did a Time Share swap with RCI and came here to explore the Sedona area. The cottages are fabulous. Plenty of room and all the things you need to make your own breakfast. A very relaxing stay. Unfortunately it was December so we did not take advantage of the outdoor facilities. We would come here again.\n", "\nWe traded Disney vacation club points for this 7 night stay at the Sedona Pines Resort on the edge of Sedona Arizona. Although it wasn't like staying at a Disney Resort, it was comfortable, clean, and had everything we needed for the stay. As others have written, the bedroom had very little room to walk around the queen size bed,...\n\n\nMore  \n\n\n", "\nThe modular units are an upgrade over a trailer, but are very compact. Just very tight. Bedrooms are separate units, which gives you some privacy but might not work with young kids. The timeshares salesman could use a decorum refresher course. Interrupting me multiple times with \"whatever\" when I'm in the middle of a sentence doesn't make me want to...\n\n\nMore  \n\n\n", "\nSedona Pines is a time share resort a very short distance from the city limits in a beautiful setting. Explore Oak Creek Canyon, Slide Rock, countless vortices and hiking trails, take jeep tours, balloon rides, and head to Cottonwood, Jerome, even Prescott and more from this resort. Very well maintained, the units have everything you need for a vacation stay....\n\n\nMore  \n\n\n", "\nIt truly was a very nice resort which is clean and comfortable. Nicer than pictures on line. Very pleased and I would stay there again. You are literally right outside the heart of everything. Much closer than we expected.\nEveryone was very pleasant. The restaurant on the resort grounds 'Bella Vita' is a must-go-to! Best Italian food that I had...\n\n\nMore  \n\n\n", "\nThis group is one that offers one of those \"cruise line deals\" where they make you pay a deposit and jump through so many hoops that you eventually default or give up. In order to get complaints resolved we had to go to the BBB and at each step they would promise something, miss the deadline and then report that...\n\n\nMore  \n\n\n", "\nWe belong to a vacation ownership club and did an exchange to the Sedona Pines Resort. We were pleasantly surprised. Our Casita was cute, roomy, well furnished and a delight. It was very cold our first day and the water fountains froze into beautiful formations. Our room was warm and cozy. The staff were very friendly and helpful. The weather...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "3.0"}]
[{"category": "hotel", "review_count": "191", "title": "Whitehouse Inn Motel, Sedona", "rating_string": "4.0", "address": "2986 West Highway 89A, Sedona, AZ 86336", "review_list": ["\nWe stayed in sedona for a night and was quite happy to stay here. The person in the reception was very helpful and suggested great spots to see for our short stay . WiFi and heating was pretty good. Only thing there was no view at all. But you step out and it is amazing around sedona. Thank you\n", "\nFor $85, this place was not too bad. We were in town for just a night, so didn't lay out a bunch of cash for a resort room. The exterior has been nicely refinished and the room could have used a few more coats of paint on the ceiling beams, but it was clean and quiet. The motel is located...\n\n\nMore  \n\n\n", "\nThe room was clean and the shower hot! There was a mini frig, microwave and coffee pot. Check in and out was quick and while the motel is located on the West side of Sedona everything was within 5-25 minute drive. The heater kept the room warm and looking out the back to the red rock was a nice way...\n\n\nMore  \n\n\n", "\nBy the time I booked, it was the only budget hotel available Christmas week. No king beds, only queens. Walls are thin, and if you are on the ground floor you will certainly hear someone upstairs on the second floor. Small patio in the rear with some view. HVAC was annoying. The fan would have to be on constantly or...\n\n\nMore  \n\n\n", "\nProbably the least expensive place in Sedona. Nothing fancy at all, but comfortable, no issues and family owned - AND the internet is good. I stayed at the Super 8 and the wi-fi blows. I'll be moving back to Sedona soon which is why I've stayed here a few times. Highly recommend if you're on a budget - besides, if...\n\n\nMore  \n\n\n", "\nWe spent two nights´here. Taken all round it was a good experience, the price was reasonable. However the patio room was very noisy when the heater was on ( I guess it´s not a problem in summer) and we could hear clearly as the upper neighbours were walking on the floor. The toilet didn´t flush well, it felt like the...\n\n\nMore  \n\n\n", "\nThis place seems a bit under-rated. It has all the amenities, free Wi-Fi, mini-fridge, microwave, etc. It has a good location along the main drag, Route 89, and is priced lower than most other places in Sedona.\n", "\nOn the main strip in Sedona this is a nice budget hotel. Nice clean rooms without frills. Indian gentleman at reception was friendly and polite. Privately owned but would be commensurate with Holiday Inn Express or similar. Would stay here again.\n", "\nIn a very expensive resort town, where even budget properties have three-figure nightly rates, this independent hotel a couple miles from downtown was the best deal going and totally acceptable. My bedroom was large, and so was the bath. It had better-than-budget furnishings – including fridge and microwave -- and comfortable chairs for lounging. The Internet worked great, plus there...\n\n\nMore  \n\n\n", "\nI was travelling to Sedona solo prior to going to the Grand Canyon and hoping to have a couple of days of hiking in the area. I booked the Whitehouse as the price was right and the reviews were good. I must say that I was pleasantly surprised as it was very clean and well maintained. The owner was very...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "88", "title": "Sedona Village Lodge Hotel", "rating_string": "3.5", "address": "105 Bell Rock Plaza, Sedona, AZ 86351", "review_list": ["\nAcceptable basic overnight room large enough for family of 6. It wasn't dirty, but I wasn't completely comfortable. Some maintenance and improvements would help. Don't expect to be impressed by anything except the surroundings and night sky.\n", "\nI spent a night here on my way back from Moab. It was clean and had room for my bike inside the room. Walking distance to breakfast and I could start my ride from the hotel. The Bike and Bean is next door if need to rent a bike. I rented the Bronson and had a great 5 hour ride....\n\n\nMore  \n\n\n", "\nIf you don't mind the smell of cigarette smoke and don't care about amenities like coffee, breakfast or calling the front desk, this is a great place. The room is okay, it's clean but very dated. Bell Rock is very close, a few good restaurants are close and uptown and West Sedona are to far to drive. I was put...\n\n\nMore  \n\n\n", "\nYes, it's outdated, but it's clean and covers the necessaties(bed, fridge, mw, bathroom and cable tv). They also offer suites w/kitchenettes and views. Walk to trails and good eats. Support the locals.\n", "\nThis place is a gem if you are looking for a low cost, clean and wonderfully situated place to stay. We had a suite with a separate bedroom that had two queen size beds and the living room had a pull out queensize sofa bed. The living room was small but sufficient. The place was very clean. Teeny smell of...\n\n\nMore  \n\n\n", "\nLocals put me on to this place while visiting for the weekend. Honestly, with the price difference compared to others literally within walking distance of this place we were a bit apprehensive of what we would walk in to (think Bates Motel). To say we were pleasantly surprised was an understatement. We reserved a basic room (no suite), #28. Indeed...\n\n\nMore  \n\n\n", "\nThe cleanest place you will find anywhere. Can't beat the service and the value of this place, Best kept Secret in Sedona, don't really want to tell too many people!. Do yourself a favor, and get the suite, ours had a Kiva Fireplace and added surprise. Have to mention the staff, went out of their way to help us in...\n\n\nMore  \n\n\n", "\nI needed a room for one add on night during a holiday week stay, and this was the only lodging establishment that wasn't asking me for one of my appendages (you know - the proverbial arm or leg, or arm and a leg). The bed was comfortable, the location in the Village of Oak Creek was great, and there was...\n\n\nMore  \n\n\n", "\nWe had the largest room in the place. King sized bed in separate bedroom from living room that had a sofa sleeper. Great views, clean (minus a small spider in the corner of the room), and the bathroom was probably most up to date. The room had somewhat threadbare curtains, taped up/semi repaired microwave, and the other furniture was in...\n\n\nMore  \n\n\n", "\nGreat place great rate.Room 25 had view of Bellrock. Walking distance to it.Would stay there again.It was quiet and also not\nFar from supermarket and Sedona. The village is Oak creek less touristic but near great trails\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/02/ca/6d/0c/sedona-village-lodge.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "109", "title": "La Vista Motel, Sedona", "rating_string": "4.0", "address": "500 North State Route 89A, Sedona, AZ 86336", "review_list": ["\nwe got a king bed room with patio, the room was so comfortable, it had everything we needed, fridge, coffer maker, microwave-oven etc. its walking distance to uptown Sedona as well, close all the nice restaurants, coffee shops. we absolutely enjoyed our stay. although nearly $200 per night was not exactly cheap, guess you get what you pay for.\n", "\nThe rooms are comfortable and the views are amazing. It offers the benefits of being uptown, but with a little more tranquility. For it's location, it really is a great value. Brian and Samantha and staff are so welcoming, they really make you feel at home and truly want you to enjoy your stay.\n", "\nWe stayed in La Vista Motel on a short trip to Sedona. We received a very warm welcome and the room had everything we needed. The view from our room of the red rock formations was great to wake up to. Overall, this was a friendly, unfussy and good value motel.\n", "\nWe were looking for a cheap place in the heart of Sedona and this was the cheapest by far. The owners (Brian and Samantha) are very, very nice and really went out of their way to accommodate our special needs (wheelchair). But the property is dated. We were sneezing like crazy due to the mildewed carpet. The coffee maker didn't...\n\n\nMore  \n\n\n", "\nI was at LaVista the first weekend of November. This is our second visit to Sedona. We are from Bend Oregon, and never have been anywhere else that made us feel like a home away from home as Brian, Samantha and staff did! They suggested must see places, and gotta try restaurants. Our room was immaculate, and homie. The staff...\n\n\nMore  \n\n\n", "\nBrian and Samantha and staff are the best!!! They are eager to make your stay the most enjoyable and suggest options for things to do places to go that you normally don't get at the big chain hotels. The La Vista is a short walk to all of uptowns shops and dining. Yet it is far enough away to enjoy...\n\n\nMore  \n\n\n", "\nI've been coming to the La Vista for 20 years. No \"over the top\" frills but rather a good place to sleep and a wonderful backyard to barbecue in the shadow of the Red Rocks. I have successfully recommended La Vista to many friends.\n", "\nHi my name is Sylvia and I made my first trip to Sedona on Nov. 8 and stayed there for 3 nights. Since I booked 3 tours I didn't plan to rent a car and arranged tour company to pick me up at La Vista. The first day I arrived I wasn't very satisfied with the room condition, and Samantha...\n\n\nMore  \n\n\n", "\nQuaint motel with divine views and a great management team that makes you feel at home/part of the family. It's a no frills motel, which was perfect for me and exactly what I was looking for. Price and location (eg walking distance from main tourist area) is what drew me to this motel. Management taking the time to make sure...\n\n\nMore  \n\n\n", "\nUpon arrival we had an excellent experience with the owners Brian and Samantha. The room was perfect just what we were looking for it had a separate bedroom and a living room with a kitchenette. Two nights out of the four we stayed we bbqed right out side our room with the BBQ onsite while enjoying the red rock mountains...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/01/cd/87/0b/la-vista-motel.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "171", "title": "Cedars Resort, Sedona", "rating_string": "3.5", "address": "20 W. Highway 89a, Sedona, AZ 86339", "review_list": ["\nBeautiful views with a balcony to enjoy. Room could use some updating but not too bad. I would stay here again. If you are a night owl be sure you have ice in your room before the office closes. That's the only ice machine on the property when I was there.\n", "\nThe location is central with easy parking outside your room. The rooms are large and well decorated, comfortable bed, and there is a small fridge and coffee maker. The bathroom is quite small though, just enough room to open the door and fit a shower-in-bath and toilet. The sink is just outside the bathroom and takes up space on the...\n\n\nMore  \n\n\n", "\nThis is our fourth time staying here within the last 2.5 years. The management and ownership once again refuse to disappoint. For couples or singles on a budget, The Cedars delivers every bang possible for your buck. First, it's central to everything; Tlaquepaque, Sound Bites, and uptown. You can walk less than 100 yards to almost anything from breakfast, dinner,...\n\n\nMore  \n\n\n", "\nGiven how beautiful Sedona is we were disappointed with the cedars. We got a king room on the lower floor and the first thing that I noticed was the old lady moth ball smell and the second thing was the tremendously outdated furnishings. Neither the bathtub nor the sink would drain and I had a shower in a foot of...\n\n\nMore  \n\n\n", "\nNot a luxury resort, but fairly inexpensive, nice, clean, beautiful mountain and valley views from the balcony. The motel-style resort is conveniently located, just a 10 minute walk from the restaurants. shops, and chamber of commerce (maps/info on hiking nearby!) in uptown Sedona. There is a small pool, but I did not check it out.\n", "\nI got a downstairs Non smoking king canyon view bedroom for 2 nights. This motel is kind of hard to get to since almost in a round about and my G P S does not list it and entering the address in my G P S gave me a wrong location and the sign is large but unless coming into...\n\n\nMore  \n\n\n", "\nVery nice location. Clean hotel. Awesome view if you request the canyon side rooms. Lacks breakfast but the wonderful 10 minute walk to nearby Wildflower Bread Company or any of the other uptown places makes it better that it does, in fact, not have breakfast. Recommended.\n", "\nI am lucky enough to have stayed at this hotel twice now. The staff are friendly and helpful. The rooms are large and clean with coffee machine fridge iron and ironing board and hairdryer. But best of all is the balcony with beautiful views of Snoopy rock what a wonderful way to wake up and see this view. The hotel...\n\n\nMore  \n\n\n", "\nCheck in was easy. The place is a little old but is in a nice spot with a view of one of the Sedona Rock Mountains from the back balcony. Can walk to all the shops resturants etc in the tourist strip. The room was a good size and comfy but the bathroom a little small. The wi-fi was good.\n", "\nThe best thing about this hotel was the view from the private balcony. Every morning I ate my breakfast on the balcony while listening to the running water and birdsong and watching the morning light fall upon the magnificent red and white cliffs in the distance. It was a magical way to start each day. The staff seemed friendly and...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "130", "title": "Garland's Oak Creek Lodge Hotel, Sedona", "rating_string": "5.0", "address": "8067 N Highway 89A, 8 Mi North of Sedona, Sedona, AZ 86336", "review_list": ["\nBest kept secret in Oak Creek Canyon, but many \"regulars\" return so reserve in advance. The lodge is a beautiful log building where Gourmet meals, included in the lodging price, are served. Breakfast is 3 courses freshly prepared; Dinner is to be slowly enjoyed over 1 to 2 hours with several courses that include fresh salads and vegetables from the...\n\n\nMore  \n\n\n", "\nAs a single the small creekside cabins are perfect. Numbers 1-4. Dinner is always special and they seat me with interesting guests. No TV, No phone, very limited WiFi.\nPerfect spot to relax and recover from the outside world. Nice small library for those of us who still use real books!\n", "\nHad a great stay Nov 16th and 17th at Garlands. The cabins are perfect. Rustic, clean and comfortable. The main lodge where we met for breakfast, tea time, drinks and dinner was like something out of a picture. The day we arrived it had just rained and snowed and we had to drive across the creek which was quite an...\n\n\nMore  \n\n\n", "\nMy sister and I stayed in a spacious cabin at the top of the hill. There was a king bed and a large sofa bed, plenty of room for two. The cabins are very private and each one is slightly different. The smaller cabins are closer to Oak Creek. The property is lovely, and the cabins are rustic and simple....\n\n\nMore  \n\n\n", "\nWe used Garlands as our HQ during a fall trip to AZ. It is a gem surrounded by the grandeur of the canyon and right on oak creek. Breakfast was really a standout for us and we had different selections daily. Happy hour 6:00pm was a great way to visit with other guests and share stories of our days. Dinner...\n\n\nMore  \n\n\n", "\nWe had dinner last week at Garland's and it was bad. There are no options at all on the menu. \"Minted beet soup\" was as bad as it sounds, the \"focaccia\" was just bread, the pepper sauce on the fish was ok, the \"wilted chard\" was boiled chard with a bit of olive oil, the fish was good. I liked...\n\n\nMore  \n\n\n", "\nTurn off the road and drive through a creek to reach the property. It was very rustic and my wife was questioning my choice of staying in a cabin. By the time we left, she wanted to come back for more. Our cabin (named Rainy) had a comfortable bed, real fireplace and all the basic comforts. There was no TV...\n\n\nMore  \n\n\n", "\nGarland's is our absolute favorite Fall getaway for several years. There are not words good enough to describe the beauty and serene setting on Oak Creek. The cabins are clean and cozy (and well maintained). The staff is all friendly and welcoming. They remember you from stay to stay.\nThen there is the food! To say it is superb would...\n\n\nMore  \n\n\n", "\nThe Garland family bought the Lodge in the late 60s and built it into a tremendous place to stay, noted especially for its wonderful food. In fact, the Lodge's chef wrote a fabulous cookbook called Sharing The Table. But last year, the Garland family sold the Lodge to three partners. Our experience this time around was very disappointing. We had...\n\n\nMore  \n\n\n", "\nWe have been going to Garland's every year for about 10 years, and it's always deserved the highest rating. This year it's under new ownership, and the experience was close to our previous ones --- but not quite there. Mainly, the food is not up to previous standards. The desserts were decidedly of uneven quality. Only one of the three...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "327", "title": "Sedona Motel", "rating_string": "4.5", "address": "218 Highway 179, Sedona, AZ 86336", "review_list": ["\nMy son and I stopped overnight at this lovely motel towards the end of a 4,000 mile road trip across the states. Having stopped at many motels, this was the best of the trip. Bill the owner was very friendly and gave great advice on places to eat and things to see. The room was clean, a good size and...\n\n\nMore  \n\n\n", "\nPrice was great especially for the area. The rooms were clean and the owner was great. Have a beer and enjoy the covered patio with a great view. Great location in the middle of Sedona - easy to get anywhere.\n", "\nExcellent! Can't thank Bill the owner enough, he gave us suggestions on the hikes around Sedona, local restaurants, places to see. All his suggestions were right on, so we were able to enjoy ourselves instead of researching things to do while in Sedona.\nThe motel sits just off the Y in the heart of town. Beautiful views, right across from...\n\n\nMore  \n\n\n", "\nThe hotel is close to everything, with excellent views. Would definitely stay here again. Staff was very friendly and helpful with good information. Room was clean and roomy. Restaurants within walking distance.\n", "\nThe Sedona Motel is not your typical drive-to-door motel. Although the rooms are standard for a motel, the views and location are 5 star. We sat outside our rooms everyday to watch the colors change right in front of us on the amazing rock formations. A nice size terrace with 180 degree view and seating for everyone is also available....\n\n\nMore  \n\n\n", "\n2nd visit to this cute roadside motel. Bill was very helpful. Lovely patio on one end of motel with great views. Thanks Bill for the corkscrew and being able to enjoy a glass\nof wine watching the sunset. Very convenient to many restaurants and things to do.\nGreat choice!\n", "\nStayed here for 2 nights based on Trip Advisor reviews that were spot on! Very clean, centrally located motel with comfortable beds and a very friendly owner. We walked almost everywhere from the motel and the views from our porch were spectacular. Very reasonably priced as well.\n", "\nPerfect spot in Sedona--walking distance to the downtown and Talipaque. Close to restaurants--across the street or just up or down the street. The king suite offered privacy with a perfect view of the night time skies.\n", "\nOn our recent trip to Sedona in August, we stopped at the Sedona Motel to inquire about their room rates. Bill was friendly and welcoming however we were on a tight budget and the room rate was a little above what we wanted to pay. When asked if he could recommend something more within our budget, he unselfishly suggested other...\n\n\nMore  \n\n\n", "\nThis motel is in the perfect location for sightseeing in Sedona. If you are looking for a resort atmosphere, this place is not for you. If you are looking for outstanding customer service, stay here. Don and Bill are so friendly and kind. I believe that they genuinely cared about our stay and wanted to make sure we had everything...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/06/55/15/60/sedona-motel.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "550", "title": "Matterhorn Inn Motel, Sedona", "rating_string": "4.5", "address": "230 Apple Ave, Sedona, AZ 86336", "review_list": ["\nVery glad I chose this hotel. Front desk staff was welcoming and helpful. Room was clean, well-appointed and modern. Although the room faced the main street, it was very quiet. The bed was extremely comfortable - I slept like a baby. Great location - walking distance to lots of shops and restaurants. Would definitely return to this hotel if in...\n\n\nMore  \n\n\n", "\nWe truly enjoyed our stay at this hotel. It was walking distance to local area shops and restaurants. The room was clean, and the staff was friendly and accommodating. The balcony was roomy to enjoy the views of the area mountains.\n", "\nThis non-chain hotel is right downtown. The rooms are nice sized with street view. Toilet/shower area is small. Sink and counter are outside shower area but is also behind a wall so one can get ready with out waking late sleepers. Nice view of town and mountains. Parking is tight so get there early and stake out your spot- you...\n\n\nMore  \n\n\n", "\nThe hotel was much nicer than shown on their website. Great location, beautiful views, walking distance to the town. The rooms were clean and comfortable king size bed and nice decor. Staff was friendly. The main floor was a little noisy from above but nothing too disruptive. In comparison with the high priced hotels in the area I'll be back!!!!\n", "\nI came here for business and I was looking for a place that is close to everything.....I found it. The balcony is amazing and I have sat out here every night to watch the sun set!!! Also so close to restaurants and shops. Bed was nice, bathroom small but shower was great! Thanks!!!\n", "\nNice rooms with a stunning view of the red rocks. Placed very central at the city mainroad. Staff was friendly and helpful. Aircondition at the room was a bit noisy and we were only able to chose one speed. Price was very avg. for the area. Would stay there again.\n", "\n2 couples, early 50's stayed 1 night in November. We wanted a location that was walking distance after a few drinks so we didn't have to drive. This is right in the downtown area, walking distance to the main shopping / restaurant area - perfect location. The rooms were clean and comfortable. Not my favorite bathroom but again, it was...\n\n\nMore  \n\n\n", "\nOur family of 4 visited between Christmas and New Year for 4 nights. The staff was very helpful, the place had a great view and was clean. They even helped print our e-tickets when we left. Price was fair given the location and convenience.\n", "\nThis is the perfect place to stay if you are not going to spend a lot of time in your room but you want a great view. The room was spotlessly clean, small bathroom, but again very clean. There is a small balcony which faced the big orange rocks and you can watch the colors change as the sun comes...\n\n\nMore  \n\n\n", "\nI recently stayed here for one night on a biking trip. First of all the location is great.. awesome views of the red rock while still being right in the middle of everything. The man at the front desk was friendly and checked us in quickly. The room was good sized, clean and comfortable! My only complaint was there was...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-o/08/f6/d5/97/matterhorn-inn.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "183", "title": "Star Motel Hotel, Sedona", "rating_string": "4.5", "address": "295 Jordan Rd., P.O. Box 1320, Sedona, AZ 86336", "review_list": ["\nGreat small motel right in the heart of town. Perfect for walking to whatever you're looking for. Restaurants and shopping just steps away yet very quiet. Views from the sitting porch are wonderful and the rooms were clean and comfortable.\n", "\nStayed just one night - Thanksgiving! The room was small, but the bed was comfortable and everything worked as it should. For the price, this place is a steal for the location alone!! You are one block from shopping and restaurants and a short drive from lots of other shopping and hiking. Definitely recommend staying here!!\n", "\nYes, it is Sedona aka far north Scottsdale. The woman working the front desk when we arrived was very friendly and helpful. She offered us a discount of $10. When asked for more of a discount we received a bit of a curt response of \"I already offered a discount.\" The room was very big. The shower was very small...\n\n\nMore  \n\n\n", "\nWe had the best time in Sedona at the Star Motel. Great location, friendly environment\nattractive room and the hospitality was perfect. Cowboy club around the corner had excellent food. Hope to go back again and would definitely stay at the Star Motel again.\n", "\nWe stayed two nights. Perfect location for shopping, restaurants, jeep and trolley tours. Clean, comfortable and cozy. I enjoyed the patio in the evenings. It was nice to people watch and enjoy the view. I highly recommend this motel. It was just right for the two of us looking for a romantic getaway. We had a king size bed. Cute...\n\n\nMore  \n\n\n", "\nWe stayed here 4 nights during end of September. We reserved a queen bed room. Anne was very nice when making the reservations and even answered some general questions about Sedona. We also had to modify our request later on which wasn't a problem. Check in went great, we were promptly greeted. She also gave us some pamphlets and explained...\n\n\nMore  \n\n\n", "\nRecently stayed a few nights at the Star Motel and like our other visits to Sedona is was again wonderful. We stayed in the upstairs room that was nicely furnished, plenty of room with a full kitchen and a front deck with breathtaking views. The window unit ac was a bit lacking but the night time temps wasn't bad so...\n\n\nMore  \n\n\n", "\nI really like the Star, I've stayed there multiple times. Ann and her staff are all legit, top notch people, helpful and knowledgeable of the Motel and the Sedona area.. The rooms are nice, have microwave and fridge. are clean, smell really good, and the bathrooms are spotless. The connection to downtown Sedona is perfect. I like the down home...\n\n\nMore  \n\n\n", "\nThis place is an small older motel but very nice. Rooms were a little dark, but it is very clean and quiet. Located right in downtown Sedona so you could walk to the shops. Owners were very friendly and helpful. It is the best hidden secret in Arizona.\n", "\nI've been to Sedona on several occasions, and usually use timeshare points to stay on the West side of town. My wife and I were for a short trip to meet with friends during Memorial day weekend this summer, and stayed two nights at the Star. Great value, RIGHT downtown (walk to everything) and it's been kept up very nicely...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/01/2c/6c/6b/sedona.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "33", "title": "Sedona Mago Retreat Spa", "rating_string": "4.5", "address": "3500 E. Bill Gray Road, Sedona, AZ 86336", "review_list": ["\nIf you want to get away from it all and appreciate the beauty of Mother Nature, this is the place for you. Sedona Mago is isolated, completely unplugged, incredibly beautiful and intentionally filled with spectacular opportunities for moments of absolute connection to the spiritual essence of the earth mother. The rooms are basic but meet your needs. The vegetarian food...\n\n\nMore  \n\n\n", "\nI stayed here as I was attending a workshop being held onsite. What a beautiful place, it was just what I needed, the peace and quiet is perfect. My room was lovely, everything I needed. I admit I was quite happy to have wifi that worked in my room, haha, didn't need THAT much peace! The staff are all friendly...\n\n\nMore  \n\n\n", "\nI came here as part of a \"Going Global\" conference. The area was a place of stunning beauty and tranquility. The food was good although a bit samey after a week. Whilst I appreciate the ethos of the place I don't like having views imposed on me. So found my own freedom restrained by the retreats view which clashes with...\n\n\nMore  \n\n\n", "\nThis review is so long overdue. Mago Garden has something special, that no overpriced resort can offer. Peace and quiet, in the most beautiful of settings....with some extra that cannot even be described.\nIf you want to get away from it all, and rediscover yourself. This is the place.\nIf you wish to be left alone, no one will bother...\n\n\nMore  \n\n\n", "\nIf your seeking a place of solitude and isolation this place is for you. Rooms are quiet and minimalistic. The grounds are immense and offer many hiking trails. Some trails take you to natural energy sources emanating from the ground. Take in the stars in the evening from outside your room or while soaking in the pool. You may even...\n\n\nMore  \n\n\n", "\nThis retreat center is spectacular. It sits on acres of natural desert with panoramic views of Sedona red rocks. There is s healing lake 3 labyrinths and lots of walking paths not to mention energy vortexes. The food was superlative and vegetarian. Simply beautiful and serene. A heaven touching earth.\n", "\nIf you want to get away from the hussle and bussle, be with yourself, be with the earth, then this place is perfect. I would not call it fancy, but it is BEAUTIFUL! The grounds and property have so much to offer. The food in the dining hall is DELICIOUS! I will definitely return. A must experience.\n", "\nThis is the most beautiful, peaceful and serene place that I've ever been to. The staff was exceptional; kind and helpful. I highly recommend the Mago Garden Retreat to anyone. Let the nature embrace you!\n", "\nThe location of this retreat center is awe inspiring. We went for a retreat and had a completely wonderful time. The property is beautiful for walking and meditation I enjoyed the food and the simplicity of the Casitas with no TV. Quirky sculptures and amazing irises in bloom all over the place while we were there. I will return again.\n", "\nI went for a Writer's Retreat and ended up having a life-changing time. Great food, staff, and amazing land. We were in the shared rooms, and there was nothing special there. The good, and the land more than made up for that!\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/05/74/45/f5/sedona-mago-retreat.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "83", "title": "Forest Houses Resort, Sedona", "rating_string": "4.5", "address": "9275 N. Hwy. 89A, Sedona, AZ 86336", "review_list": ["\nPeaceful and quite that's why we come back, the cabins have so much for the cost of the stay that it does'nt make sense to stay anywhere else, I will say I am not a fan of the sleep number beds, really wish they had kept the regular mattresses which were wonderful to sleep on, But we will continue to...\n\n\nMore  \n\n\n", "\nAs a long time customer of this resort, We were appalled at the \"upgrades\" to the bed in the Chalet cabin. It is a sleep number bed that is quite the most uncomfortable experience we have ever had in any bed anywhere at any time on any continent. Get the picture? In addition, the resident skunks were having a glorious...\n\n\nMore  \n\n\n", "\nCabin, 2 beds for 2 friends,full kitchen, wood supplied for fireplace, huge patio -we hung feeders and got plenty of finches and hummers - herons on top of pine trees -too cool for words, driving cross creek a daily thrill! Center of action for us. We thought price actually very moderate for so much! Gosh, wish I could have stayed...\n\n\nMore  \n\n\n", "\nAny time you book a lodge or cabin on line for a week and haven't seen it you always wonder what you are going to see when you get there. Well this was like Paradise. Everything we were looking for on this property. Peace, space between the house, excellent hostesses, NO phones, TV, internet. A large yard area for or...\n\n\nMore  \n\n\n", "\nMy husband, 2 stepsons, our Westie and I stayed again at this wonderful place.\nWe have only stayed in the cloud house. It is a wonderful cabin at the end of the property by the hiking trail. It is right on/over the creek. It is fronting the highway but for us that has never been a problem. We are typically...\n\n\nMore  \n\n\n", "\neach cabin is spectacular and cozy and has a great real oak creek feeling to it...stayed in the treehouse cabin wish i could live there. this is a great place to relax maybe write a book and just stay forever.\n", "\nWe are a young professional couple who travel quite a bit. We had such a great time here! We booked rather last minute and the only spot left was the Overlook. It was modest in size but had a great kitchen with everything we needed to cook and a lovely view of the creek. It felt private and cozy. The...\n\n\nMore  \n\n\n", "\nAs I was traveling alone, I researched the web for a cabin outside of Sedona that was secluded yet had the security of others nearby. I wanted something rustic with a fireplace yet with all the comfort amenities (yes, I'm a wimp!). On paper, Forest Houses filled all my expectations, including my budget. I have now spent 8 days there...\n\n\nMore  \n\n\n", "\nThis is by far (for me) the best place to stay for relaxation and peace. I have stayed here probably about 8 times in my lifetime and every time is just pure nirvana. I've stayed at 3 different properties here (there are about 13 homes here) and my favorite has always been the Cook House. This house has a HUGE...\n\n\nMore  \n\n\n", "\nWe (2Adults&2Children)stayed at the Oak House and we loved the views, plenty of space for our children to enjoyed. Beautiful memories with our kids going by the creek and walking the trails. Bob and his staff were very welcoming.\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
[{"category": "hotel", "review_count": "800", "title": "Los Abrigados Resort and Spa, Sedona", "rating_string": "3.5", "address": "160 Portal Lane, Sedona, AZ 86336", "review_list": ["\nThere are 2 restaurants on site. Timos and Spoke & Wheel. Timos was amazing. It is in a pleasant setting based on a wine cellar atmosphere. Quiet and private. Romantic even. Recommend a visit and be sure to try the sea bass.\nOn the other hand, there seems no reason to visit Spoke & Wheel. The food was barely adequate...\n\n\nMore  \n\n\n", "\nWe stayed here two years ago and questioned their \"Resort\" title, but we had heard they had remodeled, so we gave it another go. We had requested a remodeled room. At check in they told us we had been upgraded due to our SPG standing. NO WAY! We got the same type, size, style of room with a fresh coat...\n\n\nMore  \n\n\n", "\nI asked for an elevator when I booked the room. They didn't say that there are only stairs so I had to load 2 luggage and a carry on as a donkey. As they sent us the construction and the entrance detour they should notify us for the stairs. Ceilings in bathroom\nFrom another era.furniture cheap. Mattress tough.\n", "\nWe are having a great time here and our room is very comfortable and clean. The rooms are older and are going to be renovated in the near future.\nThey are in the process of redoing the entrance into the property and the detour has been a little aggravating.\nAll in all, it is a convenient place to stay in...\n\n\nMore  \n\n\n", "\nThe highlight of this place are the grounds - the trees and landscaping and area by the creek are simply beautiful and the location is good. Aside from that there is little to say. It is a very generic, mediocre place to stay. The rooms are just ok, We got roped into the 90 minute presentation to get a discount...\n\n\nMore  \n\n\n", "\nA very comfortable stay on our last visit, we enjoyed a restful & leisurely time at this resort on about our fifth visit. Next to Tlaquepaque, a Mexican-type themed group of shops & restaurants, the resort grounds are on Oak creek, and allow for quiet walks away from a very busy townsite. A picnic spot, seats near the creek, par...\n\n\nMore  \n\n\n", "\nWe paid over $300 for one awful night during December because of the location. We ignored the poor reviews. THAT WAS A HUGE MISTAKE!. There were 3 of us. We had a 2 bedroom suite. The size of the unit was nice as was the floor plan and location. It was a ground floor unit that had cobwebs on the...\n\n\nMore  \n\n\n", "\nOver the Thanksgiving holiday my family booked a room on Priceline for my husband, myself and our 5 year old son. The booking terms were for one room and noted that there may be an extra charge for more than 2 guests. In reality, when we called to ask for a room with two beds they told us they could...\n\n\nMore  \n\n\n", "\nAlthough dated, you cannot beat the location and they are renovating. They feed the birds and use them to keep down the bugs - now how great is that to see them fluttering around. A short walk to the creek-side where a picnic is a must - there is also a tennis court and bird sanctuary there. The grounds are...\n\n\nMore  \n\n\n", "\nGood: Exceptional hospitality by the staff. Gorgeous & serine creekside park. Comfortable room with good wi-fi but no views & a faux fireplace. Excellent central location.\nBad: Very noisy during the day. Sounded like jackhammers upstairs. Landscapers with noisy leaf blowers every day. (Why not wit till all the leaves drop, then clean up?)\nThe ugly: Very small parking lots...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/2f/8d/b8/pool-view.jpg", "class": "3.0"}]
[{"category": "hotel", "review_count": "47", "title": "Sedona Oak Creek Inn Motel", "rating_string": "3.0", "address": "6176 Hwy 179, Village of Oak Creek (Big Park), Sedona, AZ 86351", "review_list": ["\nI must say, even though it is currently under renovation, that really is a good thing. Great staff, good room, nice breakfast spot, and great pool / hot tub! I really enjoyed my stay. The hotel to be a La Quinta, but now it is the Sedona Oak Creek in...I did get to see the sneak peek of some rooms...\n\n\nMore  \n\n\n", "\nI was looking for a room on very short notice over Valentines day weekend and the only place with availability was the Sedona Oak Creek Inn. The reviews here were mostly terrible because the place is under construction, however, I would like to say that the people that wrote those reviews seem overly pretentious in my mind. It was obvious...\n\n\nMore  \n\n\n", "\nMy boyfriend & I booked this hotel for a last minute Sedona getaway. $170 for a \"king-sized room\" seemed fair in comparison to the going rate for what was available, and the photos made it appear to be clean, bright & comfortable.\nAfter a very long day, we checked into the \"hotel\" and were very confused. A) The entire place...\n\n\nMore  \n\n\n", "\nclose to bell rock ,other activities like trails .hotel was under renovation ,good breakfast ,but you need to go early ,other Wise you won't get eggs and other protein ,big long line for food waiting at breakfast , but you can have lot of fruits ,Bagels& rest.\n", "\nWHAT A NIGHTMARE! We booked it through Expedia as the \"Mystery Hotel\" and were horrified to find when we read the reviews that this hotel was undergoing major renovations. When we called Expedia they said it was a \"no cancellation\" policy & we were stuck with the room, so we drove to the hotel. When we entered the lobby we...\n\n\nMore  \n\n\n", "\nIt's old, and it's under rennovation, but the sheets were clean, the a/c worked, and breakfast was decent. The first night there, it felt like we were the only ones in the hotel, kind of creepy, especially with the empty rooms without doors.\n", "\nThe Sedona Oak Creek Inn was sold and was being converted to A Holiday Inn Express when we were there in October. The parking lot was torn up and access to the hotel was not so good, couldn't go in through the front had to use a side door. The room was OK but not as comfy and welcoming as...\n\n\nMore  \n\n\n", "\nThe accommodations were fine. The hotel is currently being renovated, so it's not the most aesthetic on the outside. The continental breakfast is a pass....all white bread, waffles and cereal. The staff is very friendly and helpful! My trip was not based on the accommodation experience, so it was perfunctory.\n", "\nGreat access to local bike trails and bike shops. Loved the laminate floors. Room was spacious, bed was comfortable, very clean, and the room had a lot of light with the curtains open. The staff (front desk and housekeepers) were very helpful and friendly. Breakfast area was nice--waffles, biscuits and gravy, muffins, juice and coffee. They are going through renovation,...\n\n\nMore  \n\n\n", "\nThe person I spoke to and booked the room was friendly and helpful. When we arrived we were surprised to see the hotel with storage containers surrounding it and all the windows with plastic over them. We had prepaid so there was no way out. The very nice person I booked with was working the front desk and she told...\n\n\nMore  \n\n\n"], "img_url": "http://media-cdn.tripadvisor.com/media/photo-w/08/2f/f8/8a/guest-room.jpg", "class": "Unknown"}]
[{"category": "hotel", "review_count": "2", "title": "Oak Creek Spa Resort Hotel, Sedona", "rating_string": "4.5", "address": "78 CANYON DIABLO ROAD, Sedona, AZ 86351", "review_list": ["\nGreat place for good price. The DVD players sucks. DQ only grub in town.\n", "\nOne big bonus is being able to brush your teeth at the sink when your on the toilet. But on a more serious note the rooms are small but confutable and the two person Jaccuzi tub was fabulous. The property is full of personality and very laid back atmosphere. Fun for family or a romantic evening in your own tub...\n\n\nMore  \n\n\n"], "img_url": "", "class": "Unknown"}]
[{"category": "hotel", "review_count": "70", "title": "Rodeway Inn & Suites Iris Garden Motel, Sedona", "rating_string": "3.0", "address": "390 Jordan Road, Sedona, AZ 86336", "review_list": ["\nThis is not owned by Rodeway Inn any more. I stayed here with my mom and 2 sisters. It is only 2 blocks from uptown downtown Sedona. Lots of restaurtants and shops! Nice, quiet area. Small building with only 7-8 rooms. One full 2 bedroom, 2 bath with full kitchen and the one we stayed in was a full one...\n\n\nMore  \n\n\n", "\nBooked for Two Nights 12 months in advance traveled all the way from the UK to be told you can only stay one night were full. No Sorry. No help get out or we will call Law enforcement What lovely Staff you have. Don't waste your time booking this hotel\n", "\nMy wife and I stayed here over this past Labor Day weekend. We found the rooms comfortable and the location desirable, being close to downtown Sedona. However, the staff and management were objectionable. The office closed seven hours before their posted schedule, on a Saturday afternoon. This left several groups of travelers stranded in the parking lot, unable to check-in....\n\n\nMore  \n\n\n", "\nThe dirtiest place I've ever seen. They must just try to charge everyone twice because they did the same thing to me. I just read the other reviews. I tried contacting the manager, Shauna Jones, and couldn't even leave a message because her voice message box was full. I tried to contact the owner with no luck. There was dried...\n\n\nMore  \n\n\n", "\nI booked a room at this hotel for my sister back in May. She could not make the trip, and canceled the room weeks in advance. She only had to give them 24 hours notice and was assured that the room had been cancelled. Lo and behold, my credit card has been charged for two nights instead of the one...\n\n\nMore  \n\n\n", "\nI booked a night for this place on Hotwire.com and when they used my credit card for a hold for \"lncidental\" they charged my card a night stay even with proof and recruit that I booked on Hotwire.\nI received no calls back from Shauna Jones (billing/management) with many attempts to get a refund credited to my card.\nThis place...\n\n\nMore  \n\n\n", "\nFirst of all, the office is not staffed after 11:00 p.m. - and even during 'open' hours, the staff is often not there and there is a phone # taped to the window if you need to ask a question. We spent 4 nights here and could not sleep for 2 of them. The walls are paper thin. In the...\n\n\nMore  \n\n\n", "\nWe picked this place again because of reasonable price. Rooms were relatively nice. Some stains on the carpet, but overall nice.\nWe went to use the hot tub and employee told us it was closed, it was (next to our room). We looked at our phones and according to the signs the hot tub was not to close for another...\n\n\nMore  \n\n\n", "\nI was very surprised by this hotel, because it was an Expedia \"Secret Hotel\" which I bought for $60/night without knowing the identity of the hotel. I was told by the front desk staff that the regular rate for my room at this time of year is $139/night. I had a \"suite\" with a full kitchen, living room, bathroom and...\n\n\nMore  \n\n\n", "\nI found the staff poorly trained and the management just very poor. I was also told something different by each staff member, that answered the phone ,when I called about my reservation. When I needed to cancel my reservation, I could not count on the staff to take care of that. I called there three times to cancel my reservation...\n\n\nMore  \n\n\n"], "img_url": "http://static.tacdn.com/img2/x.gif", "class": "Unknown"}]
